{
  "hints": [
    {
      "content": "Start by understanding the structure of the input data. You have a list of events associated with different businesses, where each event has a type and a count of occurrences. Focus on how to parse this data effectively."
    },
    {
      "content": "Consider how you will group the events by `business_id`. This is crucial because you need to aggregate occurrences for each business. Think about using a dictionary or a similar data structure to store the totals."
    },
    {
      "content": "As you group the events, remember to sum the occurrences for the same `business_id` and `event_type`. This means you'll need to check if the event type already exists for the business when adding occurrences."
    },
    {
      "content": "Pay attention to the types of events. You might want to filter or prioritize certain event types. For instance, if you only want to consider 'ads' and 'reviews', make sure you implement this filtering logic early on."
    },
    {
      "content": "Think about how you will determine which businesses are 'active'. You may need to define a threshold for the number of occurrences across events. Make sure to clarify what 'active' means in the context of your solution."
    },
    {
      "content": "Consider edge cases, such as businesses with no events or businesses that only have one type of event. How will your logic handle these situations? Make sure your solution is robust against such cases."
    },
    {
      "content": "Once you have the total occurrences for each business, you should sort the results. Decide if you want to sort by total occurrences or by business ID in case of ties. This will affect how you present your final output."
    },
    {
      "content": "When preparing the output, think about the format required. You may need to convert your aggregated data back into a specific structure, such as a list of dictionaries or a similar format that matches the output requirements."
    },
    {
      "content": "Don't forget to handle cases where multiple businesses may have the same total occurrences. Decide on a tie-breaking rule: should you return them all, or just one? Ensure your output reflects this decision."
    },
    {
      "content": "Finally, implement the logic to filter, sort, and format your results into the desired output structure. Make sure to test your solution with various input scenarios to confirm that it behaves as expected."
    }
  ],
  "questionNotes": [
    "The input consists of a list of events with business_id, event_type, and occurrences.",
    "You need to group events by business_id and event_type to sum occurrences.",
    "Define what 'active' means—this could be a threshold for total occurrences.",
    "Consider edge cases like businesses with no events or only one type of event.",
    "Decide on sorting and tie-breaking rules for businesses with the same occurrences."
  ]
}