{
  "hints": [
    {
      "content": "Start by understanding the problem statement. You need to take two integers as input and return their sum. Think about how you would add two numbers together in a basic arithmetic operation."
    },
    {
      "content": "Consider the data types you might use for the integers. In many programming languages, integers can be represented directly, but make sure to check how your chosen language handles integer overflow, especially if the range is larger."
    },
    {
      "content": "Think about the constraints given in the problem: both integers are between -100 and 100. How does this affect your approach? Could there be any edge cases you need to consider, such as adding two negative numbers?"
    },
    {
      "content": "Try to visualize the addition operation. For example, if you have num1 = 12 and num2 = 5, how would you perform the addition step by step? What would the result be if one of the numbers is negative?"
    },
    {
      "content": "When implementing the solution, remember that the output should be a single integer. Ensure that your function or method returns the result correctly. For instance, in pseudocode, it might look like: `return num1 + num2`."
    },
    {
      "content": "Consider how you will handle input. If you're reading from standard input, make sure to convert the inputs to integers before performing the addition. For example, in Python, you might use `int(input())`."
    },
    {
      "content": "Think about edge cases. What happens when both numbers are the same? Or when one is zero? For example, adding 0 to any number should return the number itself."
    },
    {
      "content": "You should also think about performance, although this problem is simple and the constraints are small. Adding two integers is a constant time operation, O(1), so you don't need to worry about optimization here."
    },
    {
      "content": "Make sure to test your solution with a variety of inputs, including positive numbers, negative numbers, and zero. For example, check inputs like (100, 0) and (-100, -100) to ensure your logic holds."
    },
    {
      "content": "Finally, you are very close to the solution! Just remember to implement the addition operation correctly and return the result. Your function might look something like this: `def add(num1, num2): return num1 + num2`."
    }
  ],
  "questionNotes": [
    "Constraints: -100 <= num1, num2 <= 100",
    "Return format: A single integer representing the sum of num1 and num2.",
    "Consider edge cases like adding negative numbers, zero, and large positive/negative values."
  ]
}