{
  "hints": [
    {
      "content": "Start by thinking about how you would add two numbers digit by digit, similar to how you would do it on paper. You need to handle carries when the sum of two digits exceeds 9."
    },
    {
      "content": "Remember that the digits in the strings are stored in reverse order when you think of them as numbers. For example, '123' is actually '3', '2', '1' when adding. You will need to iterate from the last character to the first."
    },
    {
      "content": "Consider using two pointers to traverse both strings from the end to the beginning. You can initialize a carry variable to keep track of any overflow from adding two digits."
    },
    {
      "content": "Make sure to handle the case where the strings are of different lengths. You should continue adding digits even if one string has been fully processed."
    },
    {
      "content": "As you add digits, remember to convert the character digits to integers. You can do this by subtracting the character '0' from the digit character."
    },
    {
      "content": "After processing all digits, check if there is any carry left. If there is, you need to add it to the result as the most significant digit."
    },
    {
      "content": "Think about how to build the result string. Since you are adding from the least significant digit to the most significant, you might want to use a list to collect the digits and then reverse it at the end."
    },
    {
      "content": "Consider edge cases such as when both input strings are '0'. Your function should return '0' in this case."
    },
    {
      "content": "As a final step, ensure that your function is efficient. The time complexity should be O(max(n, m)), where n and m are the lengths of the two input strings."
    },
    {
      "content": "Now, try to implement the logic to add the digits, handle the carry, and construct the final result string. Remember to return the result as a string."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= num1.length, num2.length <= 10^4",
    "num1 and num2 consist of only digits.",
    "num1 and num2 don't have any leading zeros except for the zero itself.",
    "Return format: The sum should be returned as a string."
  ]
}