{
  "hints": [
    {
      "content": "Start by understanding the structure of the input data. You have a JSON object containing headers and rows. The 'Ads' key in the rows holds a list of lists, where each inner list represents an ad interaction."
    },
    {
      "content": "Focus on the types of actions recorded in the data. The actions are 'Clicked', 'Viewed', and 'Ignored'. Consider how each action might affect the performance metrics you want to calculate."
    },
    {
      "content": "Think about how you might categorize the ads based on their performance. You could create a dictionary or a similar structure to tally the number of each action per ad."
    },
    {
      "content": "Consider how to iterate through the rows of data. You will need to access each ad interaction and update your performance metrics accordingly. A loop will be essential here."
    },
    {
      "content": "Pay attention to the uniqueness of ad IDs. Each ad should be treated distinctly, so ensure your data structure can handle multiple interactions for the same ad ID."
    },
    {
      "content": "When calculating performance, think about what metrics are important. You might want to calculate the total number of actions per ad, as well as the breakdown of each action type."
    },
    {
      "content": "Consider edge cases, such as when there are no interactions for a particular ad. How will you handle ads that have only been ignored or have no data at all?"
    },
    {
      "content": "Think about the output format. You will likely need to return a summary for each ad, including metrics like total clicks, views, and ignores. How will you structure this output?"
    },
    {
      "content": "As you prepare to implement your solution, remember to handle the data types correctly. Ensure that counts are integers and that you maintain the correct structure for your output."
    },
    {
      "content": "Finally, when you implement the solution, consider how you will sort or order the results. Should ads be sorted by the number of clicks, views, or some other metric? This can affect how you present your final output."
    }
  ],
  "questionNotes": [
    "Input data is in JSON format with 'Ads' containing a list of interactions.",
    "Each interaction has an ad_id, user_id, and action type.",
    "Actions include 'Clicked', 'Viewed', and 'Ignored'.",
    "Each ad_id may have multiple interactions.",
    "Output should summarize the performance metrics for each ad."
  ]
}