{
  "hints": [
    {
      "content": "Start by understanding the data structure provided. You have a list of sales records with each record containing a sale date, fruit type, and the number sold. Make sure you can access individual records correctly."
    },
    {
      "content": "Consider how you will group the sales data by date. You might want to use a dictionary where the keys are dates and the values are lists of sold quantities for each fruit."
    },
    {
      "content": "Think about how to initialize your data structure. You could create an empty dictionary to store the aggregated sales data as you iterate through the records."
    },
    {
      "content": "As you process each record, check if the date already exists in your dictionary. If it does, append the sold number for the corresponding fruit; if not, create a new entry for that date."
    },
    {
      "content": "When you aggregate the sales data, ensure you handle both fruits. You might want to maintain separate totals for apples and oranges for each date."
    },
    {
      "content": "After aggregating the data, think about how you will format the output. You may need to create a list of dictionaries or another suitable structure that reflects the required output format."
    },
    {
      "content": "Consider edge cases, such as days where one fruit might not have been sold at all. Ensure your output reflects zero sales for that fruit on those days."
    },
    {
      "content": "When preparing the final output, ensure that the dates are sorted. You can sort the keys of your dictionary before creating the output."
    },
    {
      "content": "Make sure to test your solution with various sample inputs, especially edge cases like all sales for one fruit or no sales at all for a particular day."
    },
    {
      "content": "Finally, structure your output correctly. You might want to return a list of dictionaries, each containing the date, total apples sold, and total oranges sold. Ensure you format it as specified in the problem statement."
    }
  ],
  "questionNotes": [
    "Input is a list of sales records with date, fruit type, and quantity sold.",
    "Output should be structured to show total sales per fruit for each date.",
    "Handle edge cases where one fruit may not be sold on certain days.",
    "Ensure the output is sorted by date."
  ]
}