{
  "hints": [
    {
      "content": "Start by identifying the position of the rook on the chessboard. You can loop through the 8x8 matrix to find the coordinates of 'R'."
    },
    {
      "content": "Once you have the rook's position, remember that it can move vertically and horizontally. You will need to check in all four directions: up, down, left, and right."
    },
    {
      "content": "As you check in each direction, keep track of how many pawns ('p') you can attack. However, be mindful of any blocking pieces ('B' or 'p') that may prevent the rook from reaching the pawns."
    },
    {
      "content": "When moving in a direction, continue until you either hit the edge of the board or encounter a piece. If you encounter a pawn, count it as an attackable pawn, but stop checking that direction after that."
    },
    {
      "content": "Consider edge cases where the rook is positioned at the corners or edges of the board. Make sure your checks do not go out of bounds."
    },
    {
      "content": "Think about how to structure your loops. You might want to use a single loop for each direction, or you could use a helper function to avoid code duplication."
    },
    {
      "content": "Remember to initialize a counter to keep track of the number of pawns the rook can attack. Increment this counter each time you find a pawn in an unobstructed path."
    },
    {
      "content": "As you implement your solution, test it with various board configurations, especially those with multiple blocking pieces and pawns in different positions."
    },
    {
      "content": "When you have counted all the attackable pawns, make sure to return the count as the final result. The return type should be an integer."
    },
    {
      "content": "Finally, ensure that your solution handles the constraints given in the problem statement, such as the board size and the unique presence of the rook."
    }
  ],
  "questionNotes": [
    "The board is always an 8x8 matrix.",
    "There is exactly one 'R' on the board.",
    "Pieces are represented as 'R' for rook, 'B' for bishops, 'p' for pawns, and '.' for empty squares.",
    "The rook cannot move through other pieces.",
    "Return the number of pawns the rook can attack."
  ]
}