{
  "hints": [
    {
      "content": "Start by understanding the input array. The `salary` array contains unique integers representing the salaries of employees. Make sure to consider the constraints that the length of the array is at least 3."
    },
    {
      "content": "Identify the minimum and maximum salary in the `salary` array. You can use functions like `min()` and `max()` to find these values easily."
    },
    {
      "content": "Once you have the minimum and maximum salaries, think about how to exclude them from the calculation. You will need to sum the remaining salaries and count how many salaries are left."
    },
    {
      "content": "Remember that the average is calculated by dividing the total sum of the selected salaries by the count of those salaries. Be careful to only include salaries that are neither the minimum nor the maximum."
    },
    {
      "content": "Consider edge cases where the array has exactly three elements. In this case, you will end up with only one salary to average after excluding the minimum and maximum."
    },
    {
      "content": "To ensure precision in your result, remember to return the average as a floating-point number. You might want to format the output to meet the precision requirements specified in the problem."
    },
    {
      "content": "Think about how you will implement the logic to filter out the minimum and maximum salaries. You might use list comprehensions or filtering methods to create a new list of salaries."
    },
    {
      "content": "After filtering out the salaries, calculate the sum and the count of the remaining salaries. Ensure that your calculations are correct before dividing to find the average."
    },
    {
      "content": "Check if your final average calculation is within the acceptable precision range of 10^-5. You might want to use a formatting function to ensure that your output meets this requirement."
    },
    {
      "content": "Finally, put all the pieces together in your function. Make sure to handle the input and output correctly, and test your function with the provided examples to verify its correctness."
    }
  ],
  "questionNotes": [
    "Constraints: 3 <= salary.length <= 100",
    "Each salary[i] is unique and within the range of 1000 to 10^6.",
    "Return format: The result should be a floating-point number with a precision of at least 10^-5."
  ]
}