{
  "hints": [
    {
      "content": "Start by understanding the requirements of the problem. You need to find even numbers in the array that are also divisible by 3. Make sure you know how to check if a number is even and if it's divisible by another number."
    },
    {
      "content": "To check if a number is even, you can use the modulo operator. For a number `x`, `x % 2 == 0` means `x` is even. Similarly, to check if a number is divisible by 3, you can use `x % 3 == 0`."
    },
    {
      "content": "Your first step in the solution should be to iterate through the array of numbers. For each number, check if it satisfies both conditions: being even and divisible by 3."
    },
    {
      "content": "As you iterate through the array, maintain a sum of the valid numbers that meet the criteria and also count how many such numbers you find. This will be useful for calculating the average later."
    },
    {
      "content": "Remember to handle the case where there are no valid numbers. If your count of valid numbers is zero, you should return 0 as specified in the problem statement."
    },
    {
      "content": "Once you have the sum and the count of the valid numbers, you can calculate the average. The average is the sum divided by the count. However, remember to round down to the nearest integer."
    },
    {
      "content": "In programming, integer division can often be used to achieve the rounding down effect. For example, in Python, `sum // count` will give you the integer result of the division."
    },
    {
      "content": "Make sure to test your solution with edge cases, such as an array with all odd numbers or an array with only one even number that is not divisible by 3."
    },
    {
      "content": "Consider the constraints given in the problem. The input array can have up to 1000 elements, and each element can be as large as 1000. Ensure your solution efficiently handles the maximum input size."
    },
    {
      "content": "Finally, remember to return the result in the format specified in the problem statement. If you have implemented the sum and count correctly, you should be able to return the average as required."
    }
  ],
  "questionNotes": [
    "Return the average of even numbers that are divisible by 3.",
    "If no numbers meet the criteria, return 0.",
    "The average should be rounded down to the nearest integer.",
    "Constraints: 1 <= nums.length <= 1000, 1 <= nums[i] <= 1000."
  ]
}