{
  "hints": [
    {
      "content": "Start by understanding the structure of a binary tree. Each node has a value and can have up to two children. Consider how you can traverse this tree to access nodes at each level."
    },
    {
      "content": "Think about how you can keep track of the level you are currently on while traversing the tree. Using a queue can be helpful for level-order traversal (BFS)."
    },
    {
      "content": "As you traverse each level, you will need to calculate the sum of the node values and the number of nodes at that level. This will help you compute the average later."
    },
    {
      "content": "When you finish processing all nodes at a level, store the average in an array. Remember to handle the case where there are no nodes at a level."
    },
    {
      "content": "Consider the edge case where the tree only has one node. What should your function return in that case? Make sure your solution handles this correctly."
    },
    {
      "content": "Remember that the output must be in the form of an array of floating-point numbers. Make sure to format your averages correctly to meet the precision requirement."
    },
    {
      "content": "When calculating the average, ensure you are dividing the total sum of the node values by the count of nodes at that level. This will give you the correct average."
    },
    {
      "content": "As you implement your solution, think about how you can optimize it for the constraints given (up to 10,000 nodes). Avoid unnecessary computations."
    },
    {
      "content": "Don't forget to handle null values in the tree. They represent non-existent children and should not be counted in your calculations."
    },
    {
      "content": "Your final implementation should return the array of averages after processing all levels of the tree. Ensure that you are returning the correct data type as specified."
    }
  ],
  "questionNotes": [
    "The number of nodes in the tree is between 1 and 10,000.",
    "Node values can range from -2^31 to 2^31 - 1.",
    "Return format must be an array of floating-point numbers.",
    "Answers within 10^-5 of the actual answer will be accepted."
  ]
}