{
  "hints": [
    {
      "content": "Start by understanding the two ways you can play a token: face-up and face-down. Think about how each action affects your power and score. A face-up play increases your score, while a face-down play increases your power."
    },
    {
      "content": "Consider sorting the tokens array. Why might sorting help you maximize your score? Think about the strategy of using the least powerful tokens first to build up your score."
    },
    {
      "content": "When you play a token face-up, you lose power equal to the token's value. Make sure to check if your current power is sufficient to play that token. If not, you can't use that token face-up."
    },
    {
      "content": "If you can't play any tokens face-up, think about the possibility of playing tokens face-down. You need a score of at least 1 to do this, so consider how you can build your score first."
    },
    {
      "content": "While iterating through the sorted tokens, maintain a pointer for the lowest token (to play face-up) and another for the highest token (to play face-down). This will help you decide which action to take based on your current power and score."
    },
    {
      "content": "Keep track of your maximum score throughout the process. Each time you successfully play a token, update your score and power accordingly. Consider using a variable to store the maximum score encountered."
    },
    {
      "content": "Think about edge cases: What happens if your initial power is less than the smallest token? How does that affect your ability to score? Make sure to handle scenarios where no tokens can be played."
    },
    {
      "content": "Remember that you can only play a token face-down if you have a score of at least 1. This means you might need to play several tokens face-up before you can afford to play any face-down."
    },
    {
      "content": "As you implement your solution, consider using a while loop to manage your two pointers (one for face-up and one for face-down). This will allow you to maximize your score by deciding whether to play a token face-up or face-down based on your current state."
    },
    {
      "content": "Your final implementation should return the maximum score achieved after all possible plays. Make sure to test your code with various inputs, including edge cases like an empty tokens array or a power of zero."
    }
  ],
  "questionNotes": [
    "Constraints: 0 <= tokens.length <= 1000",
    "Constraints: 0 <= tokens[i], power < 10^4",
    "Return the maximum possible score as an integer.",
    "Tokens can be played in any order, but their effects on power and score must be carefully managed."
  ]
}