{
  "hints": [
    {
      "content": "Start by understanding what base 7 means. In base 7, each digit represents a power of 7, similar to how in base 10, each digit represents a power of 10. For example, the number 202 in base 7 can be broken down as 2 * 7^2 + 0 * 7^1 + 2 * 7^0."
    },
    {
      "content": "Consider how to convert a decimal (base 10) number to another base. The general approach involves repeatedly dividing the number by the base (in this case, 7) and keeping track of the remainders."
    },
    {
      "content": "When you divide the number by 7, the remainder will give you the least significant digit (rightmost) in base 7. For example, if num = 100, 100 % 7 gives you the last digit of the base 7 representation."
    },
    {
      "content": "Don't forget to handle negative numbers. When the input number is negative, you should keep track of the sign and convert the absolute value to base 7 first, then prepend the negative sign to the result."
    },
    {
      "content": "You will need a loop to repeatedly divide the number by 7 until the number becomes zero. Each iteration will give you the next digit of the base 7 representation."
    },
    {
      "content": "As you collect the remainders, consider storing them in a list or string. Remember that the order of digits will be reversed, since the first remainder corresponds to the least significant digit."
    },
    {
      "content": "Think about how to build the final string representation. After collecting the digits, you will need to reverse them to form the correct base 7 number."
    },
    {
      "content": "Make sure to handle the edge case where the input number is zero. The base 7 representation of zero is simply '0'."
    },
    {
      "content": "Consider the constraints provided in the problem. The input number can range from -10^7 to 10^7, so ensure that your solution efficiently handles both large positive and negative numbers."
    },
    {
      "content": "Finally, piece everything together. Create a function that takes an integer, checks if it's negative, converts the absolute value to base 7, and then formats the output correctly with the sign if necessary."
    }
  ],
  "questionNotes": [
    "Return a string of the base 7 representation of the given integer num.",
    "The input integer num can be negative, so account for the sign in your output.",
    "The output should be a string, and for zero, the output should be '0'.",
    "Constraints: -10^7 <= num <= 10^7"
  ]
}