{
  "hints": [
    {
      "content": "Start by understanding the problem: you need to find the maximum profit from buying and selling a stock on different days. Remember, you must buy before you sell."
    },
    {
      "content": "Consider the constraints: you can only buy and sell once, and if prices are always decreasing or constant, the maximum profit will be 0. Think about how you can represent this scenario in your solution."
    },
    {
      "content": "A good approach is to traverse the prices array while keeping track of the minimum price encountered so far. This will help you determine the best day to buy."
    },
    {
      "content": "As you iterate through the prices, calculate the potential profit by subtracting the minimum price from the current price. Keep track of the maximum profit found during this process."
    },
    {
      "content": "Remember to initialize your maximum profit variable to 0, as you need to return 0 if no profitable transaction is possible."
    },
    {
      "content": "Think about edge cases, such as when the prices array has only one price. In this case, you cannot make any transactions, so the profit should be 0."
    },
    {
      "content": "You might want to use a single loop to go through the prices array. This will help you achieve an O(n) time complexity, which is efficient given the constraints."
    },
    {
      "content": "As you implement your solution, ensure that you update the minimum price only when you find a new lower price. This is crucial for calculating the correct maximum profit."
    },
    {
      "content": "When calculating profit, make sure to check if the current profit exceeds the maximum profit found so far. Update the maximum profit accordingly."
    },
    {
      "content": "Finally, after completing the loop, return the maximum profit found. If it remains 0, it indicates that no profitable transactions were possible."
    }
  ],
  "questionNotes": [
    "1 <= prices.length <= 10^5",
    "0 <= prices[i] <= 10^4",
    "You must buy before you sell.",
    "Return 0 if no profit can be made."
  ]
}