{
  "hints": [
    {
      "content": "Consider the nature of buying and selling stocks. You can buy on one day and sell on another, or even buy and sell on the same day. Think about how you can maximize profit by making multiple transactions."
    },
    {
      "content": "Look for opportunities to buy when the price is lower than the next day's price. If prices are increasing from one day to the next, you could potentially make a profit by buying and selling."
    },
    {
      "content": "What happens if the prices are in a strictly decreasing order? Consider how you would handle that situation. You should not perform any transactions if there is no opportunity for profit."
    },
    {
      "content": "Remember that you can buy and sell on the same day. This means that if the price increases from one day to the next, you can capture that profit immediately."
    },
    {
      "content": "Think about how you can iterate through the prices array. You might want to keep track of the total profit as you go through each price and decide when to buy and sell."
    },
    {
      "content": "As you iterate through the prices, check if the current price is less than the next day's price. If it is, you should consider this as a buying opportunity."
    },
    {
      "content": "When you find a buying opportunity, calculate the profit by subtracting the buying price from the selling price. Accumulate this profit to get the total."
    },
    {
      "content": "Consider edge cases, such as when the prices array has only one element or when all prices are the same. What would your function return in these cases?"
    },
    {
      "content": "You should maintain a variable to keep track of your total profit. Each time you find a profitable transaction (buy low, sell high), add that profit to your total."
    },
    {
      "content": "Finally, remember to return the total profit after processing all the prices. Ensure that your function handles the input and output as specified in the problem statement."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= prices.length <= 3 * 10^4",
    "Prices can range from 0 <= prices[i] <= 10^4",
    "You can buy and sell on the same day.",
    "You can only hold at most one share of the stock at any time."
  ]
}