{
  "hints": [
    {
      "content": "Start by understanding the input format. The string consists of characters followed by digits, where each character indicates a letter and the digit indicates how many times that letter appears consecutively. For example, 'a3' means 'aaa'."
    },
    {
      "content": "Consider how you can parse the string. You might want to iterate through the string and identify when you encounter a letter and when you encounter a digit. Think about how you can separate these two types of characters."
    },
    {
      "content": "As you parse the string, keep track of the current character and the number of times it appears. You can use a variable to store the character and another to accumulate the digit until you reach the next character."
    },
    {
      "content": "Remember to handle cases where the digit can have more than one digit. For example, 'a10' should be interpreted as 'aaaaaaaaaa'. You will need to concatenate digits until you hit a letter."
    },
    {
      "content": "Think about what to do once you've parsed a character and its count. You might want to build a new string that represents the decompressed version of the input string."
    },
    {
      "content": "Consider edge cases where the string might start or end with a character followed by a number. For example, how would you handle 'b5a2'? Make sure your logic accounts for the entire string."
    },
    {
      "content": "You may also want to think about how to handle an empty string or a string that contains only numbers or letters. What should your function return in these cases?"
    },
    {
      "content": "As you build your output string, think about efficiency. Instead of concatenating strings directly in a loop, consider using a list to gather parts and then join them at the end."
    },
    {
      "content": "Once you've built the decompressed string, ensure that you have a way to return it correctly. You may want to check if the output matches expected formats or conditions."
    },
    {
      "content": "Finally, make sure to test your function with various inputs, including edge cases like 'a0' (which should return an empty string) or 'z1' (which should return 'z')."
    }
  ],
  "questionNotes": [
    "Input is a string with characters followed by digits.",
    "Digits can be more than one character long (e.g., 'a10').",
    "Handle edge cases like empty strings or strings with only numbers or letters.",
    "Output should be a decompressed string based on the input format."
  ]
}