{
  "hints": [
    {
      "content": "Start by understanding the criteria for a country to be considered 'big'. A country qualifies if it has an area of at least 3,000,000 km² or a population of at least 25,000,000."
    },
    {
      "content": "Think about how you can filter the countries based on these criteria. You will likely need to use a WHERE clause in your SQL query to apply these conditions."
    },
    {
      "content": "Remember that you need to return specific columns in your result: the name, population, and area of the countries that meet the criteria."
    },
    {
      "content": "When writing your SQL query, consider using OR to combine the two conditions for area and population. For example: `WHERE area >= 3000000 OR population >= 25000000`."
    },
    {
      "content": "Make sure to select the right columns in your SELECT statement. You will need to include `name`, `population`, and `area` in your output."
    },
    {
      "content": "Pay attention to the return format. The result table can be in any order, so you don't need to add an ORDER BY clause unless specified."
    },
    {
      "content": "Consider edge cases, such as countries that are very close to the thresholds of area and population. Ensure your conditions are inclusive of these edge cases."
    },
    {
      "content": "You might want to test your query with a variety of data to ensure it works correctly. For instance, try adding a country with an area of exactly 3,000,000 and one with a population of exactly 25,000,000."
    },
    {
      "content": "As a final step, review your SQL syntax for any potential errors, such as missing commas or incorrect column names. Ensure your query is well-structured."
    },
    {
      "content": "Now, you can put everything together into a single SQL statement. Start with SELECT, then FROM, and finally your WHERE conditions to filter the results."
    }
  ],
  "questionNotes": [
    "The primary key is the 'name' column, which means it contains unique values.",
    "The conditions for a country to be considered 'big' are: area >= 3000000 or population >= 25000000.",
    "You need to return the columns: name, population, and area.",
    "The result can be returned in any order."
  ]
}