{
  "hints": [
    {
      "content": "Start by understanding the structure of a binary tree. Each node can have up to two children, and you need to explore paths from the root to each leaf node."
    },
    {
      "content": "Remember that a leaf node is defined as a node with no children. Make sure to check for this condition as you traverse the tree."
    },
    {
      "content": "Consider using a depth-first search (DFS) approach to explore each path from the root to the leaves. You can use recursion or an explicit stack for this."
    },
    {
      "content": "As you traverse the tree, keep track of the current path from the root to the current node. You can use a string to represent this path."
    },
    {
      "content": "When you reach a leaf node, add the current path to your list of paths. Make sure to format the path correctly using '->' to separate node values."
    },
    {
      "content": "Think about how you will handle backtracking. After exploring a path to a leaf, you need to remove the last node from your current path before exploring another branch."
    },
    {
      "content": "Don't forget to handle edge cases, such as when the tree has only one node. In this case, the path will just be the value of that single node."
    },
    {
      "content": "Consider the constraints given in the problem. The number of nodes is limited to 100, which means your solution should be efficient but doesn't need to handle extremely large trees."
    },
    {
      "content": "Your final output should be a list of strings, where each string represents a path from the root to a leaf. Ensure that the output format matches the requirements."
    },
    {
      "content": "To get closer to the solution, think about how you will initiate your DFS traversal. You might want to start from the root node and pass an empty path string to begin."
    }
  ],
  "questionNotes": [
    "A leaf is defined as a node with no children.",
    "The output should be a list of strings representing paths from the root to each leaf.",
    "The number of nodes in the tree is between 1 and 100.",
    "Node values range from -100 to 100."
  ]
}