{
  "hints": [
    {
      "content": "Start by understanding the data structure provided in the input. You have a list of books, each represented as an array containing details like book_id, title, author, published_year, and rating."
    },
    {
      "content": "Focus on the 'rating' field, which can either be a number or `null`. Your goal is to identify which books have a `null` rating."
    },
    {
      "content": "Consider how you will iterate through the list of books. You might want to use a loop to access each book's details one by one."
    },
    {
      "content": "As you loop through the books, check the value of the rating field. You can use a simple conditional statement to determine if it is `null`."
    },
    {
      "content": "Think about how you will store the results of your findings. You might want to create a new list to hold the titles or IDs of books with `null` ratings."
    },
    {
      "content": "Remember to handle cases where all books have ratings. Your solution should still work and return an empty list in such scenarios."
    },
    {
      "content": "Consider the output format. You need to return a list of books with `null` ratings. Make sure your output matches the expected structure."
    },
    {
      "content": "When checking for `null`, remember that in many programming languages, `null` is not the same as `0` or an empty string. Ensure your condition specifically checks for `null`."
    },
    {
      "content": "If you're using a programming language that supports it, think about using built-in functions or methods that can simplify your task, such as filtering."
    },
    {
      "content": "Finally, once you have identified the books with `null` ratings, ensure you format the output correctly. You might want to return just the titles or the entire book objects based on the requirements."
    }
  ],
  "questionNotes": [
    "Input is structured as a JSON with 'headers' and 'rows'.",
    "Focus on the 'rating' field for each book.",
    "Ensure to handle cases with no books having null ratings.",
    "Output should be a list of books with null ratings.",
    "Check specifically for null, not other falsy values."
  ]
}