{
  "hints": [
    {
      "content": "Start by understanding the conditions for calculating the bonus. An employee receives a bonus if their ID is odd and their name does not start with 'M'."
    },
    {
      "content": "Consider how you can check if an employee's ID is odd. You can use the modulo operator `%` to determine this: `employee_id % 2 != 0`."
    },
    {
      "content": "Next, think about how to check the first character of the employee's name. You can use string indexing or a method to get the first character and compare it to 'M'."
    },
    {
      "content": "Remember to handle the case where the employee's name might be empty or null. Ensure your logic accounts for this to avoid errors."
    },
    {
      "content": "You will need to create a new column for the bonus in your result set. Make sure to initialize it to 0 for employees who do not meet the bonus criteria."
    },
    {
      "content": "After calculating the bonus, remember to order the final result by `employee_id`. This is crucial for the output format."
    },
    {
      "content": "Consider using a SQL `CASE` statement to simplify your logic for calculating the bonus. This can help you return the correct value based on the conditions."
    },
    {
      "content": "Make sure to test your solution with edge cases, such as employees with IDs that are very high or negative, and names that are very short or long."
    },
    {
      "content": "When returning the result, ensure that the output format matches the specified structure: it should have columns for `employee_id` and `bonus`."
    },
    {
      "content": "Finally, think about how you would write the SQL query to implement all of this logic. You will likely use a `SELECT` statement with the `CASE` for bonus calculation."
    }
  ],
  "questionNotes": [
    "The `employee_id` is unique for each employee, ensuring no duplicates in the results.",
    "The result must be ordered by `employee_id`.",
    "The bonus is 100% of the salary for qualifying employees; otherwise, it is 0.",
    "Pay attention to the conditions for bonus eligibility: odd `employee_id` and name not starting with 'M'."
  ]
}