{
  "hints": [
    {
      "content": "Start by splitting the input string `title` into individual words. You can use the `split()` method in Python, which will break the string at each space."
    },
    {
      "content": "Once you have the list of words, remember that you need to process each word based on its length. Consider using a loop to iterate through each word."
    },
    {
      "content": "For each word, check its length. If the length is 1 or 2, you should convert the entire word to lowercase. You can use the `lower()` method for this."
    },
    {
      "content": "If the word has a length of 3 or more, you will need to capitalize it. Use string slicing to separate the first letter from the rest of the word, and then convert the first letter to uppercase and the rest to lowercase."
    },
    {
      "content": "Remember to handle the capitalization correctly. For example, you can use `word[0].upper()` for the first letter and `word[1:].lower()` for the rest of the word."
    },
    {
      "content": "After processing each word, you will need to join them back together into a single string. Use the `join()` method with a space as the separator."
    },
    {
      "content": "Consider edge cases such as words that are already in the correct format or words that are entirely in uppercase. Your logic should still apply consistently."
    },
    {
      "content": "Make sure to test your function with various inputs, including titles with multiple spaces or different casing styles. This will help ensure your solution is robust."
    },
    {
      "content": "As you build your solution, keep in mind the constraints given in the problem statement. The input will always be a valid string with words separated by a single space."
    },
    {
      "content": "Finally, after processing all words and joining them, return the resulting string. Ensure that the output is formatted correctly according to the problem requirements."
    }
  ],
  "questionNotes": [
    "1 <= title.length <= 100",
    "title consists of words separated by a single space without any leading or trailing spaces.",
    "Each word consists of uppercase and lowercase English letters and is non-empty."
  ]
}