{
  "hints": [
    {
      "content": "Start by understanding the two main criteria for categorizing the box: 'Bulky' and 'Heavy'. Make sure you know what conditions define each category."
    },
    {
      "content": "To determine if a box is 'Bulky', check if any of its dimensions (length, width, height) are greater than or equal to 10,000. This is a straightforward comparison."
    },
    {
      "content": "Alternatively, calculate the volume of the box using the formula: volume = length * width * height. Then check if the volume is greater than or equal to 1,000,000,000."
    },
    {
      "content": "For the 'Heavy' category, simply check if the mass of the box is greater than or equal to 100. This is another direct comparison."
    },
    {
      "content": "Remember that a box can be both 'Bulky' and 'Heavy'. Think about how you would structure your conditions to check for both categories at the same time."
    },
    {
      "content": "Consider using boolean flags to represent whether the box is 'Bulky' and 'Heavy'. This can help you simplify the final decision-making process."
    },
    {
      "content": "After determining the status of the box (whether it is 'Bulky' and/or 'Heavy'), you will need to return the correct string based on the combinations of these statuses."
    },
    {
      "content": "Pay attention to the order of conditions when returning the category. The combinations should be checked in this order: 'Both', 'Bulky', 'Heavy', and then 'Neither'."
    },
    {
      "content": "Don't forget to handle edge cases, such as the minimum and maximum values for length, width, height, and mass, to ensure your solution is robust."
    },
    {
      "content": "Finally, structure your return statement based on the boolean flags you set earlier. For example: if (isBulky && isHeavy) return 'Both'; otherwise, check the other conditions."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= length, width, height <= 100,000; 1 <= mass <= 1,000.",
    "The volume of the box is calculated as length * width * height.",
    "Return format must be a string: 'Both', 'Bulky', 'Heavy', or 'Neither'."
  ]
}