{
  "hints": [
    {
      "content": "Start by understanding what a pangram is. A pangram is a sentence that includes every letter of the English alphabet at least once. Can you list all the letters in the English alphabet?"
    },
    {
      "content": "Consider how you can track which letters have appeared in the sentence. You might want to use a data structure that allows you to store unique letters. What data structures can help you with this?"
    },
    {
      "content": "Think about how you will iterate through the sentence. You can loop through each character in the string. What will you do when you encounter a letter that you haven't seen before?"
    },
    {
      "content": "Remember that the English alphabet consists of 26 letters. After processing the sentence, how will you check if you have seen all 26 letters?"
    },
    {
      "content": "You might want to use a set to store the letters you encounter. Sets automatically handle uniqueness for you. How would you add letters to a set as you iterate through the sentence?"
    },
    {
      "content": "As you add letters to your set, keep track of the total count of unique letters. Once you finish processing the sentence, how will you compare this count to 26?"
    },
    {
      "content": "Consider edge cases, such as very short sentences. What is the minimum length of a sentence that can still be a pangram? How will you handle sentences that are shorter than 26 characters?"
    },
    {
      "content": "Think about the return value of your function. You need to return true if the sentence is a pangram and false otherwise. How will you structure your return statement based on the count of unique letters?"
    },
    {
      "content": "Make sure to account for all letters in the alphabet. If your set contains less than 26 letters after processing the sentence, what will you return?"
    },
    {
      "content": "Now, put together all the parts: iterate through the sentence, add letters to a set, check the size of the set, and return the appropriate boolean value. What does your final function look like?"
    }
  ],
  "questionNotes": [
    "A pangram must include every letter from 'a' to 'z'.",
    "The input sentence will only contain lowercase letters.",
    "The length of the sentence will be between 1 and 1000 characters.",
    "Return true if the sentence is a pangram, otherwise return false."
  ]
}