{
  "hints": [
    {
      "content": "Start by understanding what prime numbers are. A prime number is a natural number greater than 1 that cannot be formed by multiplying two smaller natural numbers. Make sure you can identify prime numbers within the given range."
    },
    {
      "content": "Consider how to generate all prime numbers within the specified range [left, right]. You might want to use the Sieve of Eratosthenes or trial division for this task. Think about how to efficiently check for primes."
    },
    {
      "content": "Once you have a list of prime numbers in the range, think about how to find pairs of these numbers. You need to ensure that for any two primes num1 and num2, they satisfy the condition left <= num1 < num2 <= right."
    },
    {
      "content": "To find the closest pair of prime numbers, you should calculate the difference between each pair of consecutive primes. This will help you identify the pair with the minimum difference."
    },
    {
      "content": "Remember to handle the case where there are fewer than two prime numbers in the range. If you find only one prime or none, you should return [-1, -1]."
    },
    {
      "content": "When iterating through the list of primes to find the closest pair, keep track of both the minimum difference and the corresponding pair of primes. You may want to initialize a variable to hold the minimum difference."
    },
    {
      "content": "If you find multiple pairs with the same minimum difference, ensure you return the one with the smallest num1. This requires you to check both the difference and the values of num1 and num2."
    },
    {
      "content": "Consider edge cases such as when left equals right. In this case, check if that single number is prime, and remember that you need two distinct primes."
    },
    {
      "content": "Make sure to test your solution against the upper constraint limits, like left and right being 10^6. Efficiency is key, so think about how your prime-checking method scales."
    },
    {
      "content": "Finally, structure your return statement carefully. You need to return an array of two integers, ensuring that you adhere to the specified format: [num1, num2]. If no valid pair is found, return [-1, -1]."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= left <= right <= 10^6",
    "Return format: Array of two integers [num1, num2]",
    "If no valid primes are found, return [-1, -1]",
    "If multiple pairs have the same minimum difference, return the one with the smallest num1."
  ]
}