{
  "hints": [
    {
      "content": "Start by understanding how to convert a decimal number to hexadecimal. Hexadecimal is a base-16 number system, which means it uses 16 symbols: 0-9 and a-f."
    },
    {
      "content": "For positive integers, you can repeatedly divide the number by 16 and keep track of the remainders. These remainders will give you the hexadecimal digits in reverse order."
    },
    {
      "content": "Remember that for negative integers, you will need to use the two's complement representation. This means you should first convert the number to its positive equivalent in a 32-bit format."
    },
    {
      "content": "When converting a negative number, consider how to represent it in binary first. For example, -1 in a 32-bit integer is represented as all 1s in binary."
    },
    {
      "content": "Make sure to handle the case where the input number is zero. The hexadecimal representation of zero should simply be '0'."
    },
    {
      "content": "As you build the hexadecimal string, remember to convert each remainder to its corresponding hexadecimal character (0-9 for 0-9 and a-f for 10-15)."
    },
    {
      "content": "You should construct the result string in reverse order since you will be collecting the remainders from the least significant digit to the most significant digit."
    },
    {
      "content": "Pay attention to leading zeros; your final string should not have any leading zeros unless the result is '0'."
    },
    {
      "content": "Consider using a loop to repeatedly divide the number by 16 until the number becomes zero. Each iteration will yield a new hexadecimal digit."
    },
    {
      "content": "Finally, remember to return the result as a lowercase string, as specified in the problem statement. Make sure to concatenate the characters in the correct order before returning."
    }
  ],
  "questionNotes": [
    "Constraints: -2^31 <= num <= 2^31 - 1",
    "Use two's complement for negative integers.",
    "Return format: lowercase hexadecimal string with no leading zeros (except for zero itself)."
  ]
}