{
  "hints": [
    {
      "content": "Start by understanding what a homogenous substring is. A homogenous substring consists of consecutive characters that are the same. For example, in the string 'aaa', 'a', 'aa', and 'aaa' are all homogenous substrings."
    },
    {
      "content": "Consider how you can identify consecutive characters in the string. You might want to iterate through the string and keep track of the current character and its count of consecutive appearances."
    },
    {
      "content": "As you traverse the string, think about how to accumulate the count of homogenous substrings. If you have a character that appears 'k' times consecutively, how many substrings can you form from it?"
    },
    {
      "content": "For a character that appears 'k' times consecutively, the number of homogenous substrings formed is the sum of the first 'k' natural numbers: 1 + 2 + ... + k. This can be calculated using the formula k * (k + 1) / 2."
    },
    {
      "content": "Make sure to handle the modulo operation since the result can be very large. Remember to apply the modulo operation (10^9 + 7) at each step of your calculation to prevent overflow."
    },
    {
      "content": "Think about edge cases, such as when the string consists of a single character or when all characters are different. How would your approach handle these cases?"
    },
    {
      "content": "While iterating through the string, keep a variable to track the count of the current character. If the next character is different, reset this count and add to your total count of homogenous substrings."
    },
    {
      "content": "You might want to initialize your total count of homogenous substrings to zero before starting the iteration. Don't forget to also account for the last group of characters after the loop ends."
    },
    {
      "content": "When implementing your logic, consider using a single loop to traverse the string, which will keep your solution efficient with a time complexity of O(n)."
    },
    {
      "content": "Finally, ensure that your function returns the total count of homogenous substrings modulo (10^9 + 7) as specified in the problem statement."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= s.length <= 10^5",
    "s consists of lowercase letters.",
    "Return the result modulo 10^9 + 7."
  ]
}