{
  "hints": [
    {
      "content": "Start by understanding the data structure provided in the sample test case. You have three main tables: 'Person', 'Country', and 'Calls'. Each table has its own attributes that you will need to work with."
    },
    {
      "content": "Focus on the 'Calls' table, which contains interactions between people identified by their 'caller_id' and 'callee_id'. Think about how you can use these IDs to find out which countries the callers and callees belong to."
    },
    {
      "content": "Consider how you can map the 'caller_id' and 'callee_id' from the 'Calls' table to the 'Person' table to get the names and phone numbers. This will help you identify the countries involved in each call."
    },
    {
      "content": "Next, you need to correlate the phone numbers with their respective countries. Use the 'Country' table to find out which country corresponds to each phone number's country code."
    },
    {
      "content": "Think about how to keep track of the number of calls made between different countries. You might want to use a dictionary or a similar data structure to count calls for each country pair."
    },
    {
      "content": "When counting calls, remember to consider both directions: a call from Country A to Country B is the same as a call from Country B to Country A. Make sure your counting logic reflects this."
    },
    {
      "content": "As you gather call data, consider how to define what it means for a country to be 'safe' for investment. You might want to set a threshold for the number of calls or analyze the frequency of calls between countries."
    },
    {
      "content": "Don't forget to handle edge cases, such as when there are no calls between certain countries. Ensure your logic can handle these scenarios without errors."
    },
    {
      "content": "Once you've counted the calls and determined which countries are safe for investment, think about how you will format your output. What information do you need to return, and in what structure?"
    },
    {
      "content": "Finally, you should be close to implementing the solution. Consider how you will iterate through the data to compile your results, and ensure you are returning the correct countries based on your criteria for safety."
    }
  ],
  "questionNotes": [
    "The 'Person' table contains unique IDs for each person.",
    "The 'Country' table maps country names to their respective country codes.",
    "The 'Calls' table records interactions between people by their IDs.",
    "Pay attention to the indexing of IDs; they start from 1.",
    "Ensure to handle cases with no calls between countries properly.",
    "Define clear criteria for what makes a country 'safe' for investment."
  ]
}