{
  "hints": [
    {
      "content": "Start by understanding what a prefix is. A prefix is a substring that appears at the beginning of another string. For example, in the string 'attention', 'at' is a prefix."
    },
    {
      "content": "Consider how you might iterate through the array of strings. You will need to check each string to see if it starts with the given prefix."
    },
    {
      "content": "You can use a loop to go through each string in the 'words' array. For each string, you will want to check if it matches the prefix."
    },
    {
      "content": "Remember to handle strings with leading spaces or special characters. Ensure that your prefix check is done correctly by trimming any unnecessary whitespace if needed."
    },
    {
      "content": "Think about how to check if a string starts with a specific substring in your programming language of choice. Many languages have built-in functions for this."
    },
    {
      "content": "As you iterate through the words, maintain a count of how many strings match the prefix condition. You can initialize a counter variable to zero."
    },
    {
      "content": "Make sure to return the count after you finish checking all the strings. This means you will need to have a return statement at the end of your function."
    },
    {
      "content": "Consider edge cases such as when the 'words' array is empty or when the prefix is longer than any string in the array. How will your code handle these situations?"
    },
    {
      "content": "Think about the constraints given in the problem. The maximum length of the words and prefix is 100, which should be manageable within a simple loop."
    },
    {
      "content": "Finally, you can use a method like 'startswith' in Python or similar functions in other languages to simplify your prefix checking. For example: `if word.startswith(pref):`."
    }
  ],
  "questionNotes": [
    "1 <= words.length <= 100",
    "1 <= words[i].length, pref.length <= 100",
    "words[i] and pref consist of lowercase English letters.",
    "Return the count of strings that contain pref as a prefix."
  ]
}