{
  "hints": [
    {
      "content": "Start by identifying the vowels in the string. Remember that you need to check for the presence of all five vowels: 'a', 'e', 'i', 'o', and 'u'. You can use a set to keep track of the vowels you encounter."
    },
    {
      "content": "Next, consider how you will count the consonants in the substrings. A simple way to do this is to iterate through the string and maintain a count of consonants as you expand your substring."
    },
    {
      "content": "Think about how you can efficiently find all substrings. You might want to use a sliding window approach, where you expand the right end of the window until you meet the conditions, then contract the left end to find valid substrings."
    },
    {
      "content": "As you expand your window, keep track of how many vowels and consonants are in the current substring. Use a dictionary or array to count occurrences of each vowel."
    },
    {
      "content": "When your window contains all five vowels, check if the number of consonants equals k. If it does, you have found a valid substring. Consider how you might count all valid substrings that can be formed by adjusting the left end of the window."
    },
    {
      "content": "Remember to handle edge cases. For instance, if k is 0, ensure that your substring only contains vowels and no consonants. What happens if there are not enough consonants in the string?"
    },
    {
      "content": "Think about how to efficiently count substrings once you find a valid starting point. You can potentially count multiple valid substrings by adjusting the right end of your window."
    },
    {
      "content": "Consider the constraints of the problem. The length of the string is at least 5, which means you will always have enough characters to potentially contain all vowels. How does this affect your approach?"
    },
    {
      "content": "Make sure to account for the fact that the string consists only of lowercase letters. This simplifies your checks for vowels and consonants, but ensure you do not miss any characters."
    },
    {
      "content": "Finally, once you have a valid substring, think about how to increment your count of valid substrings. You may want to use a nested loop or a while loop to explore all possible valid substrings starting from a given index."
    }
  ],
  "questionNotes": [
    "You need to find substrings containing all five vowels: 'a', 'e', 'i', 'o', 'u'.",
    "The substring must contain exactly k consonants.",
    "The input string length is between 5 and 250.",
    "The input string consists only of lowercase English letters.",
    "0 <= k <= word.length - 5."
  ]
}