{
  "hints": [
    {
      "content": "Start by understanding what makes an integer 'special'. An integer is special if all its digits are distinct. For example, 123 is special, but 112 is not."
    },
    {
      "content": "Consider the range of numbers you need to evaluate. You will be counting special integers from 1 to n. Make sure to include both endpoints in your count."
    },
    {
      "content": "Think about how you can check if a number is special. One approach is to convert the number to a string and check if there are any repeating characters."
    },
    {
      "content": "Instead of checking each number up to n individually, consider how you can optimize this process. Can you count special numbers based on their digit structure?"
    },
    {
      "content": "Notice that the maximum value for n is 2 * 10^9. This means n can have up to 10 digits. How can you leverage this fact to minimize the number of checks?"
    },
    {
      "content": "Break down the problem by considering the number of special integers with fewer digits than n. For instance, how many special integers are there with 1 digit, 2 digits, etc.?"
    },
    {
      "content": "For k-digit special numbers, you can use permutations. For example, for a 2-digit special number, you can choose the first digit (1-9) and the second digit (0-9 excluding the first)."
    },
    {
      "content": "When counting special integers with the same number of digits as n, you need to ensure that you do not exceed n. This requires careful digit-by-digit comparison."
    },
    {
      "content": "As you iterate through the digits of n, keep track of the digits you've already used to ensure that the next digit you choose is distinct."
    },
    {
      "content": "Remember to handle leading zeros properly. A special integer cannot start with 0, so adjust your counting accordingly when forming numbers."
    },
    {
      "content": "Consider using a set or a boolean array to track which digits have been used as you build potential special integers from the digits of n."
    },
    {
      "content": "Think about edge cases, such as when n is a single-digit number. How does this affect your counting logic?"
    },
    {
      "content": "After counting all special integers with fewer digits than n, you should also count those that have the same number of digits but are less than or equal to n."
    },
    {
      "content": "Finally, ensure that you correctly accumulate your counts. You will need to sum the counts from both the shorter digit numbers and the special numbers with the same number of digits as n."
    },
    {
      "content": "Your final step will be to return the total count of special integers. Make sure to verify your logic with the provided examples to ensure accuracy."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= n <= 2 * 10^9",
    "A special integer has all distinct digits.",
    "Count special integers in the range [1, n].",
    "Consider edge cases, especially for small values of n."
  ]
}