{
  "hints": [
    {
      "content": "Start by converting the date strings into a format that makes it easier to work with. You can split the strings by '-' to get the month and day as integers."
    },
    {
      "content": "Remember that Alice's stay includes both her arrival and departure dates. This means you need to consider the range from arriveAlice to leaveAlice as inclusive."
    },
    {
      "content": "Similarly, do the same for Bob's dates. Ensure you have the start and end dates for both Alice and Bob correctly represented as integers."
    },
    {
      "content": "To find the overlapping days, you need to determine the later of the two arrival dates and the earlier of the two departure dates. This will give you the range of days they are both in Rome."
    },
    {
      "content": "Calculate the overlapping start date as: `max(arriveAlice, arriveBob)` and the overlapping end date as: `min(leaveAlice, leaveBob)`."
    },
    {
      "content": "Once you have the overlapping start and end dates, check if the overlapping period is valid. An invalid period occurs if the start date is after the end date."
    },
    {
      "content": "If the overlapping period is valid, compute the number of days in that range. You can do this by counting the days from the start date to the end date, inclusive."
    },
    {
      "content": "To count the days, you may need to implement a helper function that converts the month and day into a single integer representing the day of the year."
    },
    {
      "content": "Consider the number of days in each month carefully. Remember that the year is not a leap year, so February has 28 days."
    },
    {
      "content": "Finally, once you have the start and end dates in terms of day of the year, the total number of days they are together can be calculated as: `end - start + 1` if valid."
    }
  ],
  "questionNotes": [
    "Dates are in the format 'MM-DD'.",
    "Alice's arrival and departure dates are inclusive.",
    "Bob's arrival and departure dates are inclusive.",
    "All dates are valid and within the same non-leap year."
  ]
}