{
  "hints": [
    {
      "content": "Start by understanding the structure of a binary tree. Each node has a value and can have up to two children. Familiarize yourself with how to traverse a binary tree, as you'll need to visit each node to calculate the averages."
    },
    {
      "content": "Consider how to calculate the sum of values in a subtree. You might want to use a recursive approach where you sum the values of the current node and its children. Think about how you can return both the sum and the count of nodes from your recursive function."
    },
    {
      "content": "Remember that the average is calculated as the sum of values divided by the count of nodes in the subtree. Pay attention to the requirement that the average should be rounded down to the nearest integer."
    },
    {
      "content": "When implementing your function, think about the base case for your recursion. What should happen when you reach a leaf node (a node with no children)? How will you handle that in your calculations?"
    },
    {
      "content": "As you traverse the tree, maintain a count of how many nodes have values equal to the computed average of their subtrees. This will be your final output, so ensure you are updating this count correctly."
    },
    {
      "content": "Make sure to handle edge cases, such as when the tree only has one node. In this case, the average of the subtree is simply the value of that node itself."
    },
    {
      "content": "Consider the performance of your solution. Since the number of nodes can go up to 1000, ensure that your approach is efficient. A depth-first search (DFS) strategy could work well here."
    },
    {
      "content": "You might want to use a helper function to encapsulate the logic for calculating the sum and count of nodes in the subtree. This function can return both values back to the main function."
    },
    {
      "content": "When calculating the average, remember to use integer division to achieve the 'rounded down' effect. In Python, this can be done using the '//' operator."
    },
    {
      "content": "Finally, ensure that you are correctly comparing the node's value to the calculated average. If they match, increment your count of nodes that meet the criteria."
    }
  ],
  "questionNotes": [
    "The average is defined as the sum of values divided by the count of nodes, rounded down.",
    "The number of nodes in the tree is in the range [1, 1000].",
    "Node values are in the range [0, 1000].",
    "A subtree includes the node itself and all its descendants."
  ]
}