{
  "hints": [
    {
      "content": "Start by identifying what a vowel substring is. Remember, a substring must be contiguous and consist only of the vowels 'a', 'e', 'i', 'o', and 'u'. You need to check for substrings that contain all five vowels."
    },
    {
      "content": "Consider how you might iterate through the string to find all possible substrings. You can use two nested loops: the outer loop to set the starting point and the inner loop to extend the substring."
    },
    {
      "content": "As you extract substrings, keep track of whether they contain only vowels. You can use a simple check to see if each character in the substring is a vowel."
    },
    {
      "content": "Once you have a substring that consists only of vowels, check if it contains all five vowels. You might find it helpful to use a set to track which vowels you have seen so far."
    },
    {
      "content": "Think about how to efficiently check if your set of vowels contains all five required vowels. You can compare the size of the set to 5 or check against a predefined set of vowels."
    },
    {
      "content": "Remember to count each valid substring only once. If you find a substring that meets the criteria, increment your count."
    },
    {
      "content": "Consider edge cases, such as strings that are too short to contain all five vowels. For example, if the length of the string is less than 5, you can immediately return 0."
    },
    {
      "content": "When counting substrings, be mindful of overlapping substrings. For example, in the string 'aeiouu', both 'aeiou' and 'aeiouu' are valid substrings."
    },
    {
      "content": "You may want to optimize your solution by breaking out of the inner loop early if you find that a substring is no longer valid (i.e., it contains a consonant)."
    },
    {
      "content": "Finally, ensure that your function returns the correct count of vowel substrings after checking all possible substrings in the input string. Consider edge cases where no valid substrings are found."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= word.length <= 100",
    "The string consists of lowercase English letters only.",
    "A substring must be contiguous and non-empty.",
    "A vowel substring must contain all five vowels: 'a', 'e', 'i', 'o', 'u'."
  ]
}