{
  "hints": [
    {
      "content": "Start by thinking about what the function `createHelloWorld` needs to do. It should return another function. What does the returned function need to return?"
    },
    {
      "content": "Remember that the function returned by `createHelloWorld` should not depend on any input parameters. It should always return the same output regardless of what arguments are passed to it."
    },
    {
      "content": "Consider how you can define a function inside another function in JavaScript. This is a common pattern known as a 'closure'."
    },
    {
      "content": "When defining the inner function, make sure to use the correct syntax. You can use either a function declaration or a function expression."
    },
    {
      "content": "The inner function should be able to accept any number of arguments, but you might not need to use them. Think about how to define a function that takes parameters without using them."
    },
    {
      "content": "To ensure that the inner function always returns 'Hello World', simply return that string directly in the function body. No need for any conditional logic."
    },
    {
      "content": "Make sure to test your function with various inputs, including no arguments and multiple arguments. The output should always be 'Hello World'."
    },
    {
      "content": "Consider edge cases such as passing in `null`, `undefined`, or other types. Your function should still return 'Hello World' in all these cases."
    },
    {
      "content": "Think about how you can encapsulate the inner function within `createHelloWorld` and ensure it is returned correctly. This is crucial for the function to work as intended."
    },
    {
      "content": "Finally, remember to return the inner function from `createHelloWorld`. This is the key step that allows you to invoke the returned function later."
    }
  ],
  "questionNotes": [
    "The function should always return 'Hello World', regardless of the input.",
    "The inner function can accept any number of arguments, but they should not affect the output.",
    "Constraints specify that the length of args can be between 0 and 10."
  ]
}