{
  "hints": [
    {
      "content": "Start by understanding the structure of the DataFrame. You have two columns: 'name' and 'salary'. Make sure you can access these columns correctly."
    },
    {
      "content": "To create a new column in a DataFrame, you can assign values to it using the syntax: `df['new_column'] = values`. Think about what values you need for the 'bonus' column."
    },
    {
      "content": "The bonus is defined as double the salary. You will need to perform a mathematical operation on the 'salary' column. How can you access the salary values?"
    },
    {
      "content": "Remember that you can perform operations on entire columns in a DataFrame. For example, if you want to double the salary, you can multiply the 'salary' column by 2."
    },
    {
      "content": "Consider the data types of the columns. The 'salary' column is of type int, which means you can perform arithmetic operations directly. What will be the type of the new 'bonus' column?"
    },
    {
      "content": "When you create the new 'bonus' column, ensure that it aligns with the existing rows in the DataFrame. Each employee should have a corresponding bonus value."
    },
    {
      "content": "Think about how to handle edge cases. What if the salary is zero or negative? How should the bonus be calculated in such cases?"
    },
    {
      "content": "You can use the `assign` method in pandas to create a new column while keeping the original DataFrame intact. This could be an alternative approach to directly assigning a new column."
    },
    {
      "content": "After calculating the bonus, check the structure of your DataFrame to ensure it has three columns: 'name', 'salary', and 'bonus'. You can use `df.head()` to inspect the first few rows."
    },
    {
      "content": "Finally, remember to test your solution with the provided sample input to ensure it produces the expected output. What would the final DataFrame look like after adding the bonus column?"
    }
  ],
  "questionNotes": [
    "The 'bonus' column must contain double the values of the 'salary' column.",
    "Ensure that the new column aligns with existing rows.",
    "Consider edge cases like zero or negative salaries.",
    "The output DataFrame should have three columns: 'name', 'salary', and 'bonus'."
  ]
}