{
  "hints": [
    {
      "content": "Start by understanding the structure of the input data. You have two tables: Customers and Orders. The Customers table contains customer information, while the Orders table contains the products each customer has purchased."
    },
    {
      "content": "Focus on filtering the Orders table first. You need to find customers who have bought both products 'A' and 'B'. Consider how you might group orders by customer_id to check for the presence of these products."
    },
    {
      "content": "Think about using a data structure that allows you to track which products each customer has purchased. A dictionary or a set could be helpful here, where the key is the customer_id and the value is a set of products."
    },
    {
      "content": "Once you have the products for each customer, you need to check if they contain both 'A' and 'B'. You can use set operations to verify this condition efficiently."
    },
    {
      "content": "Next, you need to ensure that the customers you found do not have product 'C' in their orders. This means you will need to check if 'C' is absent from the set of products for those customers."
    },
    {
      "content": "Consider how to combine the results of your checks. You might want to create a final list of customer_ids that meet both conditions: having 'A' and 'B', and not having 'C'."
    },
    {
      "content": "Remember to pay attention to the output format. You need to return the customer_id and customer_name for each qualifying customer. Think about how to join the data from the Customers table based on the filtered customer_ids."
    },
    {
      "content": "As you implement your solution, think about edge cases. For example, what if no customers meet the criteria? Ensure your code handles this gracefully without errors."
    },
    {
      "content": "Consider the performance of your solution. If the Orders table is large, how might your choice of data structures and algorithms impact the efficiency of your solution?"
    },
    {
      "content": "Finally, put all the pieces together. After filtering the customers based on the conditions you’ve established, format the output correctly as specified in the problem statement. You should have a list of lists containing customer_id and customer_name."
    }
  ],
  "questionNotes": [
    "Ensure you understand the input format: two tables with specific columns.",
    "The output must include both customer_id and customer_name.",
    "Pay attention to edge cases, such as no customers meeting the criteria.",
    "Consider performance implications when dealing with larger datasets."
  ]
}