{
  "hints": [
    {
      "content": "Start by understanding what a fancy string is. A fancy string is defined as one where no three consecutive characters are the same. Think about how you can identify groups of consecutive characters in the string."
    },
    {
      "content": "Consider how you might traverse the string. A simple approach is to iterate through the string while keeping track of the count of consecutive characters. This will help you determine when to delete characters."
    },
    {
      "content": "As you iterate, maintain a count of how many times the current character has appeared consecutively. If the count exceeds 2, you know you need to skip adding the third character to your result."
    },
    {
      "content": "When building the result string, think about using a list to collect characters. This is often more efficient than concatenating strings directly in a loop. You can convert the list back to a string at the end."
    },
    {
      "content": "Remember to handle edge cases, such as strings that are already fancy or strings that consist of only one type of character. For example, 'aaa' should become 'aa' after processing."
    },
    {
      "content": "Pay attention to the constraints given in the problem. The input string can be up to 100,000 characters long, so your solution should ideally be O(n) in time complexity to handle the largest cases efficiently."
    },
    {
      "content": "Consider how you will return the final result. The problem states that the answer will always be unique, which means you don't need to worry about multiple valid outputs."
    },
    {
      "content": "As you implement your solution, test it with various inputs, including those with no characters to delete and those with many. This will help ensure your logic is robust."
    },
    {
      "content": "When you find a character that has appeared more than twice consecutively, think about how you can skip adding it to your result. You might use a simple condition to check the count before adding."
    },
    {
      "content": "Finally, ensure that your implementation correctly handles the last few characters of the string, as they may not trigger the same checks as the main loop. Make sure to check the count one last time before finalizing the output."
    }
  ],
  "questionNotes": [
    "A fancy string has no three consecutive equal characters.",
    "You must delete the minimum number of characters to achieve this.",
    "The output string should be returned in the same format as the input.",
    "The input string length can be between 1 and 100,000.",
    "The answer will always be unique."
  ]
}