{
  "hints": [
    {
      "content": "Start by understanding the three valid cases for capital usage in a word. Can you identify what each case entails? Consider examples for each case, such as 'ALLUPPER', 'alllower', and 'OnlyFirst'."
    },
    {
      "content": "Think about how you can check if all characters in the string are uppercase. What built-in string methods can help you with this? For instance, the method '.isupper()' might be useful."
    },
    {
      "content": "Now, consider how you can check if all characters are lowercase. Which string method would help you here? You might want to look into '.islower()' for this check."
    },
    {
      "content": "Next, focus on the case where only the first letter is capitalized. How can you verify that the first character is uppercase while ensuring all subsequent characters are lowercase? Think about indexing and string slicing."
    },
    {
      "content": "When checking if only the first letter is capitalized, consider using string slicing. For example, 'word[0]' gives you the first character, and 'word[1:]' gives you the rest. How would you compare these?"
    },
    {
      "content": "Make sure to handle edge cases, such as single-character words. What would be the expected output for a word like 'A' or 'b'? Do these cases fit into any of the valid categories?"
    },
    {
      "content": "Remember that the length of the word can be between 1 and 100. How does this constraint affect your approach? Is there anything special you need to consider for very short or very long words?"
    },
    {
      "content": "You can combine your checks into a single return statement. Think about how you can use logical operators to return true if any of the three conditions are met. For example: 'return condition1 or condition2 or condition3'."
    },
    {
      "content": "Before finalizing your solution, consider edge cases again. What happens if the word is empty or contains non-alphabetic characters? Although the problem states it consists of letters, it's good to be cautious."
    },
    {
      "content": "Finally, can you write a concise function that implements all these checks? Ensure that your function returns true if any of the three conditions for correct capital usage are satisfied."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= word.length <= 100",
    "The input word consists only of lowercase and uppercase English letters.",
    "Return type: Boolean (true or false).",
    "Consider edge cases such as single-character words."
  ]
}