{
  "hints": [
    {
      "content": "Start by understanding the structure of the DataFrame. It contains columns like 'employee_id', 'name', 'department', and 'salary'. Familiarize yourself with how to access these columns."
    },
    {
      "content": "To display rows from a DataFrame, you can use indexing. Remember that indexing in most programming languages starts from 0. Think about how to specify which rows you want to retrieve."
    },
    {
      "content": "Consider using a method that allows you to slice the DataFrame. In many libraries, there are specific functions designed for this purpose. Look for methods that can take a range of indices."
    },
    {
      "content": "Remember that you only want the first three rows. How would you specify that range? If you're using a method that takes a start and end index, what values would you use?"
    },
    {
      "content": "Think about edge cases. What if the DataFrame has fewer than three rows? How will your solution handle that situation? Make sure it doesn’t throw an error."
    },
    {
      "content": "Check the documentation for the DataFrame library you're using. There might be a built-in function specifically for retrieving a certain number of rows from the top of the DataFrame."
    },
    {
      "content": "When you retrieve the rows, ensure that the output format matches the expected format in the problem statement. You might need to convert the result into a specific structure."
    },
    {
      "content": "If you're using a library like Pandas in Python, you might want to look into the `.head()` method. This method can be very handy for getting the top rows of a DataFrame."
    },
    {
      "content": "After retrieving the first three rows, double-check that your output matches the example provided in the problem statement. Validate the data types and structure."
    },
    {
      "content": "Finally, implement your solution and test it with various DataFrame sizes, including edge cases where the DataFrame has fewer than three rows. Ensure your solution is robust."
    }
  ],
  "questionNotes": [
    "The DataFrame has four columns: employee_id, name, department, and salary.",
    "You need to display exactly the first three rows of the DataFrame.",
    "Consider how to handle cases where the DataFrame has fewer than three rows to avoid errors.",
    "Ensure that the output format matches the example given in the problem statement."
  ]
}