{
  "hints": [
    {
      "content": "Start by understanding the range of integers you need to work with. You will be dealing with all integers from 1 to n, inclusive. Make sure you can iterate through this range."
    },
    {
      "content": "Think about how you can separate the integers into two categories: those that are divisible by m and those that are not. You can use the modulus operator (%) to check for divisibility."
    },
    {
      "content": "As you iterate through the range, maintain two separate sums: one for the integers that are divisible by m (let's call it num2) and another for those that are not (num1)."
    },
    {
      "content": "Remember to initialize your sums (num1 and num2) to zero before starting the iteration. This is crucial to avoid carrying over any previous values."
    },
    {
      "content": "When checking for divisibility, use an if-statement to determine whether to add the current integer to num1 or num2. For example: if (i % m == 0) then add to num2."
    },
    {
      "content": "After completing the iteration, you will have both sums calculated. The next step is to compute the difference: num1 - num2."
    },
    {
      "content": "Consider edge cases where m is greater than n. For instance, if n = 5 and m = 6, how would your sums look? Make sure your logic handles such scenarios correctly."
    },
    {
      "content": "Also, think about what happens when m = 1. Every integer in the range will be divisible by 1. How will this affect your sums?"
    },
    {
      "content": "Before finalizing your solution, ensure that your code runs efficiently within the given constraints (1 <= n, m <= 1000). A simple loop through the range should suffice."
    },
    {
      "content": "Finally, return the result of num1 - num2 as your output. Make sure that your function's return type matches the expected output format."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= n, m <= 1000",
    "Return the difference num1 - num2",
    "num1 is the sum of integers not divisible by m",
    "num2 is the sum of integers divisible by m"
  ]
}