{
  "hints": [
    {
      "content": "Start by understanding how the weight gain works based on the day. On odd days, you gain the weight of the heaviest pizza you eat, and on even days, you gain the second heaviest. This means you want to maximize the heaviest pizzas on odd days."
    },
    {
      "content": "Consider how you can group the pizzas into sets of four. Since you can only eat four pizzas a day, think about how to select these groups strategically to maximize your weight gain over the days."
    },
    {
      "content": "Remember that the input array `pizzas` is guaranteed to have a length that is a multiple of 4. This means you can always divide the pizzas evenly into groups of four."
    },
    {
      "content": "Try sorting the `pizzas` array first. This will help you easily identify the heaviest and second heaviest pizzas when selecting groups for each day."
    },
    {
      "content": "When selecting pizzas for a day, make sure to consider both the odd and even days. You want to ensure that the heaviest pizzas are consumed on odd days for maximum gain."
    },
    {
      "content": "Think about how you can track which pizzas have already been eaten. You might want to use a boolean array or simply modify the original array to mark pizzas as eaten."
    },
    {
      "content": "As you select pizzas for each day, remember to always pick the four pizzas that will give you the highest possible weight gain for that day, based on the day type (odd/even)."
    },
    {
      "content": "Consider using a greedy approach where you always select the best possible combination of pizzas for the current day based on the current state of the remaining pizzas."
    },
    {
      "content": "After sorting the pizzas, you can iterate through the sorted list in reverse order, taking groups of four pizzas at a time. This will help you easily access the heaviest pizzas."
    },
    {
      "content": "Finally, after calculating the total weight gain for all days, ensure that you return the result as a single integer representing the total weight gained. Don't forget to account for the correct indexing when accessing the pizzas."
    }
  ],
  "questionNotes": [
    "The input array `pizzas` is guaranteed to have a length that is a multiple of 4.",
    "Each pizza can only be eaten once.",
    "On odd-numbered days (1-indexed), you gain the weight of the heaviest pizza (Z).",
    "On even-numbered days, you gain the weight of the second heaviest pizza (Y).",
    "Return a single integer representing the total weight gained."
  ]
}