{
  "hints": [
    {
      "content": "Start by identifying the key requirements for a valid 3-digit even number. Remember, it must be formed by three digits from the given array, cannot have leading zeros, and must end with an even digit."
    },
    {
      "content": "Consider how to handle duplicates in the input array. You may want to use a set to ensure that the integers you create are unique."
    },
    {
      "content": "Think about how you can generate all possible combinations of three digits. You might want to use nested loops or a combination function to explore different selections of digits."
    },
    {
      "content": "When forming the numbers, pay special attention to the last digit. To ensure the number is even, the last digit must be one of the even digits (0, 2, 4, 6, 8)."
    },
    {
      "content": "Don't forget to check for leading zeros. If your selected digits include zero and it is the first digit, that combination should be discarded."
    },
    {
      "content": "After generating potential numbers, you should store them in a way that allows you to easily filter out duplicates. A set can be very useful for this purpose."
    },
    {
      "content": "Once you have your unique numbers, sort them before returning. This ensures the output meets the requirement of being in sorted order."
    },
    {
      "content": "Consider edge cases, such as when all digits are odd or when there are not enough unique digits to form a 3-digit number. What should your function return in these cases?"
    },
    {
      "content": "Make sure to iterate through the digits carefully to build numbers. You might want to use a method that allows you to track which digits have been used in each iteration."
    },
    {
      "content": "Finally, think about how to implement the logic for generating the numbers. You could create a helper function to handle the combination and validation of each 3-digit number."
    }
  ],
  "questionNotes": [
    "The output must be a sorted array of unique integers.",
    "The integer cannot have leading zeros.",
    "Only even integers should be included in the output.",
    "The input array can contain duplicates, which should be handled appropriately."
  ]
}