{
  "hints": [
    {
      "content": "Start by understanding the problem statement clearly. You need to find the first occurrence of `needle` in `haystack`. What does 'first occurrence' mean in this context?"
    },
    {
      "content": "Consider the constraints provided: both strings have a length between 1 and 10,000. This means your solution should be efficient enough to handle the maximum input sizes without timing out."
    },
    {
      "content": "Think about how you would approach the problem without using built-in functions. Can you iterate through `haystack` and check for `needle` at each position?"
    },
    {
      "content": "Remember that string indexing starts at 0 in most programming languages. If you find `needle` starting at position `i`, you should return `i`."
    },
    {
      "content": "What happens if `needle` is longer than `haystack`? Make sure to handle this case by returning -1 immediately if `needle.length > haystack.length`."
    },
    {
      "content": "As you iterate through `haystack`, you can use a loop that goes from index 0 to `haystack.length - needle.length`. This ensures you don't go out of bounds when checking for `needle`."
    },
    {
      "content": "For each index `i`, check if the substring of `haystack` starting at `i` and of length `needle.length` matches `needle`. If it does, return `i`."
    },
    {
      "content": "Consider edge cases, such as when `needle` is an empty string. According to the problem statement, this won't happen, but it's good to think about how your code would handle it."
    },
    {
      "content": "If you finish the loop without finding `needle`, remember to return -1 as specified in the problem statement."
    },
    {
      "content": "You can optimize your solution further by using built-in string functions, but remember that the goal is to demonstrate your understanding of string manipulation and algorithm design."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= haystack.length, needle.length <= 10^4",
    "Both haystack and needle consist of only lowercase English characters.",
    "Return the index of the first occurrence of needle in haystack, or -1 if not found.",
    "Indexing starts from 0."
  ]
}