{
  "hints": [
    {
      "content": "Start by understanding what an anagram is. An anagram is formed by rearranging the letters of a word. For example, 'listen' and 'silent' are anagrams."
    },
    {
      "content": "Consider how to identify if two words are anagrams. One common method is to sort the characters of both words and compare the sorted results."
    },
    {
      "content": "Think about how you can traverse the array of words. You need to check pairs of adjacent words to see if they are anagrams."
    },
    {
      "content": "Remember that you can only delete a word if it has an anagram immediately before it. This means you should be cautious when iterating through the list."
    },
    {
      "content": "You may want to use a loop to go through the words array. If you find anagrams, you can remove the second word in the pair and continue checking from the previous word."
    },
    {
      "content": "Consider using a data structure that helps you keep track of the unique words you want to keep. A list or a set could be useful here."
    },
    {
      "content": "When removing elements from the list, be aware that the indices will shift. You might need to adjust your loop to account for this."
    },
    {
      "content": "Think about edge cases, such as when all words are unique or when all words are anagrams of each other. How would your logic handle these scenarios?"
    },
    {
      "content": "You can create a helper function to check for anagrams, which can simplify your main logic. This function could take two words and return a boolean."
    },
    {
      "content": "Finally, after processing the list, ensure that you return the resultant list of words. Make sure to handle the return format as specified in the problem statement."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= words.length <= 100",
    "Each word has a length of 1 to 10.",
    "Words consist of lowercase English letters.",
    "You can only delete words at index i if words[i-1] and words[i] are anagrams.",
    "The return format should be a list of strings."
  ]
}