{
  "hints": [
    {
      "content": "Start by understanding the structure of a binary tree and how to traverse it. Each node has a value, and you will need to access these values level by level."
    },
    {
      "content": "Consider using a breadth-first search (BFS) approach. BFS is ideal for level-order traversal, which will help you gather nodes level by level."
    },
    {
      "content": "As you traverse each level, keep track of the maximum value found in that level. You can initialize a variable to store the maximum value for each level."
    },
    {
      "content": "Think about how you will store the maximum values for each level. A list or array could work well for this purpose, where each index corresponds to a tree level."
    },
    {
      "content": "Remember to handle the case where the binary tree might be empty. What should your function return if there are no nodes in the tree?"
    },
    {
      "content": "When implementing BFS, you can use a queue to keep track of nodes to visit. Each time you process a node, enqueue its children for the next level."
    },
    {
      "content": "As you process each node, compare its value to the current maximum for that level. Update the maximum if the current node's value is greater."
    },
    {
      "content": "After processing all nodes at a given level, append the maximum value found to your results list. Make sure to reset the maximum for the next level."
    },
    {
      "content": "Think about the constraints given in the problem statement. You need to ensure your solution can handle up to 10,000 nodes efficiently."
    },
    {
      "content": "Finally, consider edge cases such as a tree with only one node or a tree that is skewed to one side. How would your solution handle these scenarios?"
    }
  ],
  "questionNotes": [
    "Return an array of the largest values for each row (0-indexed).",
    "The tree can have between 0 and 10,000 nodes.",
    "Node values range from -2^31 to 2^31 - 1.",
    "Ensure your solution handles empty trees correctly."
  ]
}