{
  "hints": [
    {
      "content": "Start by understanding the problem statement clearly. You need to find the index of the largest integer in a list. Consider how you would approach this problem if the list were very small."
    },
    {
      "content": "Think about how you would iterate through the list to compare each element. What variable would you use to keep track of the largest number found so far?"
    },
    {
      "content": "Remember that lists in most programming languages are zero-indexed. This means that the first element is at index 0. Make sure your index calculations reflect this."
    },
    {
      "content": "Consider edge cases, such as when the list has only one element. What should your function return in this case? How does this affect your logic?"
    },
    {
      "content": "What if there are multiple occurrences of the largest integer? Should you return the index of the first occurrence or the last? Think about how you would handle this in your implementation."
    },
    {
      "content": "As you iterate through the list, update your maximum value and its index whenever you find a new larger integer. You might use two variables: one for the maximum value and another for its index."
    },
    {
      "content": "Make sure to handle the case where the list might be empty. What should your function return if there are no elements in the list?"
    },
    {
      "content": "Consider the time complexity of your approach. A single pass through the list is optimal for this problem. How can you ensure that you only loop through the list once?"
    },
    {
      "content": "Before finalizing your implementation, think about testing your function with various inputs, including lists with negative numbers, duplicates, and varying lengths."
    },
    {
      "content": "Your final implementation should return the index of the largest integer. Ensure that you are returning the correct index and not the value itself. Consider how to structure your return statement."
    }
  ],
  "questionNotes": [
    "The list can contain duplicate values.",
    "Return the index of the first occurrence of the largest integer if there are duplicates.",
    "The list may be empty; handle this case appropriately.",
    "The function should operate in O(n) time complexity for efficiency."
  ]
}