{
  "hints": [
    {
      "content": "Start by understanding the structure of the input data. You have a list of tweets, each containing a user ID, tweet ID, the tweet content, and the tweet date."
    },
    {
      "content": "Focus on extracting hashtags from the tweet content. Hashtags start with a `#` symbol and continue until a space or the end of the string."
    },
    {
      "content": "Consider using a regular expression to identify hashtags in the tweet text. This can help you easily extract all hashtags from a single tweet."
    },
    {
      "content": "Remember that multiple hashtags can exist in a single tweet. Ensure your extraction logic captures all of them."
    },
    {
      "content": "Once you have the hashtags, think about how to count their occurrences across all tweets. A dictionary or hash map can be useful for this purpose."
    },
    {
      "content": "As you count hashtags, keep track of the tweet dates. You may need to consider the time frame for trending hashtags."
    },
    {
      "content": "Define what 'trending' means in this context. Is it based on the number of occurrences within a specific time frame or overall?"
    },
    {
      "content": "Consider edge cases where a hashtag might appear in only one tweet or where tweets have no hashtags at all. How will your solution handle these scenarios?"
    },
    {
      "content": "Think about how to sort the hashtags by their counts. You'll need to decide how to handle ties—should you sort alphabetically or by the latest date of occurrence?"
    },
    {
      "content": "When sorting, remember to keep the top N trending hashtags. Decide on a reasonable value for N based on the problem requirements."
    },
    {
      "content": "Ensure your solution is efficient, especially if the number of tweets is large. Consider the time complexity of your counting and sorting operations."
    },
    {
      "content": "Prepare to format your output correctly. The result should list the trending hashtags along with their counts."
    },
    {
      "content": "Think about how you will return the results. Will it be a list, a dictionary, or some other structure?"
    },
    {
      "content": "As you implement your solution, test it with various datasets, including those with no hashtags and those with many hashtags."
    },
    {
      "content": "Finally, ensure that your code is clean and well-documented. This will help others understand your logic and approach."
    }
  ],
  "questionNotes": [
    "Input data consists of a list of tweets with user_id, tweet_id, tweet content, and tweet date.",
    "Hashtags start with `#` and can be followed by alphanumeric characters.",
    "Handle multiple hashtags within a single tweet.",
    "Define what 'trending' means: occurrences within a specific time frame or overall.",
    "Consider edge cases: tweets with no hashtags, and unique hashtags.",
    "Decide on a tie-breaking strategy for sorting hashtags.",
    "Output format should clearly list trending hashtags and their counts."
  ]
}