{
  "hints": [
    {
      "content": "Start by understanding the structure of the input data. You have a list of employee records, each with an id, month, and salary. Make sure to parse this correctly before proceeding."
    },
    {
      "content": "Think about how you would store the cumulative salaries. A dictionary or a hashmap could be useful here, where the key is the employee id and the value is the cumulative salary."
    },
    {
      "content": "Consider the order of the records. Since you need to calculate cumulative salaries month by month, sorting the records by month for each employee might be necessary."
    },
    {
      "content": "Remember that multiple records can exist for the same employee in different months. You need to ensure that you are adding salaries correctly across these records."
    },
    {
      "content": "As you iterate through the records, keep track of the last month processed for each employee. This will help you determine if you need to carry over the last cumulative salary."
    },
    {
      "content": "When calculating the cumulative salary, ensure you are adding the current month's salary to the last cumulative salary of that employee."
    },
    {
      "content": "Think about edge cases, such as when an employee has no salary records for certain months. How will you handle gaps in the data?"
    },
    {
      "content": "You may want to initialize the cumulative salary for each employee to zero. This way, if an employee has no records, you can still manage their cumulative salary correctly."
    },
    {
      "content": "Consider how you will format the output. The result should likely be in the same format as the input, but with cumulative salaries included."
    },
    {
      "content": "Make sure to handle the case where multiple employees have the same month. Each employee's cumulative salary should be calculated independently."
    },
    {
      "content": "Think about how you will iterate through the months. You might want to loop through the months in the range of the minimum to the maximum month present in your records."
    },
    {
      "content": "You could create a nested loop: the outer loop for each month and the inner loop for each employee to calculate their cumulative salary for that month."
    },
    {
      "content": "Consider using a list to store the output rows. Each entry should represent an employee's cumulative salary for a specific month."
    },
    {
      "content": "As you build the output, ensure that you are maintaining the correct order of employees and months as per the input data."
    },
    {
      "content": "Finally, think about how you will return the final result. You might need to convert your cumulative salary data back into the specified output format."
    }
  ],
  "questionNotes": [
    "Input is a JSON object with headers and rows.",
    "Each employee has unique id, but can have multiple records for different months.",
    "Cumulative salary should be calculated month by month.",
    "Handle gaps where an employee may not have records for certain months."
  ]
}