{
  "hints": [
    {
      "content": "Start by understanding the structure of the input data. You have two main components: Contacts and Calls. Each contact has an ID, and each call is associated with a contact ID, type, and duration."
    },
    {
      "content": "Consider how you will access the calls for each contact. You might want to use a dictionary or a map to group calls by contact ID for easier processing later."
    },
    {
      "content": "Think about how to calculate the total duration of calls for each contact. You will need to iterate through the calls and sum the durations based on the contact ID."
    },
    {
      "content": "When summing durations, remember to account for both incoming and outgoing calls. You can treat them the same way since you are only interested in the total duration."
    },
    {
      "content": "As you calculate the total durations, keep track of the maximum duration found and the corresponding contact ID. This will help you identify the contact with the longest call."
    },
    {
      "content": "Consider edge cases, such as when there are contacts with no calls. Ensure your solution can handle these gracefully without errors."
    },
    {
      "content": "You might need to sort the results if there are ties in call durations. Think about how you can store the results to facilitate this."
    },
    {
      "content": "Once you identify the contact with the longest call duration, remember to format your output correctly. You may need to return the contact's full name along with the duration."
    },
    {
      "content": "Make sure to test your solution with various scenarios, including cases with multiple contacts having the same maximum duration, to ensure your tie-breaking logic works."
    },
    {
      "content": "Finally, implement the logic to return the result as specified. You will likely want to return an object containing the contact's name and the duration."
    }
  ],
  "questionNotes": [
    "Input data is structured as JSON with 'Contacts' and 'Calls' arrays.",
    "Each contact has a unique ID, and each call refers to a contact by this ID.",
    "Duration is measured in seconds, and both incoming and outgoing calls should be considered.",
    "If multiple contacts have the same maximum duration, determine how to handle tie-breaking (e.g., return the first one encountered).",
    "Ensure to handle cases where a contact may not have any calls."
  ]
}