{
  "hints": [
    {
      "content": "Start by understanding the input format. You are given a list of numbers and their corresponding frequencies. Each entry represents how many times a number appears in the dataset."
    },
    {
      "content": "Consider how you would represent the dataset in a more manageable form. You might want to expand the numbers according to their frequencies to visualize the dataset better."
    },
    {
      "content": "Think about how to find the median in a sorted list. The median is the middle value when the data is sorted. If there is an even number of elements, the median is the average of the two middle numbers."
    },
    {
      "content": "Remember that the number of elements in your dataset is determined by summing the frequencies. This total will help you identify the median's position."
    },
    {
      "content": "As you calculate the total number of elements, keep track of the cumulative frequency. This will help you locate the median position without needing to fully expand the dataset."
    },
    {
      "content": "Identify whether the total count of elements is odd or even. This distinction will affect how you calculate the median."
    },
    {
      "content": "For an odd total count, the median is the value at the position (total_count // 2). For an even total count, you will need the values at positions (total_count // 2 - 1) and (total_count // 2)."
    },
    {
      "content": "While calculating the cumulative frequency, keep an eye on when you reach the median position. This will allow you to stop early and avoid unnecessary calculations."
    },
    {
      "content": "If the total count is odd, the median will be the number corresponding to the exact middle cumulative frequency. If it's even, you will average the two middle numbers."
    },
    {
      "content": "Consider edge cases such as when all frequencies are zero or when there's only one unique number with a non-zero frequency. How would these cases affect your median calculation?"
    },
    {
      "content": "Make sure to handle large datasets efficiently. Expanding the entire dataset may not be feasible due to memory constraints, so focus on cumulative frequencies instead."
    },
    {
      "content": "When averaging two numbers for the median, ensure that you handle the result's data type correctly. The median should be returned as a float if it results in a non-integer."
    },
    {
      "content": "Think about how to implement your solution iteratively. You can maintain a running total of frequencies and check against the median position without storing all numbers."
    },
    {
      "content": "Before finalizing your approach, review the problem for any constraints or specific requirements regarding the output format. Ensure your solution adheres to these."
    },
    {
      "content": "Now, try to outline your solution step-by-step. Start with calculating the total number of elements, then the cumulative frequency, and finally determine the median based on the total count."
    }
  ],
  "questionNotes": [
    "Input consists of a list of numbers and their frequencies.",
    "The median is the middle value in a sorted dataset.",
    "Handle both odd and even total counts differently when finding the median.",
    "Consider edge cases like all frequencies being zero or only one unique number.",
    "Output the median as a float if it is not an integer."
  ]
}