{
  "hints": [
    {
      "content": "Start by understanding the relationship between the original array and the changed array. Each element in the original array corresponds to an element in the changed array that is exactly double its value."
    },
    {
      "content": "Consider how you can determine if an array is a doubled array. One approach is to check if every element has a corresponding double in the array."
    },
    {
      "content": "Think about the frequency of each number in the changed array. You might want to use a data structure that allows you to count occurrences, like a hash map or a dictionary."
    },
    {
      "content": "When you find an element in the changed array, remember to check if its double exists and that you have enough occurrences of both the element and its double."
    },
    {
      "content": "What happens if an element in the changed array is zero? Consider how zero behaves when doubled and how it might affect your counting."
    },
    {
      "content": "Sorting the changed array could help in systematically checking for doubles. Think about how sorting can simplify the process of matching elements."
    },
    {
      "content": "After sorting, you can iterate through the changed array. For each element, check if its double exists in the remaining elements. How will you keep track of counts?"
    },
    {
      "content": "If you find an element and its double, decrement their counts. Make sure to handle cases where you might not find a double for every element."
    },
    {
      "content": "Consider edge cases, such as when the changed array has an odd length. What does that imply about the possibility of forming the original array?"
    },
    {
      "content": "Finally, after processing all elements, check if you have successfully formed the original array. If there are any leftover counts, return an empty array."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= changed.length <= 10^5",
    "0 <= changed[i] <= 10^5",
    "The output can be in any order.",
    "If changed is not a doubled array, return an empty array."
  ]
}