{
  "hints": [
    {
      "content": "Start by understanding the properties of the function f(x, y). Remember that it is monotonically increasing in both x and y. This means that if you increase either x or y, the value of f will never decrease."
    },
    {
      "content": "Consider the implications of the function being monotonically increasing. For a given z, if f(x, y) < z, then f(x + 1, y) and f(x, y + 1) will also be less than z. This can help you set boundaries for your search."
    },
    {
      "content": "You need to find pairs (x, y) such that f(x, y) == z. Think about how you can systematically explore possible values for x and y. You might want to use a nested loop to iterate through possible values."
    },
    {
      "content": "Since f is monotonically increasing, if you find that f(x, y) > z, you can stop increasing y and move to the next value of x. This can help reduce the number of iterations needed."
    },
    {
      "content": "Remember that both x and y must be positive integers. This means your loops should start from 1 and go up to a reasonable limit, given the constraints (1 <= x, y <= 1000)."
    },
    {
      "content": "When implementing your loops, consider the maximum possible value of z. If f(x, y) is guaranteed to be less than or equal to z for certain x and y, you can limit your search space accordingly."
    },
    {
      "content": "Think about how to store the valid pairs (x, y) that satisfy f(x, y) == z. You might want to use a list to collect these pairs as you find them during your iterations."
    },
    {
      "content": "As you implement your solution, ensure that you are correctly calling the CustomFunction to get the value of f(x, y). This is crucial for checking the condition f(x, y) == z."
    },
    {
      "content": "Consider edge cases where z is at its minimum (1) or maximum (100). What pairs (x, y) would satisfy f(x, y) == z in these scenarios? This can help you verify your solution."
    },
    {
      "content": "Finally, remember that the output should be a list of pairs. Make sure to format your result correctly before returning it, ensuring each pair is represented as [x, y]."
    }
  ],
  "questionNotes": [
    "The function f(x, y) is monotonically increasing.",
    "You need to find all pairs (x, y) such that f(x, y) == z.",
    "Both x and y must be positive integers.",
    "1 <= x, y <= 1000 and 1 <= z <= 100.",
    "Return format should be a list of pairs, e.g., [[x1, y1], [x2, y2]]."
  ]
}