{
  "hints": [
    {
      "content": "Start by understanding the structure of the input. You have an array called `gain`, which represents the change in altitude between consecutive points. The first point (index 0) has an altitude of 0."
    },
    {
      "content": "Consider how you will calculate the altitude at each point. You can maintain a running total of the altitude as you iterate through the `gain` array."
    },
    {
      "content": "Initialize a variable to keep track of the current altitude, starting at 0. As you loop through the `gain` array, add each gain to this current altitude."
    },
    {
      "content": "You should also keep track of the highest altitude encountered during your trip. Initialize another variable for this purpose, starting at 0."
    },
    {
      "content": "As you iterate through the `gain` array, after updating the current altitude, check if it exceeds the highest altitude recorded. If it does, update the highest altitude variable."
    },
    {
      "content": "Remember to handle the case where all gains are negative. The highest altitude might still be 0 if the biker never climbs above the starting point."
    },
    {
      "content": "Think about the edge cases. For example, what if the `gain` array has only one element? How would you handle that situation?"
    },
    {
      "content": "Make sure to return the highest altitude after you finish iterating through the `gain` array. The return value should be an integer representing that altitude."
    },
    {
      "content": "Consider the constraints given in the problem. The length of the `gain` array is between 1 and 100, and each element in the array can range from -100 to 100. Ensure your solution works efficiently within these bounds."
    },
    {
      "content": "Finally, your implementation should look something like this: Loop through the `gain`, update the current altitude, check and update the highest altitude, and return the highest altitude at the end."
    }
  ],
  "questionNotes": [
    "The biker starts at altitude 0.",
    "The `gain` array has a length of n, which means there are n + 1 points to consider.",
    "Each element in `gain` represents the change in altitude between consecutive points.",
    "The output should be the highest altitude reached during the trip."
  ]
}