{
  "hints": [
    {
      "content": "Start by understanding the input format. You are given a list of mountains, where each mountain is represented by a pair of coordinates [x, h], with 'x' being the position and 'h' being the height."
    },
    {
      "content": "Consider what it means for one mountain to be visible from another. A mountain is visible if there are no taller mountains in between it and the observer's viewpoint."
    },
    {
      "content": "Think about how to compare the heights of mountains based on their positions. You might want to sort the mountains by their 'x' coordinate to simplify visibility checks."
    },
    {
      "content": "As you iterate through the sorted mountains, keep track of the maximum height encountered so far. This will help you determine if the current mountain is visible."
    },
    {
      "content": "Remember to handle cases where multiple mountains have the same 'x' coordinate. In such cases, only the tallest one at that position should be considered for visibility."
    },
    {
      "content": "When checking visibility, if the current mountain's height is greater than the maximum height seen so far, it is visible. Update your maximum height accordingly."
    },
    {
      "content": "Consider edge cases such as when all mountains are of the same height or when mountains are positioned at the same x-coordinate. How does this affect your visibility logic?"
    },
    {
      "content": "Think about how you will store the count of visible mountains. You might want to initialize a counter before starting your iteration through the mountains."
    },
    {
      "content": "Make sure to return the count of visible mountains as the output of your function. The return format should be a single integer representing the number of visible mountains."
    },
    {
      "content": "Finally, remember to test your solution with various test cases, including edge cases, to ensure your logic holds in all scenarios. For example, try inputs with only one mountain or mountains with varying heights."
    }
  ],
  "questionNotes": [
    "Input is a list of pairs [x, h] representing the position and height of mountains.",
    "Mountains may share the same x-coordinate; only the tallest at that position counts.",
    "The output should be a single integer representing the number of visible mountains.",
    "Consider edge cases like all mountains being the same height or positioned at the same x."
  ]
}