{
  "hints": [
    {
      "content": "Start by understanding the structure of the input data. You have a list of products, each with an ID and a name. Focus on the 'name' field, as that's where you'll be searching for consecutive digits."
    },
    {
      "content": "Consider how to identify digits in a string. You can use functions or methods that check if a character is a digit. For example, in Python, you can use `char.isdigit()` to check each character."
    },
    {
      "content": "Think about how to iterate through each product's name. You'll need a loop that goes through each character in the name while keeping track of the last two digits you found."
    },
    {
      "content": "Remember that you are looking for three consecutive digits. As you iterate, check if the current character is a digit and if the previous two characters were also digits."
    },
    {
      "content": "Consider edge cases, such as product names that are too short to contain three consecutive digits. Make sure your code can handle names with fewer than three characters gracefully."
    },
    {
      "content": "When you find a product with three consecutive digits, think about how you will store or return that product. You might want to collect these products in a list."
    },
    {
      "content": "Make sure to handle products with no digits at all. Your solution should not return these products, so include a condition to skip them."
    },
    {
      "content": "Pay attention to the output format. You need to return a list of product IDs that meet the criteria, so ensure you are collecting the IDs correctly as you find qualifying products."
    },
    {
      "content": "Consider using a regular expression to simplify the detection of three consecutive digits. A regex like `\\d{3}` could help you find matches directly in the product names."
    },
    {
      "content": "Finally, implement your solution by combining the previous hints. Loop through each product, check for three consecutive digits, and collect the IDs of matching products. Remember to test your solution with various cases."
    }
  ],
  "questionNotes": [
    "Focus on the 'name' field of each product for searching.",
    "Ensure to handle edge cases, such as short names and names without digits.",
    "The output should be a list of product IDs that contain three consecutive digits."
  ]
}