{
  "hints": [
    {
      "content": "Start by understanding the properties of a triangle. Recall that the area of a triangle can be calculated using the formula: Area = 1/2 * base * height. For this problem, you need to ensure that at least one side of the triangle is parallel to either the x-axis or the y-axis."
    },
    {
      "content": "To satisfy the condition of having a side parallel to the x-axis or y-axis, consider how you can select points. Think about the implications of choosing points that share either the same x-coordinate or the same y-coordinate."
    },
    {
      "content": "Consider how you can group the points based on their x-coordinates and y-coordinates. This might help you identify potential bases and heights for the triangles you can form."
    },
    {
      "content": "When you have a group of points with the same x-coordinate, the height of the triangle can be determined by the difference in y-coordinates of the points you choose. Similarly, for points with the same y-coordinate, the base can be determined by the difference in x-coordinates."
    },
    {
      "content": "Make sure to check combinations of points carefully. For each pair of points that share an x-coordinate, you will need to find a third point that shares either the same x or y-coordinate to form a valid triangle."
    },
    {
      "content": "Remember to calculate the area for each valid triangle you can form. Keep track of the maximum area you find during your calculations. Don't forget to multiply the area by 2 as required by the problem statement."
    },
    {
      "content": "Consider edge cases where it might not be possible to form any triangles. For instance, if there are fewer than 3 points, or if all points are collinear without any valid triangle formation."
    },
    {
      "content": "Think about how to efficiently iterate through the points. You might want to use a nested loop or a more efficient data structure to store and retrieve points based on their coordinates."
    },
    {
      "content": "As you implement your solution, ensure that you handle the case where no valid triangles can be formed. In such cases, you should return -1 as specified in the problem statement."
    },
    {
      "content": "Finally, after implementing the logic to find the maximum area, remember to return the result in the correct format: 2 * A. Make sure to test your solution with various inputs to verify its correctness."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= n == coords.length <= 10^5",
    "1 <= coords[i][0], coords[i][1] <= 10^6",
    "All coords[i] are unique.",
    "Return -1 if no valid triangle can be formed.",
    "Ensure at least one side of the triangle is parallel to the x-axis or y-axis."
  ]
}