{
  "hints": [
    {
      "content": "Start by understanding the game mechanics. Alice and Bob take turns picking coins to reach a total value of 115. Think about how many combinations of coins can sum up to this value."
    },
    {
      "content": "Consider the types of coins available: 75-value coins and 10-value coins. How can you use these coins to reach exactly 115? Try to find different combinations."
    },
    {
      "content": "For a player to win, they must ensure that the other player cannot make a valid move on their turn. Think about what happens when one player takes certain coins. What options does that leave for the opponent?"
    },
    {
      "content": "Calculate how many 75-value coins and 10-value coins are needed to make 115. For example, if you take 1 coin of 75, how many 10-value coins do you need?"
    },
    {
      "content": "Explore the possible combinations of coins that can sum to 115. For instance, if Alice takes 1 coin of 75, she can take up to 4 coins of 10. What if she takes 2 coins of 75?"
    },
    {
      "content": "Think about the constraints: both x (75-value coins) and y (10-value coins) can range from 1 to 100. How does this affect the number of moves each player can make?"
    },
    {
      "content": "Consider edge cases where either player has very few coins. For example, if x = 1 and y = 1, can Alice still make a valid move? What happens if the available coins cannot sum to 115?"
    },
    {
      "content": "Simulate the game step-by-step. Start with Alice's turn and see how many valid moves she can make. Then, switch to Bob's turn. Keep track of the remaining coins after each turn."
    },
    {
      "content": "Think about how to determine the winner. If Alice cannot make a move on her turn, she loses. Conversely, if she can always make a move, how does that affect Bob's chances?"
    },
    {
      "content": "Finally, implement a function that checks the remaining coins after each player's turn. If one player cannot make a valid move, return the name of the winning player. Think about how to structure your conditions."
    }
  ],
  "questionNotes": [
    "Players must pick coins to reach exactly 115 in value.",
    "Alice starts first, followed by Bob.",
    "If a player cannot make a valid move, they lose.",
    "Constraints: 1 <= x, y <= 100."
  ]
}