{
  "hints": [
    {
      "content": "Start by understanding the structure of the input data. You have a list of tweets, each containing a tweet message with hashtags. Focus on how to extract hashtags from the tweet strings."
    },
    {
      "content": "Remember that hashtags start with the '#' symbol. You can use string manipulation methods to identify and extract these hashtags from each tweet."
    },
    {
      "content": "Consider using a regular expression to find all hashtags in a tweet. A simple regex pattern like `#\\w+` can help you match hashtags efficiently."
    },
    {
      "content": "Once you extract the hashtags, think about how to count their occurrences. A dictionary (or hash map) can be useful for this purpose, where the keys are hashtags and the values are their counts."
    },
    {
      "content": "As you count hashtags, pay attention to how you handle duplicates within the same tweet. Each hashtag should only be counted once per tweet."
    },
    {
      "content": "After counting the hashtags, you need to determine which ones are trending. Define what 'trending' means in this context – is it the most frequent hashtags or those used recently?"
    },
    {
      "content": "Consider sorting the hashtags by their counts. You might also want to sort them alphabetically in case of ties in counts to maintain a consistent order."
    },
    {
      "content": "Think about how many trending hashtags you want to return. The problem doesn't specify, so you may want to decide on a reasonable number, like the top 5 or top 10."
    },
    {
      "content": "When preparing your output, ensure it matches the expected format. You might want to return the hashtags in a list or a specific data structure as required."
    },
    {
      "content": "Finally, consider edge cases such as tweets with no hashtags or multiple hashtags in a single tweet. Make sure your solution handles these cases gracefully."
    }
  ],
  "questionNotes": [
    "Extract hashtags starting with '#' from each tweet.",
    "Count each hashtag only once per tweet.",
    "Define what 'trending' means (most frequent or recent).",
    "Sort hashtags by frequency and alphabetically in case of ties.",
    "Decide on the number of trending hashtags to return.",
    "Handle edge cases like tweets with no hashtags."
  ]
}