{
  "hints": [
    {
      "content": "Start by understanding what a K-even array is. A K-even array is defined as an array where the count of even numbers is exactly K. Make sure to clarify how you will determine if a number is even."
    },
    {
      "content": "Consider the input constraints. You will be given multiple test cases, and for each test case, you need to find the number of K-even arrays. Think about how you will handle each test case independently."
    },
    {
      "content": "Think about the properties of even and odd numbers. Remember that the sum of even numbers is even, and the sum of odd numbers is odd. This might help you in constructing arrays."
    },
    {
      "content": "You might want to explore how many even and odd numbers are possible within a given range. For example, if you are generating arrays of length N, how many even and odd integers can you use?"
    },
    {
      "content": "Consider using combinatorial mathematics to determine the number of ways to select K even numbers from a set. For example, if you have a total of E even numbers available, how would you choose K of them?"
    },
    {
      "content": "Think about the total number of elements in the array. If you are generating an array of size N, and you have chosen K even numbers, how many odd numbers will you need to fill the rest of the array?"
    },
    {
      "content": "You will need to account for the arrangement of the numbers in the array. Remember that the order of elements matters in an array. How will you calculate the arrangements of K even and (N-K) odd numbers?"
    },
    {
      "content": "Make sure to handle edge cases, such as when K is greater than N. In such cases, it is impossible to form a K-even array. What should your function return in these scenarios?"
    },
    {
      "content": "Consider the scenario where K is 0. How many arrays can you form that have no even numbers? This will help you understand the lower bounds of your solution."
    },
    {
      "content": "Finally, think about how you will implement your solution. What data structures will you use to keep track of the counts of even and odd numbers? How will you loop through the test cases and compute the results?"
    }
  ],
  "questionNotes": [
    "You will receive multiple test cases, so your solution must handle each case independently.",
    "K must be less than or equal to N, as you cannot have more even numbers than the total number of elements in the array.",
    "Remember that the order of numbers in the array matters, which means that different arrangements of the same numbers count as different arrays."
  ]
}