{
  "hints": [
    {
      "content": "Start by analyzing the product names in the provided data. Notice the variations in casing, such as uppercase and mixed case. Your goal is to standardize these names."
    },
    {
      "content": "Consider how you might convert each product name to a consistent format. A common approach is to convert all characters to lowercase or capitalize the first letter of each word."
    },
    {
      "content": "Think about how to iterate through the rows of data. You will need to access each product name in the list of sales. Make sure you understand how to access nested structures in the JSON."
    },
    {
      "content": "When modifying the product names, consider using string manipulation functions. For example, you might use methods like `lower()` or `title()` in Python to help with the formatting."
    },
    {
      "content": "Pay attention to edge cases, such as product names that are already in the desired format or contain special characters. Ensure your solution handles these cases gracefully."
    },
    {
      "content": "You might want to create a helper function to format the product names. This function can take a single product name as input and return the formatted version."
    },
    {
      "content": "After formatting the product names, make sure to update the original data structure. You will need to replace the old product names with the new formatted names in the rows."
    },
    {
      "content": "Consider how you will return or print the modified data. Ensure that the output maintains the same structure as the input, with updated product names."
    },
    {
      "content": "Before finalizing your solution, test it with various inputs, including edge cases. For example, check how it handles product names that are already correctly formatted."
    },
    {
      "content": "As a final step, ensure your function is efficient. If you have a large dataset, consider the time complexity of your approach and optimize if necessary."
    }
  ],
  "questionNotes": [
    "The input is structured as a JSON object with headers and rows.",
    "Ensure that the output format matches the input structure.",
    "Be mindful of casing variations in product names.",
    "Consider edge cases like already formatted names or special characters."
  ]
}