{
  "hints": [
    {
      "content": "Start by understanding how flood fill works. You need to change the color of the starting pixel and then recursively change the color of adjacent pixels that share the same original color."
    },
    {
      "content": "Consider the four possible directions you can move from a pixel: up, down, left, and right. You will need to check each of these directions to find adjacent pixels."
    },
    {
      "content": "Before changing the color of a pixel, ensure it is within the bounds of the image grid. This means checking that the row index and column index are valid."
    },
    {
      "content": "You should also check if the pixel's current color is the same as the original color of the starting pixel before modifying it. This prevents unnecessary changes."
    },
    {
      "content": "Think about how you will keep track of which pixels have already been changed. You might want to use a recursive function or an iterative approach with a stack or queue."
    },
    {
      "content": "When implementing the flood fill, consider using a depth-first search (DFS) or breadth-first search (BFS) approach. Both can effectively traverse the connected components of the same color."
    },
    {
      "content": "Remember to handle the case where the starting pixel's color is the same as the target color. In this case, no changes should be made to the image."
    },
    {
      "content": "Make sure to return the modified image after the flood fill operation is complete. The return format should match the input format, maintaining the 2D array structure."
    },
    {
      "content": "As an edge case, consider what happens when the image is only one pixel. Ensure your code handles this scenario properly without errors."
    },
    {
      "content": "You are almost there! To implement the flood fill, start with a function that takes the image, starting coordinates, and the new color as parameters. Begin by changing the color of the starting pixel and then recursively call your flood fill function on the adjacent pixels."
    }
  ],
  "questionNotes": [
    "The image is represented as an m x n grid of integers.",
    "The starting pixel is given by the coordinates (sr, sc).",
    "The new color must be different from the original color to see any changes.",
    "Ensure that the indices sr and sc are within the bounds of the image.",
    "The flood fill should only affect pixels that are connected horizontally or vertically."
  ]
}