{
  "hints": [
    {
      "content": "Start by understanding what it means for a number to have exactly four divisors. Recall that the divisors of a number are the integers that can divide it without leaving a remainder."
    },
    {
      "content": "Consider the possible forms of numbers that can have exactly four divisors. A number can have four divisors if it is either the product of two distinct prime numbers (e.g., p * q) or the cube of a prime number (e.g., p^3)."
    },
    {
      "content": "For the first case, if a number is of the form p * q, the divisors are {1, p, q, p*q}. For the second case, if a number is of the form p^3, the divisors are {1, p, p^2, p^3}."
    },
    {
      "content": "To solve the problem, iterate through the `nums` array. For each number, check if it has exactly four divisors by using the two forms discussed."
    },
    {
      "content": "You can create a helper function to count the divisors of a number. This function should return the total number of divisors, which you can then check against the value 4."
    },
    {
      "content": "Keep in mind the constraints: each number in `nums` can be as large as 100,000. Ensure your divisor counting method is efficient enough to handle the upper limits."
    },
    {
      "content": "As you iterate through the numbers, maintain a sum variable to accumulate the sum of the divisors of numbers that have exactly four divisors."
    },
    {
      "content": "Remember to handle edge cases, such as when the input array contains only one number or when all numbers do not have four divisors. Ensure your function returns 0 in these cases."
    },
    {
      "content": "When you find a number with exactly four divisors, you need to compute the sum of its divisors. You can use the previously mentioned forms to derive the sum efficiently."
    },
    {
      "content": "Finally, after processing all numbers in the array, return the accumulated sum. Make sure to test your solution with various cases, including edge cases like an empty array or all numbers being prime."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= nums.length <= 10^4",
    "Constraints: 1 <= nums[i] <= 10^5",
    "Return the sum of divisors for numbers with exactly four divisors.",
    "If no numbers have four divisors, return 0."
  ]
}