{
  "hints": [
    {
      "content": "Start by understanding the problem constraints. You have two baskets, and each can only hold one type of fruit. This means you can only pick fruits of two different types at any time."
    },
    {
      "content": "Consider using a sliding window approach. This technique allows you to expand and contract your range of picked fruits while maintaining the basket constraints."
    },
    {
      "content": "As you iterate through the array, keep track of the types of fruits you have in your current window. You can use a dictionary to count occurrences of each fruit type."
    },
    {
      "content": "When you encounter a third type of fruit, you'll need to adjust your window. Think about how you can shrink the window from the left until you are back to two types of fruits."
    },
    {
      "content": "Keep a variable to track the maximum number of fruits collected in any valid window. Update this variable whenever you successfully expand your window."
    },
    {
      "content": "Remember to handle edge cases, such as when the input array has only one type of fruit or when all fruits are the same. What should your output be in these cases?"
    },
    {
      "content": "Make sure to consider the performance of your solution. The constraints allow for up to 100,000 fruits, so aim for a solution that runs in linear time, O(n)."
    },
    {
      "content": "When you implement the sliding window, think about how you will manage the counts of the fruits in your baskets. You'll need to add and remove fruits as you move the window."
    },
    {
      "content": "You can use two pointers to represent the start and end of your current window. As you move the end pointer to the right, adjust the start pointer when you exceed two fruit types."
    },
    {
      "content": "Finally, ensure your solution returns the maximum count of fruits collected from valid windows. Consider edge cases where the array could be empty or contain only one element."
    }
  ],
  "questionNotes": [
    "You can only use two baskets, each for one type of fruit.",
    "The input array can have a length of up to 100,000.",
    "Each fruit type is represented by an integer.",
    "The output should be the maximum number of fruits collected.",
    "You must stop collecting when you encounter a fruit type not in your baskets."
  ]
}