{
  "hints": [
    {
      "content": "Start by splitting the input sentence into individual words. You can use the `split()` method in Python, which will help you handle the words easily. For example, `sentence.split()` will give you a list of words."
    },
    {
      "content": "Identify the vowels in the English alphabet: 'a', 'e', 'i', 'o', 'u' (both lowercase and uppercase). You can create a set for quick lookup to check if the first letter of a word is a vowel."
    },
    {
      "content": "For each word, check if it starts with a vowel or a consonant. Use an if-else statement to handle the two cases differently. This will be crucial for applying the correct transformation."
    },
    {
      "content": "If a word starts with a vowel, simply append 'ma' to the end of the word. For example, if the word is 'apple', it should become 'applema'."
    },
    {
      "content": "If a word starts with a consonant, you need to remove the first letter, append it to the end, and then add 'ma'. For instance, 'goat' should be transformed to 'oatgma'."
    },
    {
      "content": "Remember to add 'a's to the end of each transformed word based on its index. The first word gets 'a', the second gets 'aa', the third gets 'aaa', and so on. You can use the index of the loop to determine how many 'a's to append."
    },
    {
      "content": "Consider using a list to store the transformed words as you process each word. This way, you can join them back into a single string at the end using `join()`."
    },
    {
      "content": "Make sure to handle the case where the input sentence has only one word. Your logic should still apply correctly without any errors."
    },
    {
      "content": "Don't forget to preserve the original casing of the words. If a word starts with an uppercase letter, your transformation should maintain that capitalization in the final output."
    },
    {
      "content": "Finally, once you have processed all the words and added the appropriate 'a's, join the list of transformed words into a single string with spaces in between. This will give you the final Goat Latin sentence."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= sentence.length <= 150",
    "Sentence consists of English letters and spaces.",
    "No leading or trailing spaces in the sentence.",
    "All words are separated by a single space."
  ]
}