{
  "hints": [
    {
      "content": "Start by understanding the structure of the problem. You have a list of unique six-letter words and a secret word that is also one of those words."
    },
    {
      "content": "Remember that the function Master.guess(word) can only be called with words from the given list. If you try to guess a word not in the list, it will return -1."
    },
    {
      "content": "Each guess will return the number of exact matches, which means both the character and its position must match with the secret word."
    },
    {
      "content": "You need to ensure that your guesses do not exceed the allowedGuesses limit. Keep track of how many times you've called Master.guess."
    },
    {
      "content": "Consider how you can narrow down your guesses based on the feedback from Master.guess. After each guess, you can eliminate words that do not match the response."
    },
    {
      "content": "Think about the implications of the number of matches returned. For instance, if you guess 'abcdef' and get 3 matches, you know that 3 characters are correct and in the right position."
    },
    {
      "content": "You can use a filtering approach to reduce the list of possible candidates after each guess based on the number of matches returned."
    },
    {
      "content": "Consider edge cases, such as when the list of words is very small. How would your strategy change if there are only two words?"
    },
    {
      "content": "Use a systematic approach to guess words. Start with a word that has a mix of common letters to maximize the chance of getting some matches."
    },
    {
      "content": "After your first guess, analyze the results carefully. If you received a high number of matches, consider guessing words that are similar to the one you guessed."
    },
    {
      "content": "If you receive no matches from a guess, you can eliminate that word and any words that share characters in the same positions."
    },
    {
      "content": "Keep track of the words you have guessed and the results. This will help you avoid repeating guesses and refine your strategy."
    },
    {
      "content": "Think about how you can group words based on their letter composition. This can help in making educated guesses based on previous results."
    },
    {
      "content": "As you approach the end of your allowed guesses, make sure to prioritize words that have the highest probability of being the secret word based on previous feedback."
    },
    {
      "content": "Remember that you must call Master.guess with the secret word to win. Ensure that your final guess is one of the remaining candidates."
    }
  ],
  "questionNotes": [
    "Each word is exactly six letters long.",
    "All words in the list are unique.",
    "The secret word is guaranteed to be in the list.",
    "You cannot exceed the allowedGuesses limit.",
    "Return format must indicate if the secret word was guessed correctly or if the limit was exceeded."
  ]
}