{
  "hints": [
    {
      "content": "Start by understanding what a Harshad number is. An integer is a Harshad number if it is divisible by the sum of its digits. Think about how you can calculate the sum of the digits of a number."
    },
    {
      "content": "To find the sum of the digits of an integer, you can repeatedly extract the last digit using the modulus operator and then remove that digit using integer division. For example, for a number `x`, you can do: `digit = x % 10` and `x = x // 10`."
    },
    {
      "content": "Remember that you need to check if `x` is divisible by the sum of its digits. This can be done using the modulus operator again. If `x % sum_of_digits == 0`, then `x` is a Harshad number."
    },
    {
      "content": "Consider edge cases, such as the smallest possible value for `x`, which is 1. What is the sum of its digits? Is 1 divisible by that sum?"
    },
    {
      "content": "The constraints specify that `1 <= x <= 100`. This means you only need to handle positive integers up to 100. Think about how this might simplify your implementation."
    },
    {
      "content": "Make sure to handle the return values correctly. If `x` is a Harshad number, return the sum of its digits. If not, return -1. Pay attention to the format of your return value."
    },
    {
      "content": "When calculating the sum of digits, consider using a loop to iterate through each digit of `x`. You may want to initialize a variable to keep track of the sum before entering the loop."
    },
    {
      "content": "After calculating the sum of the digits, check the divisibility condition. If `x` is divisible by the sum, you should return the sum; otherwise, return -1."
    },
    {
      "content": "As a final check, ensure that your function handles all numbers within the given range correctly. Test your function with both Harshad and non-Harshad numbers to verify its accuracy."
    },
    {
      "content": "You are very close! Write out the complete logic of your function: calculate the sum of the digits, check the divisibility, and return the appropriate value based on the condition."
    }
  ],
  "questionNotes": [
    "An integer is a Harshad number if it is divisible by the sum of its digits.",
    "Constraints: 1 <= x <= 100.",
    "Return the sum of the digits if x is a Harshad number; otherwise, return -1."
  ]
}