{
  "hints": [
    {
      "content": "Start by understanding the input format. You are given a string and an array of words. Your task is to find the starting and ending indices of each word in the string."
    },
    {
      "content": "Consider how to iterate through the list of words. For each word, you will need to check if it exists in the given string. Think about how you can use string methods to achieve this."
    },
    {
      "content": "Remember that the indices should be zero-based. When you find a word in the string, the starting index is where the word begins, and the ending index is the starting index plus the length of the word minus one."
    },
    {
      "content": "You might want to use a loop to go through each word in the array and then use a method like `str.find()` or `str.index()` to locate the word in the string."
    },
    {
      "content": "Consider edge cases where a word might not be found in the string. How will you handle such cases? Make sure to only return indices for words that are found."
    },
    {
      "content": "Think about how to store the results. You can create a list to hold the pairs of indices. Each pair should be formatted as [start_index, end_index]."
    },
    {
      "content": "When you find a word, calculate the end index as `start_index + len(word) - 1`. This is crucial for returning the correct format of the indices."
    },
    {
      "content": "Make sure to check for multiple occurrences of the same word in the string. You should find all occurrences and return their indices."
    },
    {
      "content": "The final output should be a list of index pairs. Ensure that your output matches the expected format exactly, as this is often a point of failure."
    },
    {
      "content": "Before finalizing your solution, test it with various inputs, including edge cases like an empty string or an empty list of words. Ensure your code handles these gracefully."
    }
  ],
  "questionNotes": [
    "The indices in the output should be zero-based.",
    "Return only the indices of the words that are found in the string.",
    "Handle cases where words may appear multiple times in the string.",
    "The output format should be a list of lists, where each inner list contains the start and end indices."
  ]
}