{
  "hints": [
    {
      "content": "Start by understanding the structure of the input data. You have a JSON object with 'headers' and 'rows'. The 'rows' contain the actual tweet data, which is a list of lists. Each inner list represents a tweet with an ID and its content."
    },
    {
      "content": "Focus on how to extract the tweet content from the 'rows'. You will need to iterate through the 'rows' and access the content of each tweet. Think about how you can store these contents for further processing."
    },
    {
      "content": "Consider how to identify invalid tweets. An invalid tweet could be defined by certain criteria, such as excessive mentions or hashtags. Start by determining what conditions would make a tweet invalid."
    },
    {
      "content": "Think about the limits for mentions and hashtags. For example, if you decide that a tweet can only have a maximum of 3 mentions and 3 hashtags, you will need to count these in each tweet's content."
    },
    {
      "content": "When counting mentions and hashtags, remember to use string manipulation techniques. You can use regex or simple string methods to identify '@' for mentions and '#' for hashtags."
    },
    {
      "content": "As you iterate through each tweet, maintain counters for mentions and hashtags. If a tweet exceeds the defined limits, mark it as invalid. Consider how you will store the IDs of these invalid tweets."
    },
    {
      "content": "Once you have identified invalid tweets, think about how to return the results. You might want to return a list of tweet IDs that are invalid. Ensure you format this output correctly."
    },
    {
      "content": "Consider edge cases, such as tweets with no mentions or hashtags. Ensure your logic correctly identifies these as valid tweets. Also, think about tweets that exactly meet the limit criteria."
    },
    {
      "content": "Make sure to test your solution against the provided sample test case. Check if your logic correctly identifies the invalid tweets based on the criteria you've set."
    },
    {
      "content": "Finally, implement the logic to check for invalid tweets in a single function. This function should take the input data, process it, and return the list of invalid tweet IDs. Make sure to handle any potential errors or edge cases gracefully."
    }
  ],
  "questionNotes": [
    "Input is a JSON object with 'headers' and 'rows'.",
    "Each tweet is represented by a list containing an ID and content.",
    "Define criteria for what makes a tweet invalid (e.g., too many mentions or hashtags).",
    "Consider edge cases like tweets with no mentions or hashtags.",
    "Return format should be a list of invalid tweet IDs."
  ]
}