{
  "hints": [
    {
      "content": "Start by understanding the structure of the grid. Each cell can either be land (1) or water (0). Your goal is to calculate the perimeter of the land cells."
    },
    {
      "content": "Remember that the perimeter of a cell is affected by its neighboring cells. For each land cell, check its four possible neighbors (up, down, left, right)."
    },
    {
      "content": "For each land cell (1), if a neighboring cell is water (0) or out of bounds, it contributes to the perimeter. How many sides does each land cell contribute?"
    },
    {
      "content": "Consider edge cases where the land cell is at the edge of the grid. Cells on the boundary will have fewer neighbors, which affects the perimeter calculation."
    },
    {
      "content": "You can iterate through each cell in the grid using nested loops. For each land cell found, initialize a perimeter counter and add to it based on the neighboring cells."
    },
    {
      "content": "Think about how to handle the grid boundaries. If a neighbor is out of bounds, it should be treated as water, contributing to the perimeter."
    },
    {
      "content": "As you count the perimeter, make sure to reset your perimeter counter for each land cell you process. Keep a running total of the perimeter."
    },
    {
      "content": "Consider using a variable to keep track of the total perimeter as you iterate through the grid. This will help you accumulate the perimeter value efficiently."
    },
    {
      "content": "Make sure to account for all four directions when checking neighbors. You can use a list of direction vectors to simplify this process."
    },
    {
      "content": "Finally, after iterating through the entire grid, return the accumulated perimeter value. Ensure your function returns the correct type as specified in the problem."
    }
  ],
  "questionNotes": [
    "The grid is completely surrounded by water.",
    "There is exactly one island (one or more connected land cells).",
    "No lakes are present within the island.",
    "Each cell is a square with side length 1.",
    "The grid dimensions do not exceed 100 rows and columns."
  ]
}