{
  "hints": [
    {
      "content": "Start by understanding the layout of the American keyboard. The letters are divided into three rows: the first row has 'qwertyuiop', the second has 'asdfghjkl', and the third has 'zxcvbnm'."
    },
    {
      "content": "Remember that the problem is case-insensitive. This means you can convert all the letters in the words to either lower or upper case to simplify comparisons."
    },
    {
      "content": "Create a set for each row of the keyboard. This will allow you to quickly check if a letter belongs to a specific row. For example, you might have: `row1 = set('qwertyuiop')`."
    },
    {
      "content": "Iterate through each word in the input list. For each word, convert it to lower case to handle case insensitivity and check which row the first letter belongs to."
    },
    {
      "content": "Keep track of the row that the first letter of each word belongs to, and then check if all subsequent letters in that word belong to the same row."
    },
    {
      "content": "Use a loop to check each character in the word after identifying the row from the first character. If any character does not belong to the identified row, you can skip that word."
    },
    {
      "content": "Consider edge cases where words might contain letters from multiple rows. Ensure your logic correctly identifies and handles these scenarios."
    },
    {
      "content": "You might want to collect valid words in a list. Initialize an empty list at the start, and append words that meet the criteria as you iterate through the input."
    },
    {
      "content": "After processing all words, return the list of valid words that can be typed using letters from only one row of the keyboard."
    },
    {
      "content": "Make sure to test your solution with various cases, including single-letter words and words that contain only characters from one row. For example, 'A' and 'z' should be valid outputs."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= words.length <= 20, 1 <= words[i].length <= 100.",
    "Words consist of English letters (both lowercase and uppercase).",
    "The output should be a list of words that can be typed using letters from only one row."
  ]
}