{
  "hints": [
    {
      "content": "Start by understanding how to calculate the area of a triangle given its vertices. The formula for the area of a triangle formed by points (x1, y1), (x2, y2), and (x3, y3) is: \n\n```\nArea = 0.5 * | x1(y2 - y3) + x2(y3 - y1) + x3(y1 - y2) | \n```"
    },
    {
      "content": "Remember that you need to consider all combinations of three points from the given list. Think about how you can use nested loops or combinations to iterate through the points."
    },
    {
      "content": "Since the number of points is limited (up to 50), you can afford to check all combinations of three points. Consider using a triple nested loop to generate these combinations."
    },
    {
      "content": "When calculating the area for each combination of points, keep track of the maximum area found so far. You can initialize a variable to store the maximum area and update it whenever you find a larger area."
    },
    {
      "content": "Make sure to handle the precision of your output correctly. The problem states that answers within 10^-5 of the actual answer will be accepted, so consider formatting your output appropriately."
    },
    {
      "content": "Consider edge cases where points may be collinear. In such cases, the area will be zero. However, since you are looking for the largest area, this will not affect your maximum calculation."
    },
    {
      "content": "To improve your solution, you might want to think about how to avoid redundant calculations. For instance, if you already calculated the area for a particular set of points, you don’t need to recalculate it."
    },
    {
      "content": "As you implement the area calculation, remember to use the absolute value function to ensure the area is non-negative, as the points might be arranged in different orders."
    },
    {
      "content": "Once you have the areas calculated for all combinations, return the maximum area found. Remember to return it in the specified format, ensuring it has the correct precision."
    },
    {
      "content": "Now, put together your logic: iterate through all combinations of three points, calculate the area for each, and keep track of the maximum area. Make sure to test your solution with the provided examples."
    }
  ],
  "questionNotes": [
    "Constraints: 3 <= points.length <= 50",
    "Points are unique and within the range of -50 to 50 for both x and y coordinates.",
    "Return the area with a precision of 10^-5."
  ]
}