{
  "hints": [
    {
      "content": "Start by understanding what a palindrome is. A palindromic number reads the same forwards and backwards, like 121 or 9009."
    },
    {
      "content": "Consider how to generate n-digit integers. The smallest n-digit integer is 10^(n-1) and the largest is 10^n - 1."
    },
    {
      "content": "To find the largest palindrome product, you need to consider the products of two n-digit numbers. Think about how to iterate through these numbers efficiently."
    },
    {
      "content": "Remember that the product of two n-digit numbers can be quite large. Consider how to handle this in your calculations, especially since the result needs to be modulo 1337."
    },
    {
      "content": "When searching for the largest palindrome, you might want to check products in a descending order. This way, you can find the largest palindrome more quickly."
    },
    {
      "content": "You can create a helper function to check if a number is a palindrome. This will be useful when you find a product and need to verify its palindromic nature."
    },
    {
      "content": "To optimize your search, consider breaking early if you find a palindrome. If you find a large palindrome, smaller products will not yield larger palindromes."
    },
    {
      "content": "Think about edge cases. For example, when n = 1, the largest palindrome is simply the largest single-digit number, which is 9."
    },
    {
      "content": "When implementing your search, ensure you are not repeating calculations. You can store previously calculated products or palindromes."
    },
    {
      "content": "Consider using nested loops to iterate through all pairs of n-digit numbers. Make sure to start from the largest numbers to maximize your chances of finding the largest palindrome early."
    },
    {
      "content": "If you're checking products in a nested loop, remember to avoid duplicate calculations. For example, if you calculate the product of (a, b), you don't need to calculate (b, a) again."
    },
    {
      "content": "Once you find a palindrome, keep track of the largest one found so far. This will help you return the correct answer at the end."
    },
    {
      "content": "Don't forget to apply the modulo operation to your final result before returning it. This is crucial since the answer can be very large."
    },
    {
      "content": "As you implement your solution, test it with various values of n, especially edge cases like n = 1 and n = 8 to ensure robustness."
    },
    {
      "content": "Finally, consider how you will return the result. The problem specifies to return it modulo 1337, so ensure your final answer reflects this."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= n <= 8",
    "Return the result modulo 1337.",
    "Consider edge cases, especially for n = 1.",
    "Ensure to check for palindromic nature efficiently.",
    "Avoid duplicate calculations in nested loops."
  ]
}