{
  "hints": [
    {
      "content": "Start by understanding what a magic square is. A k x k magic square has the property that the sums of all rows, columns, and both diagonals are equal. Make sure you can identify these sums in a small example."
    },
    {
      "content": "Consider how you might check if a given k x k sub-grid is a magic square. You will need to calculate the sums of its rows, columns, and diagonals and compare them to see if they are all equal."
    },
    {
      "content": "Think about how you can iterate through the main grid to extract all possible k x k sub-grids. Remember that the size of the sub-grid should not exceed the dimensions of the main grid."
    },
    {
      "content": "To optimize your solution, you might want to calculate the sums of rows and columns incrementally rather than recalculating them from scratch for each sub-grid. This can save time, especially for larger grids."
    },
    {
      "content": "Keep in mind the constraints of the problem. The grid can be as small as 1x1 and as large as 50x50. Ensure your solution can handle edge cases, such as grids with only one row or one column."
    },
    {
      "content": "When checking for magic squares, pay attention to the diagonal sums. Make sure you have a clear method to calculate both the main diagonal and the anti-diagonal for each k x k sub-grid."
    },
    {
      "content": "Consider using a nested loop to check all possible sizes of magic squares, starting from the largest possible size down to 1. This way, you can return the first valid magic square size you find."
    },
    {
      "content": "Remember that if you find a magic square of size k, you can skip checking smaller sizes that are less than k, as you are interested in the largest one."
    },
    {
      "content": "As you implement your solution, think about how to handle cases where multiple magic squares of the same size exist. Your goal is to return the size of the largest one, not the square itself."
    },
    {
      "content": "Finally, ensure your function returns the size of the largest magic square found. If no magic square is found, consider what value you should return (0 is a common choice)."
    }
  ],
  "questionNotes": [
    "A k x k magic square has equal sums for all rows, columns, and both diagonals.",
    "The integers in the magic square do not need to be distinct.",
    "The input grid can be up to 50 x 50 in size.",
    "Return the size of the largest magic square found.",
    "If no magic square exists, return 0."
  ]
}