{
  "hints": [
    {
      "content": "Start by understanding the concept of parity. Digits can be classified as either even (0, 2, 4, 6, 8) or odd (1, 3, 5, 7, 9). You can only swap digits of the same parity."
    },
    {
      "content": "Extract the digits from the number. You can convert the number to a string or use modulo operations to get each digit. This will help you manipulate the digits easily."
    },
    {
      "content": "Once you have the digits, separate them into two lists: one for even digits and another for odd digits. This will make it easier to sort and swap them later."
    },
    {
      "content": "After separating the digits, sort both lists in descending order. This is because to form the largest number, you want the largest digits in the highest place values."
    },
    {
      "content": "Now, reconstruct the number by iterating through the original digits. Replace each digit with the largest available digit from its respective sorted list (even or odd)."
    },
    {
      "content": "Keep track of which digits you have used from the sorted lists. You can use an index or a pointer for each list to ensure you are using the largest available digit."
    },
    {
      "content": "Consider edge cases, such as when the number has all even or all odd digits. In these cases, the number will already be the largest possible number."
    },
    {
      "content": "Think about how to handle digits that are the same. If you have multiple instances of the same digit, ensure that your logic can handle this without skipping any digits."
    },
    {
      "content": "When reconstructing the number, ensure that you are placing the digits back in the original order of their appearance, but with the largest available digits from your sorted lists."
    },
    {
      "content": "Finally, once you have reconstructed the number, convert it back to an integer (if needed) and return it. Remember to check if your final number is indeed larger than the original."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= num <= 10^9",
    "You can only swap digits of the same parity (even with even, odd with odd).",
    "The output should be the largest possible integer formed after swaps."
  ]
}