{
  "hints": [
    {
      "content": "Start by understanding the properties of numbers that are multiples of three. A number is a multiple of three if the sum of its digits is a multiple of three."
    },
    {
      "content": "Consider how you can manipulate the digits in the array to form the largest number. Sorting the digits in descending order is a good first step."
    },
    {
      "content": "After sorting the digits, think about how to check if the sum of the digits is a multiple of three. You can calculate the sum and use the modulo operator."
    },
    {
      "content": "If the sum of the digits is already a multiple of three, you can concatenate the sorted digits directly to form your answer."
    },
    {
      "content": "What if the sum of the digits is not a multiple of three? Identify the remainder when the sum is divided by three. This will guide how you adjust your digits."
    },
    {
      "content": "If the sum has a remainder of 1 when divided by three, you may need to remove one digit that also has a remainder of 1, or two digits that have a remainder of 2."
    },
    {
      "content": "Conversely, if the sum has a remainder of 2, you should consider removing one digit with a remainder of 2, or two digits with a remainder of 1."
    },
    {
      "content": "Be careful with the cases where you might need to remove digits. Ensure that you check if the digits you want to remove actually exist in the array."
    },
    {
      "content": "After potentially removing digits, remember to sort the remaining digits again to ensure they form the largest number when concatenated."
    },
    {
      "content": "When concatenating the digits, be cautious about leading zeros. If the largest number starts with a zero, the result should be '0'."
    },
    {
      "content": "Consider edge cases such as when the input array contains only zeros or when it’s impossible to form a valid number."
    },
    {
      "content": "Make sure to handle cases where the resulting string might be empty. This could happen if all digits were removed or if the input was not suitable."
    },
    {
      "content": "Once you have your final string, ensure that it is formatted correctly. It should not have unnecessary leading zeros unless it is just '0'."
    },
    {
      "content": "Before finalizing your answer, double-check that you have considered all possible digit combinations and removals to maximize the number."
    },
    {
      "content": "Finally, test your solution with various inputs to ensure it handles all edge cases and returns the expected results."
    }
  ],
  "questionNotes": [
    "1 <= digits.length <= 10^4",
    "0 <= digits[i] <= 9",
    "Return format must be a string.",
    "No leading zeros unless the result is '0'.",
    "If no valid number can be formed, return an empty string."
  ]
}