{
  "hints": [
    {
      "content": "Start by understanding the structure of the input table. Each person has a unique `person_id`, a `person_name`, a `weight`, and a `turn` that determines the order they will board the bus."
    },
    {
      "content": "Remember that the bus has a weight limit of 1000 kilograms. Your goal is to find the last person who can board the bus without exceeding this limit."
    },
    {
      "content": "Consider how you will process the people in the order of their `turn`. You might want to sort the data based on the `turn` column to ensure you are checking the boarding order correctly."
    },
    {
      "content": "As you iterate through the people, keep track of the total weight of those who have boarded the bus so far. You can use a variable to accumulate this weight."
    },
    {
      "content": "When adding a person's weight to the total, check if it exceeds the limit of 1000 kg. If it does, that person cannot board the bus."
    },
    {
      "content": "Make sure to store the name of the last person who successfully boarded the bus. This will be your eventual output."
    },
    {
      "content": "Pay attention to the scenario where the total weight exactly equals 1000 kg. This means that the last person who boarded is still valid."
    },
    {
      "content": "Consider edge cases, such as when the weights of all people are very high or when only one person is in the queue. How does your logic hold up in these cases?"
    },
    {
      "content": "Your final output should only include the `person_name` of the last person who boarded. Make sure your result format matches the expected output structure."
    },
    {
      "content": "As a final step, ensure you have a plan to handle the SQL query that retrieves the necessary data. You might want to use a `SELECT` statement with appropriate `ORDER BY` and a loop to sum the weights."
    }
  ],
  "questionNotes": [
    "The `person_id` and `turn` columns are unique and contain all numbers from 1 to n.",
    "The `weight` of each person is in kilograms, and the bus has a strict weight limit of 1000 kg.",
    "The output should only contain the `person_name` of the last person who can board the bus."
  ]
}