{
  "hints": [
    {
      "content": "Start by understanding the concept of parity. Digits are even (0, 2, 4, 6, 8) or odd (1, 3, 5, 7, 9). You can only swap adjacent digits that share the same parity."
    },
    {
      "content": "Identify the positions of even and odd digits in the string. This will help you determine which digits can be swapped. For example, in '45320', the even digits are at indices 0 and 4, and odd digits are at indices 1 and 2."
    },
    {
      "content": "Consider how to perform a swap. You can only swap adjacent digits, so think about iterating through the string and checking pairs of adjacent digits for parity."
    },
    {
      "content": "When you find two adjacent digits with the same parity, think about the result of swapping them. How does it affect the overall lexicographical order of the string?"
    },
    {
      "content": "Remember that you can only perform one swap. After identifying potential swaps, consider which swap would yield the smallest result. You may need to compare multiple pairs."
    },
    {
      "content": "Consider edge cases where the string is already in the smallest lexicographical order. For example, '001' does not require any swaps."
    },
    {
      "content": "When implementing the solution, you might want to create a copy of the string to keep track of the smallest result after trying different swaps."
    },
    {
      "content": "As you iterate through the string, keep track of the smallest string formed after each valid swap. You can store the smallest result in a variable and update it whenever you find a better option."
    },
    {
      "content": "Make sure to handle the case where no swaps are needed. If the original string is already the smallest, you should return it as is."
    },
    {
      "content": "Finally, think about how to implement the logic for swapping and comparing strings. You can use a simple loop to check adjacent pairs and a conditional to swap them if they are the same parity."
    }
  ],
  "questionNotes": [
    "Constraints: 2 <= s.length <= 100",
    "The string consists only of digits (0-9).",
    "You can swap only adjacent digits with the same parity (both even or both odd).",
    "You can perform at most one swap.",
    "Return the lexicographically smallest string possible after the swap."
  ]
}