{
  "hints": [
    {
      "content": "Start by understanding the grid structure. Each cell can either be 'W' (white) or 'B' (black). Your goal is to identify 'B' cells that are unique in their respective rows and columns."
    },
    {
      "content": "Consider how to iterate through the grid. You will need to check each 'B' cell to see if it is the only 'B' in both its row and its column. Think about how you can count the occurrences of 'B' in rows and columns."
    },
    {
      "content": "You can create two arrays (or lists) to keep track of the count of 'B's in each row and each column. As you traverse the grid, update these counts accordingly."
    },
    {
      "content": "When you find a 'B' cell, check the counts from your two arrays. If both counts are equal to 1, then this 'B' is a lonely pixel."
    },
    {
      "content": "Make sure to account for edge cases. What happens if the grid is empty or if there are no 'B' cells at all? How will your function handle these situations?"
    },
    {
      "content": "Remember to return the total count of lonely pixels. This means you should maintain a counter that increments each time you find a lonely pixel."
    },
    {
      "content": "Consider the performance of your solution. If your grid is very large, ensure that your approach is efficient. What is the time complexity of your current method?"
    },
    {
      "content": "Think about how you can optimize your solution. Instead of checking each 'B' cell individually after counting, can you combine these steps in a single pass?"
    },
    {
      "content": "Before finalizing your solution, test it with various edge cases, such as grids with only one row or one column, and grids where all cells are 'W'."
    },
    {
      "content": "Finally, ensure your function returns the correct format. You need to return an integer representing the count of lonely pixels. Make sure to handle any potential off-by-one errors in your counting logic."
    }
  ],
  "questionNotes": [
    "The grid can contain only 'W' and 'B' characters.",
    "You need to count the 'B's that are the only ones in their row and column.",
    "Return the count as an integer.",
    "Consider edge cases like empty grids or grids with no 'B's."
  ]
}