{
  "hints": [
    {
      "content": "Start by understanding the definition of a beautiful substring. It must contain all five vowels ('a', 'e', 'i', 'o', 'u') at least once and in that specific order. Consider what it means for the letters to be sorted."
    },
    {
      "content": "Think about how you can traverse the string. You might want to use a sliding window approach to capture potential substrings. This way, you can expand and contract your window while checking for the conditions."
    },
    {
      "content": "As you slide your window, keep track of the count of each vowel within the current substring. You can use a dictionary or an array to maintain these counts."
    },
    {
      "content": "Make sure to check if your current substring contains all five vowels. You can do this by checking if the counts of 'a', 'e', 'i', 'o', and 'u' are all greater than zero."
    },
    {
      "content": "Remember that the vowels must appear in the correct order. As you expand your window, ensure that you are not adding a vowel that would disrupt this order. For example, if you have 'i', you shouldn't add 'a' or 'e' after it."
    },
    {
      "content": "When you find a valid beautiful substring, calculate its length. Keep track of the maximum length found so far. This will help you determine the final answer."
    },
    {
      "content": "Consider edge cases, such as very short strings or strings that do not contain all vowels. For example, if the string is 'a', you should immediately return 0."
    },
    {
      "content": "Be mindful of the constraints. The length of the string can be quite large (up to 500,000), so your solution should be efficient, ideally O(n) time complexity."
    },
    {
      "content": "As you implement your solution, think about how to handle multiple occurrences of vowels. You might need to reset your counts or adjust your window when you encounter a vowel that breaks the order."
    },
    {
      "content": "Finally, ensure that your function returns 0 if no beautiful substring is found. This is a crucial part of the problem requirements."
    }
  ],
  "questionNotes": [
    "Each of the 5 vowels ('a', 'e', 'i', 'o', 'u') must appear at least once.",
    "Vowels must be in alphabetical order.",
    "Return the length of the longest beautiful substring, or 0 if none exists.",
    "1 <= word.length <= 500,000.",
    "The string consists only of characters 'a', 'e', 'i', 'o', and 'u'."
  ]
}