{
  "hints": [
    {
      "content": "Start by understanding what a harmonious subsequence is. A harmonious array has a maximum and minimum value that differ by exactly 1. For example, in the array [1, 2, 2, 3], the subsequence [2, 2, 3] is harmonious."
    },
    {
      "content": "Consider how you can identify pairs of numbers that differ by 1. You might want to create a frequency map (or dictionary) to count occurrences of each number in the array."
    },
    {
      "content": "Once you have the frequency map, think about how you can iterate through the keys. For each key, check if the key + 1 exists in the map. This will help you find potential harmonious pairs."
    },
    {
      "content": "For each harmonious pair (key, key + 1), calculate the length of the subsequence by adding the counts from the frequency map for both keys. Keep track of the maximum length found."
    },
    {
      "content": "Don't forget to handle edge cases. For example, if the input array contains only one unique number, the result should be 0 since there can be no harmonious subsequence."
    },
    {
      "content": "Make sure to consider the constraints given in the problem. The length of the array can go up to 20,000, so your solution should be efficient, ideally O(n) or O(n log n)."
    },
    {
      "content": "As you implement your solution, remember to verify that you're correctly identifying and counting the occurrences of each number. A simple mistake in counting can lead to incorrect results."
    },
    {
      "content": "If you're stuck, try writing out some test cases by hand. For example, with the input [1, 3, 2, 2, 5, 2, 3, 7], manually find the harmonious subsequences to see how the counts work."
    },
    {
      "content": "As you finalize your approach, think about edge cases such as negative numbers or very large values in the array. Ensure your solution can handle the full range of inputs specified."
    },
    {
      "content": "Finally, implement the logic to return the maximum length of the harmonious subsequence found. Remember, if no harmonious pairs are found, the output should be 0."
    }
  ],
  "questionNotes": [
    "A harmonious array has a max and min difference of exactly 1.",
    "Return the length of the longest harmonious subsequence.",
    "Input constraints: 1 <= nums.length <= 20,000; -10^9 <= nums[i] <= 10^9.",
    "If no harmonious subsequence exists, return 0."
  ]
}