{
  "hints": [
    {
      "content": "Start by understanding the structure of the matrix. Each element can either be a 0 or a 1. Your goal is to find the longest line of consecutive 1s in any direction: horizontal, vertical, or diagonal."
    },
    {
      "content": "Consider how you might traverse the matrix. A nested loop is a common approach where the outer loop iterates through rows and the inner loop iterates through columns."
    },
    {
      "content": "As you traverse, keep track of the current count of consecutive 1s. You can reset this count to zero whenever you encounter a 0."
    },
    {
      "content": "Think about the different directions you need to check for consecutive 1s. You will need to handle horizontal and vertical lines first, then consider the two diagonal directions."
    },
    {
      "content": "For horizontal lines, you can simply iterate through each row and count consecutive 1s. For vertical lines, you will need to iterate through each column."
    },
    {
      "content": "When counting diagonal lines, remember that there are two types: from top-left to bottom-right and from bottom-left to top-right. You will need to implement separate logic for these."
    },
    {
      "content": "Make sure to keep track of the maximum length of consecutive 1s you find as you iterate through the matrix. You can use a variable to store this maximum value."
    },
    {
      "content": "Consider edge cases, such as matrices that are empty or contain only 0s. What should your function return in these cases?"
    },
    {
      "content": "Think about how you will return the result. The problem asks for the length of the longest line of consecutive 1s, so ensure your final output reflects that."
    },
    {
      "content": "You are almost there! As you implement the logic, ensure that you check all four directions (horizontal, vertical, and both diagonals) and update your maximum length accordingly."
    }
  ],
  "questionNotes": [
    "The matrix can be of any size, including empty.",
    "The output should be a single integer representing the length of the longest line of consecutive 1s.",
    "Consider all four directions: horizontal, vertical, and both diagonals.",
    "Handle edge cases where the matrix may contain all zeros or be empty."
  ]
}