{
  "hints": [
    {
      "content": "Start by understanding the definition of a lucky number. A lucky number is defined as the minimum in its row and the maximum in its column. Make sure you clearly identify these two conditions."
    },
    {
      "content": "To find the minimum in a row, you can iterate through each row and keep track of the smallest element. Consider how you will store the index of this minimum element for later checks."
    },
    {
      "content": "Once you identify the minimum element in a row, you need to check if it is the maximum in its corresponding column. Think about how you can access the elements in that column using the stored index."
    },
    {
      "content": "Remember that the matrix contains distinct numbers. This simplifies your checks since you won't have to deal with ties when determining the minimum or maximum."
    },
    {
      "content": "Consider edge cases, such as the smallest possible matrix size (1x1). In this case, the single element is trivially both the minimum and maximum."
    },
    {
      "content": "You can create a list to collect all lucky numbers as you find them. Ensure you check every row in the matrix to find all potential lucky numbers."
    },
    {
      "content": "When iterating through the matrix, you may want to use nested loops: the outer loop for rows and the inner loop for columns. This will help you systematically check each element."
    },
    {
      "content": "After identifying a candidate lucky number, validate it by checking all elements in its column to confirm it is indeed the maximum. This may involve another loop."
    },
    {
      "content": "Think about the time complexity of your approach. Since you are checking each element and potentially each column for each row, consider how this scales with larger matrices."
    },
    {
      "content": "Finally, ensure that your function returns the list of lucky numbers in the specified format (as an array). You might want to test your function with the provided examples to verify correctness."
    }
  ],
  "questionNotes": [
    "A lucky number is defined as the minimum in its row and maximum in its column.",
    "The matrix contains distinct numbers, which means no duplicates.",
    "Matrix dimensions: 1 <= n, m <= 50.",
    "Element values range: 1 <= matrix[i][j] <= 10^5.",
    "Return format: an array of lucky numbers in any order."
  ]
}