{
  "hints": [
    {
      "content": "Start by understanding how to identify the largest digit in a number. You can convert the number to a string or repeatedly divide by 10 to find the maximum digit."
    },
    {
      "content": "Consider how you will store the numbers based on their largest digit. A dictionary or a list of lists could be useful to group numbers by their largest digit."
    },
    {
      "content": "As you iterate through the numbers, remember to extract the largest digit for each number. You can use a helper function to keep your code organized."
    },
    {
      "content": "Think about how to handle cases where multiple numbers share the same largest digit. You will need to keep track of the two largest numbers for each digit."
    },
    {
      "content": "Make sure to check if there are at least two numbers with the same largest digit before calculating their sum. If not, you should return -1."
    },
    {
      "content": "When calculating the maximum sum, consider using a simple comparison to find the two largest numbers for each digit group."
    },
    {
      "content": "Don't forget to initialize your storage for the largest numbers for each digit to handle cases where no numbers are found for a digit."
    },
    {
      "content": "Think about edge cases, such as when all numbers have unique largest digits or when there are multiple pairs with the same sum."
    },
    {
      "content": "As you finalize your logic, ensure that you iterate through your storage of largest numbers to find the maximum sum across all digit groups."
    },
    {
      "content": "Your final step will involve returning the maximum sum found or -1 if no valid pairs exist. Make sure your return statement reflects this logic."
    }
  ],
  "questionNotes": [
    "Constraints: 2 <= nums.length <= 100",
    "Each number is between 1 and 10^4.",
    "Return -1 if no valid pairs exist.",
    "Consider the uniqueness of largest digits when grouping numbers."
  ]
}