{
  "hints": [
    {
      "content": "Start by understanding the problem statement clearly. You need to find the maximal range for each element in the array where that element is the maximum. Consider what 'maximal range' means in this context."
    },
    {
      "content": "Think about how you can determine the left and right boundaries for each element in the array. A good approach is to use a stack to keep track of the indices of elements as you traverse the array."
    },
    {
      "content": "As you iterate through the array, for each element, check how far you can go to the left until you encounter an element that is greater than the current element. This will help you define the left boundary."
    },
    {
      "content": "Similarly, once you establish the left boundary, you can find the right boundary by checking how far you can go to the right until you hit a larger element. This gives you the full range for that element."
    },
    {
      "content": "Consider edge cases, such as when the array has only one element or when all elements are the same. How would your approach handle these scenarios?"
    },
    {
      "content": "Make sure to handle the case where an element is at the start or end of the array. You might need to set boundaries accordingly to avoid going out of bounds."
    },
    {
      "content": "You can store the results in an array where each index corresponds to the original index of the element, and the value at that index represents the length of the maximal range."
    },
    {
      "content": "Think about the time complexity of your approach. Using a stack can help you achieve a linear time complexity, which is efficient for this problem."
    },
    {
      "content": "When you have your left and right boundaries, the maximal range for each element can be calculated as the difference between these boundaries plus one (to include both ends)."
    },
    {
      "content": "Finally, ensure that your solution correctly returns the maximal ranges in the expected format, which is typically an array of integers corresponding to the ranges for each element."
    }
  ],
  "questionNotes": [
    "You need to find the maximal range for each element in the array where that element is the maximum.",
    "Consider both left and right boundaries for each element.",
    "Handle edge cases like single-element arrays and arrays with duplicate values.",
    "The expected output is an array of integers representing the range lengths for each element."
  ]
}