{
  "hints": [
    {
      "content": "Start by understanding the problem clearly. You need to find a substring where each character appears at most twice. What does a substring mean in this context?"
    },
    {
      "content": "Consider using a sliding window approach. This involves maintaining a window of characters and adjusting its size based on the conditions of the problem."
    },
    {
      "content": "Think about how you can keep track of the counts of each character within your current window. A dictionary or an array can be useful for this purpose."
    },
    {
      "content": "As you expand your window to the right, check if adding a new character violates the condition of having at most two occurrences. If it does, you'll need to shrink the window from the left."
    },
    {
      "content": "When shrinking the window, make sure to update your character counts accordingly. This is crucial to maintain the correct state of your window."
    },
    {
      "content": "Consider edge cases, such as when the string consists of the same character repeated multiple times. How does your approach handle such cases?"
    },
    {
      "content": "Think about how to keep track of the maximum length of valid substrings you encounter as you iterate through the string."
    },
    {
      "content": "Remember that the constraints specify a minimum length of 2 for the string. This means you won't have to handle empty strings or single-character strings."
    },
    {
      "content": "Make sure to return the length of the longest valid substring, not the substring itself. This is an important distinction."
    },
    {
      "content": "As a final step, ensure your solution runs efficiently within the provided constraints. Aim for a linear time complexity if possible."
    }
  ],
  "questionNotes": [
    "Constraints: 2 <= s.length <= 100",
    "s consists only of lowercase English letters.",
    "Return the length of the longest valid substring, not the substring itself.",
    "Each character in the substring can appear at most two times."
  ]
}