{
  "hints": [
    {
      "content": "Start by understanding the game mechanics. You can only score points by taking stones from two different piles at each turn. Think about how many turns you can take based on the sizes of the piles."
    },
    {
      "content": "Consider the scenario where one pile is significantly larger than the others. How does that affect your ability to make moves? You might want to focus on balancing the piles to maximize your score."
    },
    {
      "content": "A key observation is that you can only continue playing as long as there are at least two non-empty piles. What happens when one pile runs out of stones? How does that impact your scoring?"
    },
    {
      "content": "Think about the total number of stones across all piles. If you have a total of `a + b + c` stones, how does that relate to the maximum score you can achieve? Consider if you can always use all stones."
    },
    {
      "content": "Try to derive a formula for the maximum score based on the sizes of the piles. For example, if you have two piles of equal size and one pile is larger, how many moves can you make before one pile runs out?"
    },
    {
      "content": "Consider the situation where one pile is empty. If you have two piles left, how do you calculate the maximum score you can achieve? This will help you understand edge cases."
    },
    {
      "content": "When calculating the maximum score, think about the relationship between the largest pile and the sum of the other two. If the largest pile is more than the sum of the other two, how does that affect your score?"
    },
    {
      "content": "You can use a greedy approach: always try to take stones from the two largest piles. This strategy helps ensure you maximize the number of moves you can make."
    },
    {
      "content": "Consider sorting the piles to easily identify the two largest piles at any moment. After each move, you can re-evaluate the sizes of the piles to continue making optimal choices."
    },
    {
      "content": "Finally, to implement the solution, you might want to keep track of the piles in a sorted manner. Calculate the maximum score using the formula: `min((a + b + c) / 2, a + b)` where `a`, `b`, and `c` are the sizes of the piles."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= a, b, c <= 10^5",
    "You can only take stones from two different non-empty piles at each turn.",
    "The game ends when fewer than two non-empty piles remain."
  ]
}