{
  "hints": [
    {
      "content": "Start by understanding the requirements for forming groups. Each group must have a strictly greater sum of grades than the previous group, and the number of students in each group must also be strictly increasing."
    },
    {
      "content": "Consider how you can divide the grades into groups. You might want to sort the grades first to facilitate easier grouping based on the sum and count conditions."
    },
    {
      "content": "Think about the smallest possible group. The first group can only have one student. What would the sum of grades be for that group? How does that affect the next group?"
    },
    {
      "content": "As you form groups, keep track of the total number of students in each group. Remember that the next group must have more students than the previous one."
    },
    {
      "content": "You may want to implement a loop that tries to form groups incrementally. For example, start with one student in the first group, then two in the second, and so on."
    },
    {
      "content": "When forming groups, if you find that you can't satisfy the conditions for a new group, you should stop and return the number of groups formed so far."
    },
    {
      "content": "Consider edge cases such as when all grades are the same or when there are very few students. How would these cases affect the number of groups you can form?"
    },
    {
      "content": "Keep in mind that the sum of grades in each group must be strictly increasing. You might need to calculate the sum of grades for each group as you form them."
    },
    {
      "content": "Try to implement a greedy approach where you always attempt to form the next valid group with the smallest possible sum and student count that meets the conditions."
    },
    {
      "content": "Finally, once you have a working approach, consider how you can optimize it. Are there any unnecessary calculations you can avoid to improve performance?"
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= grades.length <= 10^5",
    "Grades are positive integers: 1 <= grades[i] <= 10^5",
    "Groups must be non-empty and ordered.",
    "The sum of grades and the number of students in each group must be strictly increasing."
  ]
}