{
  "hints": [
    {
      "content": "Start by understanding the formula for the product difference: (a * b) - (c * d). You need to find two pairs of numbers from the array that maximize this difference."
    },
    {
      "content": "Remember that you need to select four distinct indices. This means that the pairs (a, b) and (c, d) cannot share any elements. Think about how you can ensure that the indices are unique."
    },
    {
      "content": "Consider the properties of multiplication. To maximize (a * b), you should look for the two largest numbers in the array. Similarly, to minimize (c * d), you should look for the two smallest numbers."
    },
    {
      "content": "Sort the array first. This will make it easier to access the largest and smallest elements. After sorting, the largest elements will be at the end of the array, while the smallest will be at the beginning."
    },
    {
      "content": "Once you have the sorted array, the largest product (for a * b) can be calculated using the two largest numbers, and the smallest product (for c * d) can be calculated using the two smallest numbers."
    },
    {
      "content": "After calculating both products, you can find the product difference. Make sure to handle the case where the array has exactly four elements, as this will limit your choices."
    },
    {
      "content": "Think about edge cases, such as when all numbers are the same or when there are negative numbers. However, in this problem, the constraints guarantee that all numbers are positive integers."
    },
    {
      "content": "You can express the final calculation as: max_product = sorted_nums[n-1] * sorted_nums[n-2] and min_product = sorted_nums[0] * sorted_nums[1]. The result will be max_product - min_product."
    },
    {
      "content": "Ensure that your implementation handles the input array correctly. The constraints specify that the length of nums will always be at least 4, so you won’t need to handle empty arrays or arrays with fewer than four elements."
    },
    {
      "content": "Finally, remember to return the result as a single integer value, which represents the maximum product difference. Make sure your function signature matches the expected format."
    }
  ],
  "questionNotes": [
    "Constraints: 4 <= nums.length <= 10^4",
    "Elements: 1 <= nums[i] <= 10^4",
    "Indices must be distinct for both pairs.",
    "Return format: a single integer value."
  ]
}