{
  "hints": [
    {
      "content": "Start by understanding the operation you can perform: choosing two adjacent elements and multiplying both by -1. Think about how this affects the overall sum of the matrix."
    },
    {
      "content": "Consider the initial sum of the matrix. What happens to the sum when you perform the operation? Specifically, if you flip two adjacent elements, how does their contribution to the total change?"
    },
    {
      "content": "Notice that if you flip two positive numbers, the sum decreases, while flipping two negative numbers increases the sum. Thus, focus on how you can maximize the number of negative numbers you flip to positive."
    },
    {
      "content": "Think about the structure of the matrix. Since you can only flip adjacent elements, you might want to analyze the arrangement of positive and negative numbers. Are there patterns or clusters?"
    },
    {
      "content": "Consider edge cases, such as matrices that are entirely positive or entirely negative. How would your approach change in these scenarios? What would the maximum sum be in these cases?"
    },
    {
      "content": "Evaluate how the count of negative numbers and their adjacency affects your ability to maximize the sum. If you have an odd number of negative numbers, what implications does that have?"
    },
    {
      "content": "Think about the parity of the count of negative numbers. If you can convert all but one negative number to positive, how does that impact the maximum sum?"
    },
    {
      "content": "You may want to calculate the absolute sum of all elements in the matrix. This will give you a baseline for the maximum possible sum if you could flip every negative number."
    },
    {
      "content": "When implementing your solution, consider using a greedy approach. Each time you flip adjacent elements, aim to maximize the number of negatives turned positive."
    },
    {
      "content": "Finally, outline your approach: Calculate the initial sum, determine the number of negative elements, and then decide how many flips are necessary to maximize the sum based on their adjacency."
    }
  ],
  "questionNotes": [
    "Constraints: n == matrix.length == matrix[i].length, 2 <= n <= 250",
    "Element range: -10^5 <= matrix[i][j] <= 10^5",
    "Two elements are considered adjacent if they share a border (horizontally or vertically).",
    "The goal is to maximize the summation of the matrix's elements.",
    "You can perform the flipping operation any number of times."
  ]
}