{
  "hints": [
    {
      "content": "Start by understanding what 'matching indices' means. You need to find indices in two arrays where the elements are equal after performing a certain number of right shifts on the first array."
    },
    {
      "content": "Consider how a right shift works. When you right shift an array, the last element moves to the front, and all other elements move one position to the right. For example, right shifting [1, 2, 3] results in [3, 1, 2]."
    },
    {
      "content": "Think about how many times you need to shift the first array. Since the array can be shifted up to its length, you will need to check for matches after each possible shift."
    },
    {
      "content": "You can use a loop to perform the shifts. For each shift, create a new version of the first array and compare it with the second array to count matches."
    },
    {
      "content": "Keep track of the maximum number of matches found after each shift. You can use a variable to store this maximum and update it whenever you find a new higher count."
    },
    {
      "content": "Be mindful of edge cases, such as when both arrays are empty or when they contain the same elements. What would happen in these scenarios?"
    },
    {
      "content": "Consider using a helper function to count matches between the two arrays. This will make your code cleaner and easier to manage."
    },
    {
      "content": "When counting matches, remember to only compare elements at the same index in both arrays. This means you will need to iterate through the length of the arrays."
    },
    {
      "content": "Think about the time complexity. You will be shifting the first array multiple times and comparing it with the second array each time. How can you optimize this?"
    },
    {
      "content": "Finally, ensure that your function returns the maximum number of matching indices after all shifts have been considered. You might want to return this value as an integer."
    }
  ],
  "questionNotes": [
    "Both input arrays are of the same length.",
    "The elements in the arrays can be repeated.",
    "You need to consider all possible right shifts of the first array.",
    "Return the maximum count of matching indices as an integer."
  ]
}