{
  "hints": [
    {
      "content": "Consider the impact of negative numbers on the product. When multiplying two negative numbers, the result is positive. Think about how you can use pairs of negative numbers to your advantage."
    },
    {
      "content": "Remember that you must form a non-empty group. This means you cannot simply ignore all negative numbers; you need to find a way to include them if they can increase the overall strength."
    },
    {
      "content": "What happens if you only have one number in the array? Make sure to handle this edge case where the group strength is simply the value of that single number."
    },
    {
      "content": "Sorting the array might help you easily identify the largest positive numbers and pairs of negative numbers. Consider sorting `nums` in descending order to facilitate your selection process."
    },
    {
      "content": "Think about how to iterate through the sorted array. You might want to keep track of the product as you include numbers in your group. How will you decide which numbers to include?"
    },
    {
      "content": "If you encounter a negative number, consider whether it should be included in the product. Would including it with another negative number yield a higher product than excluding it altogether?"
    },
    {
      "content": "If the product of all selected numbers is negative, you may want to exclude the smallest negative number (the one with the least absolute value) to maximize the product. How would you implement this?"
    },
    {
      "content": "Make sure to handle cases where all numbers are negative. In such cases, the best strategy might be to take the least negative number alone."
    },
    {
      "content": "Consider edge cases where the array contains zeros. Including a zero in your product will result in zero, so think about how to handle zeros effectively."
    },
    {
      "content": "Finally, remember to return the maximum strength as an integer. Ensure that your final product calculation is correct and that you handle all edge cases appropriately."
    }
  ],
  "questionNotes": [
    "1 <= nums.length <= 13",
    "-9 <= nums[i] <= 9",
    "The group must be non-empty.",
    "The product can include both positive and negative numbers.",
    "Consider edge cases with all negatives, zeros, or a single element."
  ]
}