{
  "hints": [
    {
      "content": "Start by understanding the selection process. You and your friends select piles in groups of three, where Alice always picks the maximum pile first, followed by you, and then Bob. How might this influence your strategy?"
    },
    {
      "content": "Consider how many piles you can select in total. Since there are 3n piles, and you take turns with Alice and Bob, think about how many times you will actually get to choose a pile."
    },
    {
      "content": "Think about the importance of sorting the piles. If you sort the piles in descending order, how might this help you visualize the selection process and maximize your coins?"
    },
    {
      "content": "When you select a triplet of piles, remember that you want to maximize your own coins. Try to analyze which piles you might want to leave for Alice and Bob to ensure you get the best possible picks."
    },
    {
      "content": "After sorting the piles, consider the strategy of always taking the second highest pile from each triplet you select. What does this imply about the piles you should choose?"
    },
    {
      "content": "As you think about the triplet selection, remember that the last pile picked by Bob will be the lowest in that triplet. How can you use this to your advantage when forming your triplet?"
    },
    {
      "content": "Reflect on how many total selections you will make. Since you will be selecting from groups of three, how can you calculate the number of times you will get to choose a pile?"
    },
    {
      "content": "Try to devise a formula or a method to accumulate your total coins based on the sorted piles. Which indices would you focus on in the sorted array to maximize your coins?"
    },
    {
      "content": "Think about the final structure of your solution. You might want to iterate through your sorted piles, accumulating your total based on your selections. What would that loop look like?"
    },
    {
      "content": "Remember, the goal is to maximize your coins. After sorting, you could iterate through the piles, skipping every third pile since that's the one Bob would take. What would your final implementation look like?"
    }
  ],
  "questionNotes": [
    "Constraints: 3 <= piles.length <= 10^5 and piles.length % 3 == 0.",
    "Each pile has at least 1 coin and at most 10^4 coins.",
    "You need to return the maximum number of coins you can collect.",
    "The selection process is crucial: Alice picks first, then you, then Bob."
  ]
}