{
  "hints": [
    {
      "content": "Consider how you can traverse the grid. You can only move to cells that are either to the right or below your current position. This means you need to think about the order in which you can access the cells."
    },
    {
      "content": "Remember, the score for a move is calculated as the value of the destination cell minus the value of the starting cell. This means that you want to maximize the difference between the destination and the starting cell."
    },
    {
      "content": "You can start at any cell in the grid. Think about how you can keep track of the maximum score you can achieve from each starting cell as you explore the grid."
    },
    {
      "content": "When considering moves, remember that you can jump to any cell that is to the right or below. This means you should look for ways to efficiently find the maximum values in the cells you can move to."
    },
    {
      "content": "To optimize your solution, consider using a data structure that allows you to quickly find the maximum value in the cells you can jump to. A max-heap or a simple linear search could be useful here."
    },
    {
      "content": "Think about iterating through the grid in a way that allows you to calculate the maximum possible score for each cell. You might want to maintain a running maximum of the values you can jump to."
    },
    {
      "content": "As you iterate through the grid, consider how you can update your maximum score based on the current cell's value and the maximum values of the cells you can jump to."
    },
    {
      "content": "Don't forget to handle edge cases, such as when the grid is very small or when all values are the same. Make sure your logic accounts for these scenarios."
    },
    {
      "content": "You might want to keep track of the maximum score you can achieve from each cell in a separate array. This will help you avoid recalculating scores multiple times."
    },
    {
      "content": "Finally, once you have calculated the maximum scores for all cells, ensure that you return the maximum score found. This will be your final result."
    }
  ],
  "questionNotes": [
    "You can start at any cell in the grid.",
    "You must make at least one move.",
    "The score for a move is calculated as c2 - c1.",
    "You can only move to cells that are to the right or below your current position.",
    "Constraints: 2 <= m, n <= 1000 and 4 <= m * n <= 10^5.",
    "Values in the grid are positive integers between 1 and 10^5."
  ]
}