{
  "hints": [
    {
      "content": "Start by understanding the dimensions of the cargo deck. Given that the deck is n x n, how many total cells (or positions for containers) are there? Think about how to calculate the total number of cells."
    },
    {
      "content": "Remember that each container has a fixed weight, w. Consider how you would calculate the total weight if you were to fill the entire deck with containers. What formula would you use?"
    },
    {
      "content": "Next, consider the ship's maximum weight capacity, maxWeight. How can you determine if loading all containers would exceed this capacity? Think about comparing the total weight of all containers to maxWeight."
    },
    {
      "content": "If the total weight of all containers exceeds maxWeight, you will need to find a way to load fewer containers. How would you calculate the maximum number of containers that can be loaded without exceeding the weight limit?"
    },
    {
      "content": "To find the maximum number of containers you can load, you can use integer division. Specifically, how many containers can you fit without exceeding maxWeight? Consider the formula: maxContainers = maxWeight / w."
    },
    {
      "content": "Now, compare the number of containers you can load (from the previous hint) with the total number of cells available on the deck (which is n * n). What will you take as the final answer?"
    },
    {
      "content": "Make sure to handle edge cases. For instance, what happens if the weight of one container (w) is greater than the maximum weight capacity (maxWeight)? How would that affect the number of containers you can load?"
    },
    {
      "content": "Consider the scenario where n is at its maximum value (1000). How would you ensure your solution remains efficient? Think about the operations you're performing and their complexity."
    },
    {
      "content": "Remember that the constraints specify that n, w, and maxWeight are all positive integers. How does this affect your calculations? Are there any special cases you need to consider?"
    },
    {
      "content": "Finally, put everything together. You will need to calculate the total number of cells, determine the maximum possible containers based on weight, and then return the minimum of these two values. Can you write out the steps in pseudocode?"
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= n <= 1000, 1 <= w <= 1000, 1 <= maxWeight <= 10^9",
    "The cargo deck is n x n, leading to n^2 total cells.",
    "Each container has a fixed weight of w.",
    "The total weight of containers must not exceed maxWeight.",
    "Return the maximum number of containers that can be loaded."
  ]
}