{
  "hints": [
    {
      "content": "Start by understanding what 'maximum sized array' means in the context of the problem. Consider if there are any constraints on the size of the array or the values it can hold."
    },
    {
      "content": "Think about how you might define the 'size' of the array. Is it based on the number of elements, the sum of the elements, or something else entirely?"
    },
    {
      "content": "Consider edge cases, such as what happens if the input is zero or negative. How should your solution handle these situations?"
    },
    {
      "content": "If the maximum size is determined by certain conditions, outline those conditions clearly. For example, are there limits on the values that can be included in the array?"
    },
    {
      "content": "You might want to think about how to efficiently store or calculate the size of the array. Would using a data structure like a list or a set be beneficial?"
    },
    {
      "content": "Consider how you would iterate through potential values to fill the array. What criteria will you use to decide which values to include?"
    },
    {
      "content": "If you are dealing with unique values, make sure to implement a way to check for duplicates before adding to the array. This could be done using a set."
    },
    {
      "content": "Think about how you will return the result. Should you return the size of the array, the array itself, or perhaps some other metric?"
    },
    {
      "content": "As you approach a solution, consider edge cases like an empty input or an input that exceeds expected limits. How will your solution handle these?"
    },
    {
      "content": "You are very close! Try to outline your final approach: how will you determine the maximum size of the array based on the defined conditions? What will your final return statement look like?"
    }
  ],
  "questionNotes": [
    "Ensure to handle cases where input is 0 or negative appropriately.",
    "Clarify the definition of 'maximum size' and any constraints on values.",
    "Consider uniqueness of values in the array if applicable.",
    "Decide on the return format: size, array, or another metric."
  ]
}