{
  "hints": [
    {
      "content": "Start by understanding the problem: you need to find the maximum product of any three numbers in the given array. Consider how the product of three numbers can be affected by both positive and negative integers."
    },
    {
      "content": "Remember that the product of three positive numbers will always be positive. However, if you have negative numbers, two negative numbers multiplied together yield a positive product. Think about how this could maximize the overall product."
    },
    {
      "content": "Consider sorting the array. When the array is sorted, the largest three numbers will be at the end. But don't forget to also check combinations involving negative numbers if they are present."
    },
    {
      "content": "After sorting, the maximum product can come from two scenarios: either the product of the three largest numbers or the product of the two smallest (most negative) numbers and the largest number. Can you think of how to calculate both scenarios?"
    },
    {
      "content": "When calculating the maximum product, you can use the last three elements of the sorted array for the first scenario. For the second scenario, you will need the first two elements and the last element of the sorted array."
    },
    {
      "content": "Make sure to handle edge cases, such as when all numbers are negative or when the array contains both large positive and large negative numbers. What would happen in these cases?"
    },
    {
      "content": "Think about the constraints provided: the length of the array is at least 3, and the values range from -1000 to 1000. This gives you a fixed number of elements to work with, simplifying your approach."
    },
    {
      "content": "You could implement a solution that sorts the array first. However, consider the time complexity of sorting vs. finding the maximum and minimum values directly. Which approach might be more efficient?"
    },
    {
      "content": "Once you have the two potential maximum products calculated, you can simply return the larger of the two. How would you structure your code to implement this logic?"
    },
    {
      "content": "Finally, remember to test your solution with various edge cases, such as arrays with all negative numbers, arrays with zeros, and arrays with both large positive and negative numbers. This will ensure your solution is robust."
    }
  ],
  "questionNotes": [
    "Constraints: 3 <= nums.length <= 10^4",
    "-1000 <= nums[i] <= 1000",
    "Return the maximum product of three numbers.",
    "Consider both positive and negative integers for maximum product.",
    "Sorting the array can help in finding the largest and smallest numbers."
  ]
}