{
  "hints": [
    {
      "content": "Consider what an alternating subarray is. An alternating subarray consists of elements where the signs of consecutive elements differ. For example, in the array [3, -1, 1, 2], the subarray [3, -1, 1] is alternating."
    },
    {
      "content": "Think about how you can identify the start and end of an alternating subarray. You might want to iterate through the array and check the sign of each element compared to the previous one."
    },
    {
      "content": "As you iterate through the array, keep track of the current sum of the alternating subarray. If the current element continues the alternating pattern, add it to the current sum."
    },
    {
      "content": "If you encounter an element that does not maintain the alternating property, you should compare the current sum with a maximum sum variable and reset the current sum to the current element."
    },
    {
      "content": "Remember to update the maximum sum after processing each element. This will ensure that you capture the largest sum of any valid alternating subarray you encounter."
    },
    {
      "content": "Consider edge cases, such as arrays with only one element or arrays where all elements are the same. How would your logic handle these scenarios?"
    },
    {
      "content": "Think about the initial conditions for your sums. You might want to start your maximum sum with a very low value (like negative infinity) to ensure any valid sum will be larger."
    },
    {
      "content": "When resetting the current sum after a break in the alternating pattern, make sure to include the new starting element in the current sum."
    },
    {
      "content": "You might want to create a helper function to check if two consecutive numbers are alternating. This could help keep your main logic clean and focused."
    },
    {
      "content": "Finally, ensure that you return the maximum sum found after processing the entire array. This will be your result for the maximum alternating subarray sum."
    }
  ],
  "questionNotes": [
    "The input is an array of integers.",
    "You need to find the maximum sum of any alternating subarray.",
    "Consider edge cases like single-element arrays or arrays with identical elements.",
    "The result should be a single integer representing the maximum sum."
  ]
}