{
  "hints": [
    {
      "content": "Start by understanding the problem statement clearly. You need to calculate the median salary for employees grouped by their company. Ensure you know what median means: it's the middle value in a sorted list."
    },
    {
      "content": "Consider how to extract the salary data from the provided input structure. You will need to loop through the rows to gather salaries for each company."
    },
    {
      "content": "Think about how to group the salaries by company. You might want to use a dictionary where the keys are company names and the values are lists of salaries."
    },
    {
      "content": "Once you have grouped salaries, remember that the median calculation requires sorting the list of salaries for each company. How would you sort a list in your chosen programming language?"
    },
    {
      "content": "When calculating the median, consider both even and odd cases. If the number of salaries is odd, the median is the middle number. If even, it's the average of the two middle numbers."
    },
    {
      "content": "Don't forget to handle cases where a company might have no employees or no salaries. How will you ensure your program doesn't crash in such scenarios?"
    },
    {
      "content": "As you implement the median calculation, remember to account for potential duplicate salaries. They should be included in the median calculation without any special treatment."
    },
    {
      "content": "Consider edge cases where all salaries are the same. What would the median be in such a case? Ensure your logic handles this correctly."
    },
    {
      "content": "After calculating the median for each company, think about how you will structure your output. What format should you return the results in?"
    },
    {
      "content": "Make sure to test your solution with the provided sample input. What results do you expect to see, and how will you verify correctness?"
    },
    {
      "content": "As you approach the final implementation, consider the efficiency of your solution. Sorting has a time complexity of O(n log n). Is there a way to optimize your median calculation?"
    },
    {
      "content": "When returning the median values, ensure you maintain the order of companies as they appear in the input. How will you achieve that?"
    },
    {
      "content": "Think about how you would handle ties in salary when calculating the median. Will it affect your median calculation, and if so, how?"
    },
    {
      "content": "Review your code for any potential off-by-one errors, especially when indexing lists. This is a common pitfall in median calculations."
    },
    {
      "content": "Before finalizing your solution, consider adding comments to your code. This will help clarify your thought process and make it easier to understand later."
    }
  ],
  "questionNotes": [
    "You need to calculate the median salary for employees grouped by their company.",
    "The input is structured as a dictionary with 'headers' and 'rows'.",
    "The median for odd numbers of salaries is the middle one; for even, it's the average of the two middle ones.",
    "Handle cases where a company may have no employees or salaries.",
    "Ensure the output maintains the order of companies as in the input."
  ]
}