{
  "hints": [
    {
      "content": "First, think about how you can filter the DataFrame to include only the animals that weigh more than 100 kilograms. You can use a condition to create a boolean mask for this."
    },
    {
      "content": "Remember that you can use the `DataFrame` method `.loc[]` to filter rows based on a condition. For example, `df.loc[condition]` will give you the rows where the condition is True."
    },
    {
      "content": "Next, consider how you can sort the resulting DataFrame by weight in descending order. The `sort_values()` method will be useful here, and you can specify the column to sort by."
    },
    {
      "content": "After filtering and sorting, you only need the 'name' column in your final output. Think about how to select only specific columns from the DataFrame after performing your operations."
    },
    {
      "content": "You can chain multiple methods together in Pandas. For example, you can filter, sort, and select columns all in one line. This is the essence of method chaining."
    },
    {
      "content": "Make sure to check the syntax for the methods you are using. For instance, `sort_values(by='weight', ascending=False)` will sort the DataFrame by the 'weight' column in descending order."
    },
    {
      "content": "Consider edge cases such as what happens if there are no animals weighing more than 100 kilograms. Your code should handle this gracefully and return an empty DataFrame."
    },
    {
      "content": "Remember to return the result in the format specified in the problem statement. You should only return the 'name' column, so ensure you are selecting it correctly after your operations."
    },
    {
      "content": "When chaining methods, ensure that each method is correctly applied to the output of the previous method. This means you need to be aware of the DataFrame structure after each operation."
    },
    {
      "content": "Finally, put everything together in one line. Start with your DataFrame, apply the filter for weight, sort the results, and then select the 'name' column. Make sure to check for any typos or syntax errors."
    }
  ],
  "questionNotes": [
    "The DataFrame contains columns: name, species, age, and weight.",
    "You need to filter animals with weight strictly greater than 100 kg.",
    "The output should only include the 'name' column.",
    "The results must be sorted by weight in descending order.",
    "Consider how to handle cases with no qualifying animals."
  ]
}