{
  "hints": [
    {
      "content": "To minimize the product sum of two arrays, think about how multiplication works. Larger numbers multiplied together yield larger products. What happens if you pair the largest numbers with the smallest?"
    },
    {
      "content": "Consider sorting both arrays. If you sort one array in ascending order and the other in descending order, how does that affect the product sum?"
    },
    {
      "content": "Remember that the product sum is calculated as the sum of the products of corresponding elements in the two arrays. This means that the order of elements in both arrays matters significantly."
    },
    {
      "content": "What if one of the arrays contains negative numbers? How would that influence the product sum? Think about how multiplying a negative number with a positive number affects the result."
    },
    {
      "content": "When sorting the arrays, ensure you are not modifying the original arrays if you need to keep them for reference later. You can create copies of the arrays before sorting."
    },
    {
      "content": "After sorting, you can iterate through the arrays to calculate the product sum. Consider using a loop to multiply the corresponding elements and accumulate the result."
    },
    {
      "content": "Make sure to handle edge cases where the arrays might be empty or have different lengths. What should you return in such cases?"
    },
    {
      "content": "Think about the time complexity of your approach. Sorting both arrays will take O(n log n) time. Is there a more efficient way to achieve the same result?"
    },
    {
      "content": "As you implement the solution, keep track of the indices and ensure you are accessing the correct elements from both arrays after sorting."
    },
    {
      "content": "Finally, remember to return the product sum as a single integer. Ensure your function has the correct return type and handles all inputs gracefully."
    }
  ],
  "questionNotes": [
    "Both arrays must be of the same length.",
    "The product sum is calculated as sum(array1[i] * array2[i]) for all i.",
    "Consider edge cases like empty arrays or arrays with negative numbers.",
    "The final output should be a single integer representing the minimized product sum."
  ]
}