{
  "hints": [
    {
      "content": "Start by understanding the two types of events in the string: 'E' for entering and 'L' for leaving. Each 'E' increases the number of people in the waiting room, while each 'L' decreases it."
    },
    {
      "content": "Consider initializing a counter to keep track of the current number of people in the waiting room. This will help you determine how many chairs are needed at any point."
    },
    {
      "content": "As you iterate through the string, increase the counter for each 'E' and decrease it for each 'L'. Make sure the counter never goes below zero, as that would indicate more people are leaving than are currently present."
    },
    {
      "content": "Think about how to track the maximum number of people present at any time. This maximum will determine the minimum number of chairs required."
    },
    {
      "content": "You can use a variable to keep track of the maximum number of people in the waiting room. Update this variable whenever you increase the current count after an 'E'."
    },
    {
      "content": "Remember to handle the case where a person leaves ('L') when the waiting room is empty. This should not affect your maximum chair count."
    },
    {
      "content": "Make sure to iterate through the string just once. This will keep your solution efficient and within the constraints of the problem."
    },
    {
      "content": "Consider edge cases, such as when the string consists entirely of 'E's or 'L's. How would your logic handle these scenarios?"
    },
    {
      "content": "After processing the string, the maximum number of people tracked will be your answer. This represents the minimum number of chairs needed."
    },
    {
      "content": "Finally, ensure your function returns the maximum number of chairs needed as an integer. You might want to return this value directly after your loop."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= s.length <= 50",
    "s consists only of the letters 'E' and 'L'.",
    "s represents a valid sequence of entries and exits.",
    "The waiting room is initially empty."
  ]
}