{
  "hints": [
    {
      "content": "Start by understanding the requirements for defeating an opponent. You need to have both strictly greater energy and experience than the opponent you're facing."
    },
    {
      "content": "Remember that defeating an opponent will change your energy and experience. Specifically, defeating an opponent decreases your energy and increases your experience based on the opponent's attributes."
    },
    {
      "content": "Consider how you can track your current energy and experience as you face each opponent. You will need to update these values after each battle."
    },
    {
      "content": "Before you start facing opponents, think about how much training you might need. You can train to increase either your energy or experience by one for each hour of training."
    },
    {
      "content": "To minimize the training hours, focus on the opponent that requires the most training first. This means checking each opponent's energy and experience requirements before you face them."
    },
    {
      "content": "When facing an opponent, if your current energy or experience is not sufficient, calculate the difference needed and add that to your training hours. For example, if your current experience is 4 and the opponent requires 6, you need 2 hours of training."
    },
    {
      "content": "Ensure that you are considering the order of opponents. The order matters because failing to defeat an earlier opponent means you cannot progress further."
    },
    {
      "content": "As you iterate through the opponents, keep a cumulative total of the training hours required. This will help you keep track of how much training you have done."
    },
    {
      "content": "Don't forget to check the constraints: both initial energy and experience, as well as the energy and experience of opponents, are guaranteed to be positive integers. This means you won't have to handle negative values."
    },
    {
      "content": "Finally, when you think you have enough training hours calculated, ensure that you return the total number of hours needed. This should be the minimum number of training hours required to defeat all opponents."
    }
  ],
  "questionNotes": [
    "Constraints: n == energy.length == experience.length",
    "1 <= n <= 100",
    "1 <= initialEnergy, initialExperience, energy[i], experience[i] <= 100",
    "You need strictly greater energy and experience to defeat an opponent.",
    "Return the total minimum training hours as an integer."
  ]
}