{
  "hints": [
    {
      "content": "Start by understanding the types of cuts allowed in the circle. Remember that a cut can either go through the center or just touch the center and one point on the edge."
    },
    {
      "content": "Consider how many slices you can create with a single cut. A single cut does not create any distinct slices; it merely divides the circle into two halves."
    },
    {
      "content": "Think about the relationship between the number of cuts and the number of slices. For example, how many slices can you make with 2 cuts? What about 3 cuts?"
    },
    {
      "content": "Notice that if you want to create an even number of slices, you can achieve this with half as many cuts. For instance, 4 slices can be made with 2 cuts."
    },
    {
      "content": "Now consider odd numbers of slices. How many cuts would you need to make 3 slices? This might lead you to think about the positioning of the cuts."
    },
    {
      "content": "For odd numbers of slices, each cut must create a new slice. This means that you will need as many cuts as there are slices to achieve distinct equal parts."
    },
    {
      "content": "Can you summarize the minimum number of cuts based on whether n (the number of slices) is odd or even? This could simplify your logic."
    },
    {
      "content": "Try to formulate a rule: If n is even, the minimum cuts needed is n/2. If n is odd, the minimum cuts needed is n."
    },
    {
      "content": "Make sure to implement a check for the edge case when n = 1. How many cuts do you need to divide a circle into 1 slice?"
    },
    {
      "content": "Finally, implement your logic based on the rules you've established. Use conditional statements to return the number of cuts based on whether n is odd or even."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= n <= 100",
    "Cuts must create equal slices.",
    "For n = 1, no cuts are needed.",
    "For even n, minimum cuts = n / 2.",
    "For odd n, minimum cuts = n."
  ]
}