{
  "hints": [
    {
      "content": "Start by understanding the input array. It is a sorted list of unique integers. Make sure to handle cases where the array is empty or contains only one element."
    },
    {
      "content": "Think about the range of numbers you need to cover. The problem specifies a lower and upper bound. How will you incorporate these bounds when checking for missing ranges?"
    },
    {
      "content": "Consider how you will iterate through the input array. You can use a loop to check each element against the next one to find gaps. What happens when you reach the end of the array?"
    },
    {
      "content": "When you find a gap between two numbers, you need to determine the start and end of the missing range. For example, if you find a gap between 1 and 3, the missing range is [2]."
    },
    {
      "content": "Pay attention to edge cases, such as when the first number in the array is greater than the lower bound or when the last number is less than the upper bound. How will you handle these situations?"
    },
    {
      "content": "Remember to format your output correctly. The result should be a list of strings representing the missing ranges. For example, [\"2\", \"4->49\", \"51->74\", \"76->99\"] is a valid output format."
    },
    {
      "content": "As you build your solution, consider using a variable to keep track of the previous number as you iterate through the array. This will help you easily identify gaps."
    },
    {
      "content": "Make sure to check if the lower bound itself is missing. If the first element in the array is greater than the lower bound, you should include that range in your results."
    },
    {
      "content": "When you reach the end of the array, don't forget to check if there is a gap between the last number and the upper bound. This is another potential missing range."
    },
    {
      "content": "Finally, ensure your solution handles all edge cases and returns the correct format. You might want to test your code with various input scenarios to confirm its accuracy."
    }
  ],
  "questionNotes": [
    "Input array is sorted and contains unique integers.",
    "You need to find missing ranges within the inclusive bounds of lower and upper.",
    "Output should be a list of strings representing the missing ranges.",
    "Consider edge cases like empty arrays, single elements, and bounds being outside the array."
  ]
}