{
  "hints": [
    {
      "content": "Start by understanding the structure of the input matrix. It is a 2D list (or array) with dimensions m x n. Make sure you can access elements using their row and column indices."
    },
    {
      "content": "Identify the elements that need to be replaced. Specifically, you will be looking for elements that are equal to -1. Consider how you can traverse the matrix to find these elements."
    },
    {
      "content": "For each -1 found in the matrix, you will need to determine the maximum value in its respective column. Think about how you can iterate through each column to find the maximum value."
    },
    {
      "content": "Remember that you need to keep the original matrix intact while creating a new matrix for the answer. You can initialize the answer matrix as a copy of the original matrix."
    },
    {
      "content": "As you iterate through the matrix, you can use a nested loop: the outer loop for rows and the inner loop for columns. This will help you access each element in the matrix."
    },
    {
      "content": "When you find a -1, you can use another loop to find the maximum value in that particular column. Keep track of the maximum value as you iterate through the rows of that column."
    },
    {
      "content": "Consider edge cases, such as when a column contains only -1 values. However, the problem guarantees at least one non-negative integer per column, so you won't have to handle columns with all -1s."
    },
    {
      "content": "Make sure to update the answer matrix only at the positions where you found -1. Use the maximum value you found in the column to replace the -1."
    },
    {
      "content": "After processing all elements, ensure that your answer matrix is returned in the correct format. It should be a 2D list with the same dimensions as the input matrix."
    },
    {
      "content": "Finally, think about the overall time complexity of your approach. You will likely have a nested loop structure, so consider how this affects performance, especially with the maximum constraints."
    }
  ],
  "questionNotes": [
    "The input matrix is guaranteed to have dimensions 2 <= m, n <= 50.",
    "Each column contains at least one non-negative integer, so you won't encounter columns with all -1s.",
    "The output should be a new matrix with the same dimensions as the input, where -1 values are replaced by the maximum value of their respective columns."
  ]
}