{
  "hints": [
    {
      "content": "Start by sorting the `stones` array. This will help you easily identify the smallest and largest stones, which are the endpoint stones. For example, if `stones = [7, 4, 9]`, sorting gives you `[4, 7, 9]`."
    },
    {
      "content": "Identify the minimum and maximum stones after sorting. These are the stones you can move. Remember, you can only move endpoint stones, so focus on the first and last elements of the sorted array."
    },
    {
      "content": "To determine when the game ends, check if the stones are in three consecutive positions. This means that the difference between the maximum and minimum stones should be less than or equal to 2."
    },
    {
      "content": "For calculating the minimum moves, consider how many stones need to be moved to create three consecutive positions. You can achieve this by moving the endpoint stones towards each other."
    },
    {
      "content": "For the maximum moves, think about how you can spread out the stones as much as possible while still maintaining the ability to move endpoint stones. Try to visualize moving stones one by one to create gaps."
    },
    {
      "content": "Consider edge cases where the stones are already in consecutive positions. In such cases, both the minimum and maximum moves should be zero."
    },
    {
      "content": "When calculating the moves, keep track of the positions that are already occupied by stones. This will help you avoid illegal moves where a stone is moved to an occupied position."
    },
    {
      "content": "To find the minimum moves, you may want to calculate the gaps between the stones. If the gap is greater than 2, you can move stones to fill that gap."
    },
    {
      "content": "Think about how moving one endpoint stone can potentially create new endpoints. This can help you maximize the number of moves you can make."
    },
    {
      "content": "Finally, implement the logic to count the moves. For the minimum moves, you might want to use a greedy approach, while for the maximum moves, consider a more thorough exploration of all possible moves."
    }
  ],
  "questionNotes": [
    "Constraints: 3 <= stones.length <= 10",
    "Each stone position is unique.",
    "Return format: an integer array of length 2, where answer[0] is the minimum moves and answer[1] is the maximum moves.",
    "The game ends when stones are in three consecutive positions."
  ]
}