{
  "hints": [
    {
      "content": "Start by understanding the structure of an n-ary tree. Each node can have multiple children. In the given input format, children of a node are represented sequentially until a null value indicates the end of that node's children."
    },
    {
      "content": "Consider how you would traverse the tree level by level. A common approach for level order traversal is to use a queue data structure. Think about how you can enqueue nodes as you visit them."
    },
    {
      "content": "When processing each node, you will need to keep track of the current level. You can do this by using a loop that processes all nodes at the current level before moving on to the next one."
    },
    {
      "content": "As you traverse, remember to store the values of nodes at each level in a separate list. You can then append this list to a result list that will hold the final output."
    },
    {
      "content": "Be mindful of the null values in the input. These indicate the end of children for a node, so you will need to handle them appropriately when parsing the input to build the tree."
    },
    {
      "content": "Consider edge cases, such as when the tree is empty (i.e., the root is null). How will your function handle this scenario? Make sure it returns the correct output format."
    },
    {
      "content": "Think about how you will iterate through the children of each node. You might want to use a loop that goes through the children list of the current node and enqueues each child."
    },
    {
      "content": "While implementing the queue, remember to also track the number of nodes at the current level. This can help you know when to stop processing the current level and move to the next."
    },
    {
      "content": "As you build the result list, ensure that you are appending a new list for each level. This can be done by initializing a new list at the start of processing each level."
    },
    {
      "content": "Finally, make sure your function returns the result in the correct format: a list of lists, where each inner list contains the values of the nodes at that level."
    }
  ],
  "questionNotes": [
    "The input is serialized in level order, with null values separating groups of children.",
    "The height of the n-ary tree is ≤ 1000.",
    "The total number of nodes is between 0 and 10,000.",
    "Ensure to handle the case when the root is null (empty tree).",
    "Return format must be a list of lists, each inner list representing a level."
  ]
}