{
  "hints": [
    {
      "content": "Start by identifying the minimum and maximum values in the array. You can do this by iterating through the array once and keeping track of the smallest and largest numbers you encounter."
    },
    {
      "content": "Remember that the problem states all numbers in the array are distinct. This means there won't be any duplicates, which simplifies your task of finding the minimum and maximum."
    },
    {
      "content": "After finding the minimum and maximum values, think about how you can check each number in the array to see if it is neither of those two values."
    },
    {
      "content": "Consider using a loop to go through each element in the array. For each element, you can check if it is greater than the minimum and less than the maximum."
    },
    {
      "content": "If you find an element that meets the criteria of being neither the minimum nor the maximum, you can return it immediately. This will save time instead of checking all elements."
    },
    {
      "content": "What if the array has only two elements? Think about how the constraints affect your ability to find a valid number that is neither the minimum nor the maximum."
    },
    {
      "content": "If you do not find any valid number after checking all elements, remember to return -1 as specified in the problem statement."
    },
    {
      "content": "Make sure to handle edge cases, such as when the array length is less than 3. In such cases, you cannot have a number that is neither the minimum nor the maximum."
    },
    {
      "content": "As you implement your solution, consider the efficiency of your approach. You only need to traverse the array a couple of times, which is efficient given the constraints."
    },
    {
      "content": "Finally, put together your findings: find the min and max, loop through the array to find a valid number, and return -1 if none is found. Ensure your code handles all edge cases correctly."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= nums.length <= 100",
    "Constraints: 1 <= nums[i] <= 100",
    "All values in nums are distinct",
    "Return -1 if no valid number is found",
    "Consider edge cases with small arrays (length < 3)"
  ]
}