{
  "hints": [
    {
      "content": "Start by understanding the structure of the Employee table. It contains two columns: 'id' and 'salary'. Remember that 'id' is unique for each employee."
    },
    {
      "content": "Focus on retrieving distinct salaries from the Employee table. You can use the DISTINCT keyword in SQL to filter out duplicate salary values."
    },
    {
      "content": "Once you have the distinct salaries, think about how to order them. You will want to sort these salaries in descending order to easily access the highest values."
    },
    {
      "content": "Consider how to limit the results to just the nth highest salary. You can use the LIMIT clause in SQL, but remember that you need to skip the first (n-1) salaries."
    },
    {
      "content": "What will you return if there are fewer than n distinct salaries? Make sure to handle this case by checking the count of distinct salaries before trying to access the nth one."
    },
    {
      "content": "You can use a subquery to first select the distinct salaries, order them, and then apply the LIMIT clause. This can help keep your main query clean."
    },
    {
      "content": "Remember to handle the return format correctly. If you find the nth highest salary, it should be returned as a single column with the name 'getNthHighestSalary'."
    },
    {
      "content": "Consider edge cases, such as when all employees have the same salary or when 'n' is larger than the number of distinct salaries. Your function should return null in these cases."
    },
    {
      "content": "Think about how to implement the logic in SQL. You might want to use a CTE (Common Table Expression) or a derived table to make your query more readable."
    },
    {
      "content": "Finally, piece together your SQL query. It should select from a subquery that retrieves distinct salaries, orders them, and uses OFFSET to skip the first (n-1) salaries, and then LIMIT 1 to get the nth."
    }
  ],
  "questionNotes": [
    "The 'id' column is unique for each employee.",
    "You need to return the nth highest distinct salary, or null if there are fewer than n distinct salaries.",
    "Use DISTINCT to filter out duplicate salaries.",
    "Return format must be a single column named 'getNthHighestSalary'."
  ]
}