{
  "hints": [
    {
      "content": "Start by understanding what it means for a person to be 'seen' in the grid. A person can see another if they are in the same row or column and there are no taller people blocking the view."
    },
    {
      "content": "Consider how you might represent the grid. Each element in the grid could represent the height of a person at that position. You may want to iterate through each person and check visibility."
    },
    {
      "content": "Think about how you can keep track of the tallest person seen so far as you iterate through each row and column. This will help you determine if the current person can be seen or not."
    },
    {
      "content": "When iterating through each row, you could maintain a variable to store the maximum height encountered. If the current person's height is greater than this maximum, they can be seen."
    },
    {
      "content": "Don't forget to handle both rows and columns. You will need to perform a similar check for each column after processing the rows. Consider using a loop for this."
    },
    {
      "content": "Edge cases are important! What happens if the grid is empty or if all people have the same height? Make sure your solution can handle these scenarios."
    },
    {
      "content": "Think about how you will store the results. You might want to use a counter to keep track of how many people can be seen as you process the grid."
    },
    {
      "content": "Remember to reset your maximum height tracker for each new row and column you process. This ensures that you are only comparing against the heights in the current row or column."
    },
    {
      "content": "Consider how you will return the final count of visible people. Should you return a list of counts for each row or just a single integer representing the total?"
    },
    {
      "content": "You are close! After processing both rows and columns, make sure to sum up all the visible counts and return that value. Think about how to structure your final return statement."
    }
  ],
  "questionNotes": [
    "The grid can contain varying heights of people, represented as integers.",
    "A person is considered 'seen' if they are taller than any person before them in the same row or column.",
    "Edge cases include empty grids and grids where all heights are the same.",
    "The return format should be a single integer representing the total number of visible people."
  ]
}