{
  "hints": [
    {
      "content": "Start by understanding the basic structure of a calendar month. Each month has a specific number of days, which can vary depending on the month and whether it's a leap year or not."
    },
    {
      "content": "Remember that there are 12 months in a year. Make a list of the months and their corresponding number of days for reference: January (31), February (28 or 29), March (31), etc."
    },
    {
      "content": "Consider how leap years affect the number of days in February. A leap year occurs every 4 years, but there are exceptions for years divisible by 100 unless they are also divisible by 400."
    },
    {
      "content": "You can start by creating a function that takes in a year and a month as parameters. Think about how you will handle the input values and what data types you will use."
    },
    {
      "content": "When checking if a year is a leap year, you can use a simple conditional statement. For example: `if (year % 4 == 0 && (year % 100 != 0 || year % 400 == 0))`."
    },
    {
      "content": "Make sure to validate the month input. The month should be between 1 and 12. If the input is outside this range, you may want to return an error or a specific value."
    },
    {
      "content": "Now, you can set up a mapping of the months to their days, taking into account whether it is a leap year for February. Use an array or a dictionary for this purpose."
    },
    {
      "content": "After determining if the year is a leap year, you can then decide how many days February has. This will affect your final output when the month is February."
    },
    {
      "content": "Once you have the days for each month established, return the number of days based on the month input. Make sure your function returns the correct value based on the conditions you’ve set."
    },
    {
      "content": "Finally, test your function with various inputs, including edge cases like February in a leap year and non-leap year, and months with the maximum and minimum number of days."
    }
  ],
  "questionNotes": [
    "Input consists of a year (integer) and a month (integer) between 1 and 12.",
    "Leap year rules: A year is a leap year if it is divisible by 4, but not divisible by 100, unless it is also divisible by 400.",
    "February has 28 days in a common year and 29 days in a leap year.",
    "Return the number of days in the specified month of the given year."
  ]
}