{
  "hints": [
    {
      "content": "Start by understanding what a self-divisible number is. A number is self-divisible if it can be divided by each of its digits without leaving a remainder. For example, 128 is self-divisible because 128 % 1 == 0, 128 % 2 == 0, and 128 % 8 == 0."
    },
    {
      "content": "Consider how to generate permutations of a given number. You can use a recursive approach or an iterative approach to generate all possible arrangements of the digits of the number."
    },
    {
      "content": "Think about how to check if a number formed by a permutation is self-divisible. You will need to iterate over each digit of the number and check the divisibility condition."
    },
    {
      "content": "Remember to handle cases where digits might be zero. A digit of zero will make any number formed by that permutation non-self-divisible since division by zero is undefined."
    },
    {
      "content": "When generating permutations, ensure that you do not count duplicates. For example, if the number has repeating digits, you should avoid counting those permutations multiple times."
    },
    {
      "content": "Consider using a set to store the unique permutations. This will help you automatically handle duplicates that arise from repeated digits."
    },
    {
      "content": "Think about the efficiency of your solution. Generating all permutations can be computationally expensive, especially for larger numbers. Aim to optimize your approach."
    },
    {
      "content": "Once you have the unique permutations, iterate through them and count how many of them are self-divisible. This will be your final answer."
    },
    {
      "content": "Make sure to return the count of self-divisible permutations as your output. Consider what data type you will use to store this count."
    },
    {
      "content": "Finally, ensure that you test your solution with edge cases, such as numbers with all the same digits, numbers with zeros, and very small numbers like 1 or 2."
    }
  ],
  "questionNotes": [
    "The input is a positive integer, and you need to consider all its digit permutations.",
    "Self-divisible numbers cannot have zero as any of their digits.",
    "You must count unique permutations only.",
    "Return the total count of self-divisible permutations."
  ]
}