{
  "hints": [
    {
      "content": "Start by understanding the relationships between the tables: Customers, Contacts, and Invoices. Each customer can have multiple contacts, and each invoice is linked to a user (customer)."
    },
    {
      "content": "Focus on how to count the trusted contacts for each customer. A trusted contact is defined as a contact linked to the customer through invoices."
    },
    {
      "content": "Consider how you will access the data. You may want to create a mapping of user IDs to their corresponding invoices first. This will help you identify which contacts are associated with which customers."
    },
    {
      "content": "Think about the structure of your data. You might want to use a dictionary or a hash map to store the count of trusted contacts for each customer as you process the invoices."
    },
    {
      "content": "As you iterate through the invoices, check the user_id for each invoice. For each user_id, look up the corresponding contacts and increment the count for that customer."
    },
    {
      "content": "Remember to handle cases where a customer has no invoices. Ensure that your final count reflects only those contacts that are indeed trusted."
    },
    {
      "content": "Pay attention to potential duplicates in contacts. If a customer has multiple invoices linked to the same contact, you should only count that contact once."
    },
    {
      "content": "Consider edge cases such as customers with no contacts or customers who have not made any invoices. How will your solution handle these cases?"
    },
    {
      "content": "After counting the trusted contacts, you will need to format your output correctly. Think about how to structure the final result to match the expected output format."
    },
    {
      "content": "Finally, implement your logic step by step, testing each part as you go. Start with counting the invoices, then move on to counting the trusted contacts, ensuring you handle all edge cases."
    }
  ],
  "questionNotes": [
    "Ensure to understand the relationships between Customers, Contacts, and Invoices.",
    "A trusted contact is a contact linked to a customer through invoices.",
    "Consider using a dictionary to count trusted contacts for each customer.",
    "Handle duplicates in contacts carefully.",
    "Be mindful of customers with no invoices or contacts."
  ]
}