{
  "hints": [
    {
      "content": "Start by understanding the conditions for a perfect pair. You need to find pairs (i, j) such that i < j. Make sure to clearly define what a and b are based on the indices."
    },
    {
      "content": "Focus on the two conditions involving min and max functions. Write down the expressions for min(|a - b|, |a + b|) and max(|a - b|, |a + b|) to see how they relate to min(|a|, |b|) and max(|a|, |b|)."
    },
    {
      "content": "Consider the implications of the conditions. For example, if a and b are both positive or both negative, how do the absolute differences and sums behave? What happens if one is negative and the other is positive?"
    },
    {
      "content": "Think about how you can iterate through the array. A nested loop might be a straightforward approach to check all pairs (i, j) where i < j. What would the time complexity be?"
    },
    {
      "content": "When checking pairs, ensure that both conditions are satisfied. You might want to create a function that checks if a given pair (a, b) meets the criteria for being a perfect pair."
    },
    {
      "content": "Remember that you need to count distinct perfect pairs. This means you should avoid counting the same pair more than once. How can you ensure uniqueness in your counting?"
    },
    {
      "content": "Consider edge cases, such as when the array contains duplicate values or when all values are the same. How would these cases affect your results?"
    },
    {
      "content": "Think about the range of values in nums. Since the values can be as large as 10^9 or as small as -10^9, how will this affect your calculations of min and max?"
    },
    {
      "content": "As you implement your solution, keep track of the number of perfect pairs found. You might want to use a counter variable initialized to zero and increment it whenever you find a valid pair."
    },
    {
      "content": "Finally, ensure your function returns the count of perfect pairs as specified in the problem statement. What format should the return value be in, and how will you handle the output?"
    }
  ],
  "questionNotes": [
    "Constraints: 2 <= nums.length <= 10^5",
    "-10^9 <= nums[i] <= 10^9",
    "Indices i and j must satisfy i < j.",
    "Pairs (i, j) must be distinct.",
    "Return the count of perfect pairs, not the pairs themselves."
  ]
}