{
  "hints": [
    {
      "content": "Start by understanding what a common factor is. A common factor of two numbers is an integer that divides both numbers without leaving a remainder."
    },
    {
      "content": "To find the common factors, you might want to first determine the range of numbers you need to check. Since the maximum value for both a and b is 1000, you only need to check integers from 1 to the minimum of a and b."
    },
    {
      "content": "Consider using a loop to iterate through all integers from 1 to min(a, b). For each integer, you can check if it divides both a and b."
    },
    {
      "content": "Remember to use the modulus operator (%) to check for divisibility. If both a % x == 0 and b % x == 0, then x is a common factor."
    },
    {
      "content": "Keep a counter to track how many common factors you find as you iterate through the numbers. You can initialize this counter to zero before the loop."
    },
    {
      "content": "Think about edge cases. What happens if a and b are equal? In that case, all factors of that number are common factors."
    },
    {
      "content": "Consider the smallest possible values for a and b. What are the common factors of 1 and 1? This will help you ensure your solution handles the lower limits correctly."
    },
    {
      "content": "While iterating, if you find a common factor, increment your counter. At the end of your loop, return the counter as the result."
    },
    {
      "content": "Make sure to test your function with various pairs of a and b, including both small and large values, to ensure it works correctly across the constraints."
    },
    {
      "content": "Finally, remember that the output should be a single integer representing the count of common factors. Ensure your function returns this value correctly."
    }
  ],
  "questionNotes": [
    "1 <= a, b <= 1000",
    "Return the number of common factors as a single integer.",
    "Common factors are integers that divide both a and b without a remainder."
  ]
}