{
  "hints": [
    {
      "content": "Start by understanding the structure of the input data. You have a list of orders, each with an order ID, product ID, and quantity. Make sure you can parse this data correctly."
    },
    {
      "content": "Calculate the average quantity across all orders. This is a key step because you will need to compare each order's quantity against this average."
    },
    {
      "content": "Think about how to iterate through the list of orders. You might want to use a loop to access each order's quantity and compare it to the average you calculated."
    },
    {
      "content": "When comparing quantities, remember that you are looking for orders with quantities that exceed the average. Consider using a conditional statement to filter these orders."
    },
    {
      "content": "Consider how you will keep track of the maximum quantity found among the orders that exceed the average. You might want to initialize a variable to store this maximum quantity."
    },
    {
      "content": "As you find orders with quantities above average, check if their quantity is greater than your current maximum. If it is, update your maximum and note the corresponding order ID."
    },
    {
      "content": "Think about edge cases: what if all orders have quantities below the average? Ensure your code can handle this without errors."
    },
    {
      "content": "Remember that there may be multiple orders with the same maximum quantity above average. Decide how you will handle such ties in your output."
    },
    {
      "content": "Your final output should include the order IDs of those orders that have the maximum quantity above average. Consider using a list to store these IDs."
    },
    {
      "content": "Finally, ensure that your function returns the correct format as specified in the problem statement. You might want to return a list of order IDs or a structured object."
    }
  ],
  "questionNotes": [
    "Input data is structured as a list of orders with order_id, product_id, and quantity.",
    "You need to calculate the average quantity across all orders.",
    "Handle cases where no orders exceed the average.",
    "Consider how to manage ties for maximum quantity above average.",
    "Return format should be a list of order IDs with maximum quantities."
  ]
}