{
  "hints": [
    {
      "content": "Start by understanding how to identify a segment. A segment begins at an index and extends until it encounters a character that has already been included in a previous segment."
    },
    {
      "content": "Consider using a set to keep track of the segments that have already been seen. This will help you quickly check if the current segment is unique."
    },
    {
      "content": "When building a segment, think about how you can dynamically add characters one by one. You can use a loop to append characters until you find a duplicate."
    },
    {
      "content": "Remember to reset your current segment when you find a duplicate. You will then need to start building a new segment from the next character."
    },
    {
      "content": "Pay attention to how you handle characters that repeat. For example, in the string 'aaaa', after adding 'a' to the seen set, the next character should lead to a new segment 'aa'."
    },
    {
      "content": "Think about edge cases, such as when the input string consists of the same character repeated multiple times. How would you handle this scenario?"
    },
    {
      "content": "As you build your segments, keep track of their starting index and the characters you have added so far. This will help you know when to stop adding to the current segment."
    },
    {
      "content": "You might want to use a nested loop: the outer loop iterates through the string, while the inner loop builds the current segment until a duplicate is found."
    },
    {
      "content": "Make sure to append each unique segment to your result list before resetting for the next segment. The order of segments matters, so maintain the sequence."
    },
    {
      "content": "Finally, ensure your function returns the list of segments in the correct format. It should be an array of strings, where each string represents a unique segment."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= s.length <= 10^5",
    "s contains only lowercase English letters.",
    "Segments must be unique and built character by character.",
    "Return format: an array of strings."
  ]
}