{
  "hints": [
    {
      "content": "Start by initializing an empty result string. This will be used to build the final output as you process each character in the input string."
    },
    {
      "content": "Remember to iterate through each character in the string `s`. Use a loop to access each character one by one."
    },
    {
      "content": "When you encounter a lowercase letter, simply append it to your result string. For example, if you encounter 'a', your result should become 'a'."
    },
    {
      "content": "Consider how to handle the '*' character. It should remove the last character from the result string. Make sure to check if the result is not empty before trying to remove a character."
    },
    {
      "content": "The '#' character duplicates the current result. Think about how you can concatenate the result with itself. For instance, if your result is 'abc', after this operation it should be 'abcabc'."
    },
    {
      "content": "When you see the '%' character, you need to reverse the current result. You can use string slicing or a built-in function to achieve this easily."
    },
    {
      "content": "Pay attention to the order of operations. Each character should be processed in the order they appear in the string, from left to right."
    },
    {
      "content": "Consider edge cases, such as what happens when '*' is encountered with an empty result or when '#' is applied to an empty string. Ensure your code handles these situations gracefully."
    },
    {
      "content": "Make sure to test your implementation with various inputs, especially edge cases like strings that only contain special characters or are very short."
    },
    {
      "content": "Finally, after processing all characters in the string, return the result. Ensure that your function returns the final string correctly."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= s.length <= 20",
    "s consists of only lowercase English letters and special characters: *, #, and %",
    "The operations must be processed in the order they appear in the input string."
  ]
}