{
  "hints": [
    {
      "content": "Start by understanding the movement capabilities of the queen and the king in chess. The queen can move any number of squares along a row, column, or diagonal, while the king can move one square in any direction."
    },
    {
      "content": "Consider how to represent the chessboard. You can use a 2D array, but since the problem is constrained to an 8x8 board, you might find it easier to work with coordinate pairs directly."
    },
    {
      "content": "Identify the positions of the queens and the king. You need to check each queen's position relative to the king's position to determine if it can attack."
    },
    {
      "content": "Focus on the directions in which a queen can attack. For each queen, check if it is in the same row, column, or diagonal as the king."
    },
    {
      "content": "When checking if a queen can attack the king, make sure to account for other queens that might block the attack path. Only the closest queen in a straight line can attack the king."
    },
    {
      "content": "You can simplify the problem by iterating through the list of queens and checking their coordinates against the king's coordinates. Use conditions to determine if they are aligned."
    },
    {
      "content": "For queens in the same row or column, check if there are any other queens between them and the king. For example, if a queen is at (0, 1) and the king is at (0, 0), check if there are any queens in between."
    },
    {
      "content": "Implement a way to collect the coordinates of the queens that can attack the king. You can use a list to store these coordinates as you find them."
    },
    {
      "content": "Remember to handle edge cases, such as when the king is surrounded by queens, or when there are no queens that can attack the king at all."
    },
    {
      "content": "Finally, ensure that your solution returns the list of attacking queens in the required format. You might want to return the coordinates as a list of lists."
    }
  ],
  "questionNotes": [
    "The chessboard is 0-indexed and has dimensions 8x8.",
    "Each queen's position is unique and provided in the input.",
    "The output can be in any order as long as it contains the correct attacking queens.",
    "Constraints: 1 <= queens.length < 64; all positions are unique."
  ]
}