{
  "hints": [
    {
      "content": "Start by identifying the positive and negative integers in the array. You can use two separate lists to store these values while preserving their original order."
    },
    {
      "content": "Remember that the input array has an even length and contains an equal number of positive and negative integers. This means that when you separate them, both lists will have the same length."
    },
    {
      "content": "Consider how you will alternate between the positive and negative integers. Since the rearranged array must start with a positive integer, you will need to interleave the two lists accordingly."
    },
    {
      "content": "Think about using a loop to construct the final array. You can use an index to track which list (positive or negative) you are currently adding to the result."
    },
    {
      "content": "As you build the new array, ensure that you are always taking one element from the positive list followed by one from the negative list. This will help maintain the required alternating pattern."
    },
    {
      "content": "Consider edge cases, such as the smallest possible input size. For example, with input [-1, 1], ensure your solution correctly handles this and produces [1, -1]."
    },
    {
      "content": "When constructing the result array, you should iterate through a range that covers half the length of the original array since you will be adding one positive and one negative integer at each step."
    },
    {
      "content": "Make sure to test your solution with various inputs, including cases where the positive and negative integers have large values or are in a different order. This will help ensure your solution is robust."
    },
    {
      "content": "As you finalize your implementation, remember that the order of positive and negative integers must remain as they were in the original array. This is crucial for the correctness of your solution."
    },
    {
      "content": "To complete your solution, combine the two lists in the correct alternating order. You can use a loop that runs for half the length of the original array, appending elements from both lists to the result."
    }
  ],
  "questionNotes": [
    "The input array has an even length.",
    "There are equal numbers of positive and negative integers.",
    "The rearranged array must start with a positive integer.",
    "The order of integers with the same sign must be preserved.",
    "The output format is an array of integers."
  ]
}