{
  "hints": [
    {
      "content": "Start by splitting the input string into individual words. You can use the `split()` method in Python, which will handle the spaces for you. For example, `words = text.split()` will give you a list of words."
    },
    {
      "content": "Remember that the first letter of the input sentence is capitalized. After rearranging the words, you'll need to ensure that the first word in the output is also capitalized."
    },
    {
      "content": "To sort the words by length, you can use the `sorted()` function with a custom key. The key should be the length of each word: `sorted(words, key=len)`."
    },
    {
      "content": "When sorting, if two words have the same length, they should maintain their original order. The `sorted()` function is stable in Python, which means it will keep the original order for equal elements."
    },
    {
      "content": "After sorting the words, join them back into a single string using the `join()` method. For example, `new_text = ' '.join(sorted_words)` will create a space-separated string from the list of sorted words."
    },
    {
      "content": "Don't forget to handle the capitalization of the first word after rejoining the words. You can capitalize the first word using `capitalize()` or by manually adjusting the string."
    },
    {
      "content": "Consider edge cases such as a single word input. The output should still follow the same rules, meaning the single word should remain capitalized."
    },
    {
      "content": "Think about how to handle punctuation or special characters, although the problem statement specifies lowercase letters and spaces. Ensure your solution adheres to the constraints given."
    },
    {
      "content": "Make sure to test your solution with various inputs, including sentences with words of the same length and varying lengths. This will help ensure your sorting logic is correct."
    },
    {
      "content": "Finally, combine all your steps: split the text, sort the words by length while maintaining order, join them back into a string, and ensure the first word is capitalized. Remember to return the final string."
    }
  ],
  "questionNotes": [
    "The first letter of the input text is always uppercase.",
    "Words are separated by a single space.",
    "Output must start with a capital letter.",
    "If two words have the same length, they should retain their original order."
  ]
}