{
  "hints": [
    {
      "content": "Start by understanding the input format. You have a list of points, each defined by an x and y coordinate. Make sure you can parse this input correctly before proceeding."
    },
    {
      "content": "Consider what a rectangle is defined by. You need two points to define a rectangle in a 2D space. Think about how you can use the points provided to form rectangles."
    },
    {
      "content": "Remember that the area of a rectangle can be calculated using the formula: Area = width * height. Identify how you can derive width and height from the points."
    },
    {
      "content": "Think about how to determine the minimum and maximum x and y values from the points. These values will help you calculate the dimensions of the rectangle."
    },
    {
      "content": "When calculating the area, ensure you handle cases where points might be collinear or overlap. What happens if two points have the same x or y coordinate?"
    },
    {
      "content": "Consider edge cases where points might form a line rather than a rectangle. How will you handle cases where the area is zero?"
    },
    {
      "content": "You may need to iterate through pairs of points to find all possible rectangles. How will you efficiently check each pair of points to determine if they can form a rectangle?"
    },
    {
      "content": "Think about how to store the calculated areas. You might want to keep track of unique areas only. How will you ensure that you don't count the same area multiple times?"
    },
    {
      "content": "Once you have calculated the areas, consider how you will return the result. Will you return the maximum area, a list of areas, or something else?"
    },
    {
      "content": "Finally, ensure your solution handles the input constraints effectively. For example, what is the maximum number of points you might need to process, and how does this affect your algorithm's efficiency?"
    }
  ],
  "questionNotes": [
    "Input consists of a list of points with x and y coordinates.",
    "Each rectangle is defined by two points: (x1, y1) and (x2, y2).",
    "Area = |x2 - x1| * |y2 - y1|.",
    "Handle edge cases where points may form a line or overlap.",
    "Return format for the result needs to be clarified: single area, list of areas, etc."
  ]
}