{
  "hints": [
    {
      "content": "Start by understanding the problem requirements. You need to determine the rank of each athlete based on their unique scores. Remember that the athlete with the highest score gets the highest rank."
    },
    {
      "content": "Think about how you can sort the scores to determine the ranks. Sorting the scores will help you easily assign ranks based on their positions in the sorted array."
    },
    {
      "content": "Consider how to handle the special ranks for the top three athletes. The first athlete gets 'Gold Medal', the second gets 'Silver Medal', and the third gets 'Bronze Medal'."
    },
    {
      "content": "For athletes ranked 4th and below, you will need to convert their rank numbers into strings. For example, the 4th athlete's rank should be '4' as a string."
    },
    {
      "content": "When sorting the scores, keep track of the original indices. You will need to return the ranks in the order corresponding to the original scores."
    },
    {
      "content": "You can use a data structure like a list of tuples to store both the score and its original index. This way, when you sort the list, you can still access the original positions."
    },
    {
      "content": "After sorting, iterate through the sorted list and assign the appropriate rank based on the index. Use a conditional statement to check if the index is less than 3 for special ranks."
    },
    {
      "content": "Make sure to create an output array that matches the size of the input array. Initialize it with empty strings or placeholders to ensure you can fill it correctly."
    },
    {
      "content": "Don’t forget to handle edge cases, such as the minimum input size (n = 1). Ensure that your solution works correctly for the smallest and largest possible inputs."
    },
    {
      "content": "Finally, remember to return the output in the correct format. Your output should be an array of strings, where each string represents the rank of the corresponding athlete based on their original position."
    }
  ],
  "questionNotes": [
    "Scores are unique, which simplifies rank assignment.",
    "Output must be in the same order as the input scores.",
    "Special ranks for the top three athletes: 'Gold Medal', 'Silver Medal', 'Bronze Medal'.",
    "Ranks for positions 4 and below should be their position number as a string."
  ]
}