{
  "hints": [
    {
      "content": "Start by understanding the goal: you need to remove 'k' digits from 'num' to form the smallest possible integer. Consider how the order of digits affects the final number."
    },
    {
      "content": "Think about how removing a digit affects the overall value. For example, removing a larger digit that appears before smaller digits can lead to a smaller resultant number."
    },
    {
      "content": "Consider using a stack data structure to help maintain the order of digits as you decide which ones to keep. The stack can help you easily compare and remove digits."
    },
    {
      "content": "As you iterate through the digits of 'num', you can push them onto the stack. However, before pushing, check if the current digit is smaller than the top of the stack and if you can still remove more digits (i.e., k > 0)."
    },
    {
      "content": "When you encounter a digit that is smaller than the top of the stack, pop the stack until the top is smaller or you run out of removals (k becomes 0). This ensures the smallest digits are kept."
    },
    {
      "content": "After processing all digits, if you still have digits left to remove (k > 0), you can remove them from the end of the stack since they would be the largest remaining digits."
    },
    {
      "content": "Once you have your final digits in the stack, convert them back to a string. Be careful to handle leading zeros, as they should not be included in the final output."
    },
    {
      "content": "If the final result after removing k digits is an empty string, return '0' as specified in the problem statement."
    },
    {
      "content": "Remember to handle edge cases, such as when all digits are removed or when the input number has leading zeros after removals. Always ensure the output format is correct."
    },
    {
      "content": "Finally, consider the time complexity of your approach. You want to ensure that your solution runs efficiently, ideally in O(n) time, where n is the length of the input string 'num'."
    }
  ],
  "questionNotes": [
    "1 <= k <= num.length <= 10^5",
    "num consists of only digits.",
    "num does not have any leading zeros except for the zero itself.",
    "Output must not contain leading zeroes.",
    "If all digits are removed, return '0'."
  ]
}