{
  "hints": [
    {
      "content": "Consider what it means to flip a row or a column in the matrix. When you flip a row, all elements in that row change from 0 to 1 or from 1 to 0. Similarly, flipping a column affects all elements in that column. Think about how these operations can be used to achieve your goal."
    },
    {
      "content": "Start by examining the first row of the matrix. If you decide to flip it, how would that affect the rest of the matrix? You might want to track the changes to see if you can minimize the number of flips needed."
    },
    {
      "content": "Notice that flipping a row or a column can be thought of as toggling the bits. You can represent the state of the matrix as a binary representation where 0 means no flip and 1 means a flip has occurred. How can you use this representation to simplify your approach?"
    },
    {
      "content": "Think about the relationship between rows and columns. If you flip a row, it may be beneficial to also consider which columns need to be flipped afterward to maintain the desired state of the matrix."
    },
    {
      "content": "To solve the problem, you might want to focus on the first row and determine the necessary flips based on its values. After that, analyze how these flips would affect the rest of the matrix. Can you create a strategy that minimizes the flips based on the first row's state?"
    },
    {
      "content": "Consider the cases where the matrix has only one row or one column. What happens when you have a matrix of size 1x1? This could help you understand edge cases and the base conditions for your solution."
    },
    {
      "content": "As you work through the matrix, keep track of the number of flips you make. You may want to implement a counter that increments each time you perform a flip on a row or a column. How can you ensure that you are making the minimum number of flips?"
    },
    {
      "content": "You might want to create a function that checks if the current state of the matrix matches the desired state after a series of flips. This could help you validate your approach as you iterate through possible flips."
    },
    {
      "content": "Consider the implications of flipping a row or column multiple times. Flipping the same row or column twice will revert it back to its original state. How can you leverage this to optimize your solution?"
    },
    {
      "content": "Finally, think about how you can implement a systematic way to check all possible combinations of row and column flips. You may want to use a nested loop structure to evaluate each possibility while keeping track of the minimum number of flips needed to achieve a matrix full of zeros."
    }
  ],
  "questionNotes": [
    "The matrix can contain only 0s and 1s.",
    "Flipping a row or column changes all elements in that row or column.",
    "The goal is to make all elements in the matrix equal to 0.",
    "Consider edge cases such as matrices of size 1x1 or 1xN.",
    "The output should be the minimum number of flips required."
  ]
}