{
  "hints": [
    {
      "content": "Start by identifying the vowels you need to remove. The English vowels are 'a', 'e', 'i', 'o', and 'u'. You can create a set of these characters for quick lookup."
    },
    {
      "content": "Consider how you will iterate through the characters of the input string. A simple loop can be used to check each character against your set of vowels."
    },
    {
      "content": "Think about how you will build the resulting string without vowels. You might want to use a list to collect characters that are not vowels, which you can join at the end."
    },
    {
      "content": "Remember that the input string can be empty. How will your code handle this case? Ensure that your solution does not throw an error for an empty input."
    },
    {
      "content": "Consider performance. If the input string is very long, how will your approach scale? Using a set for vowel checking will help maintain efficiency."
    },
    {
      "content": "As you build your result, think about the order of characters. You want to maintain the original order of non-vowel characters in the output string."
    },
    {
      "content": "When checking each character, use a conditional statement to determine if it is a vowel. If it is not, add it to your result list."
    },
    {
      "content": "After you have iterated through the entire string and collected non-vowel characters, remember to join the list into a final string before returning it."
    },
    {
      "content": "Consider edge cases, such as strings that consist solely of vowels, or strings that contain mixed-case letters. Your solution should handle these gracefully."
    },
    {
      "content": "Finally, ensure your function returns the correct type. The expected output is a string, so make sure your final result is indeed a string after joining the list."
    }
  ],
  "questionNotes": [
    "Input string can be empty.",
    "Only lowercase vowels ('a', 'e', 'i', 'o', 'u') need to be removed.",
    "Maintain the order of non-vowel characters in the output.",
    "The output must be a string."
  ]
}