{
  "hints": [
    {
      "content": "Start by understanding the input parameters. You have a string and an integer. What do you think the integer represents in relation to the string?"
    },
    {
      "content": "Consider how you would approach repeating a string. What built-in functions or methods in your programming language could help you achieve this?"
    },
    {
      "content": "Think about how you can concatenate the string with itself. If you have a string `s` and an integer `n`, how would you construct the repeated version of `s`?"
    },
    {
      "content": "Remember that the integer can be zero. What should your function return if the integer is zero? Think about the expected output in this case."
    },
    {
      "content": "What happens if the string is empty? Consider how your function should behave when given an empty string as input."
    },
    {
      "content": "You might want to use a loop to build the repeated string. How would you structure a loop to repeat the string `n` times?"
    },
    {
      "content": "If you're using a loop, consider how to handle the case when `n` is negative. What would be a reasonable output for a negative repeat count?"
    },
    {
      "content": "You can also use string multiplication if your programming language supports it. For example, in Python, you can do `s * n`. What would that look like in your language?"
    },
    {
      "content": "Make sure to test your function with various inputs, including edge cases like an empty string, zero, and negative numbers. What do you expect the outputs to be for these cases?"
    },
    {
      "content": "Finally, ensure your function returns the result in the correct format. What should the return type be, and how will you handle any unexpected input gracefully?"
    }
  ],
  "questionNotes": [
    "The integer can be zero, which means the output should be an empty string.",
    "If the string is empty, the output should also be an empty string regardless of the integer.",
    "Consider how to handle negative integers: should it return an error, or an empty string?"
  ]
}