{
  "hints": [
    {
      "content": "Start by understanding the problem clearly. You need to replace each element in the array with the greatest element that comes after it. Remember that the last element should always be replaced with -1."
    },
    {
      "content": "Consider how you might approach this problem. A naive solution would involve nested loops, where for each element, you check all elements to the right. Think about the time complexity of this approach."
    },
    {
      "content": "Instead of checking every element to the right for each element, think about how you can keep track of the maximum value seen so far as you iterate through the array from right to left."
    },
    {
      "content": "As you iterate from the end of the array to the beginning, maintain a variable to store the maximum value encountered. This will help you easily replace the current element with the greatest element to its right."
    },
    {
      "content": "When you reach the last element of the array, remember to set it to -1, as specified in the problem statement. This is a crucial detail that ensures your solution is correct."
    },
    {
      "content": "Think about how you will initialize your maximum variable. You might want to start with a value that is less than any possible value in the array, or simply use the last element's value before replacing it with -1."
    },
    {
      "content": "As you iterate, update your current element with the maximum value found so far, and then update the maximum value to be the current element. This way, you always have the greatest element to the right ready for the next iteration."
    },
    {
      "content": "Consider edge cases, such as when the input array has only one element. Make sure your solution handles this case correctly by returning [-1]."
    },
    {
      "content": "Remember that the input constraints guarantee that the array will have at least one element. This means you don't need to handle empty arrays, simplifying your implementation."
    },
    {
      "content": "Now, you should have a clear approach in mind. Start implementing your solution by initializing an output array and iterating from the end of the input array, updating values as discussed."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= arr.length <= 10^4",
    "Constraints: 1 <= arr[i] <= 10^5",
    "The last element must be replaced with -1.",
    "You need to consider the greatest element to the right for each element, not including itself."
  ]
}