{
  "hints": [
    {
      "content": "Start by understanding the structure of the string. The string consists of lowercase letters and '?' characters. Your goal is to replace each '?' with a lowercase letter while ensuring that no two adjacent characters are the same."
    },
    {
      "content": "Consider how you can iterate through the string. You can use a loop to go through each character and check if it is a '?'. If it is, you'll need to decide what letter to replace it with."
    },
    {
      "content": "When replacing a '?', you should look at the characters immediately before and after it (if they exist). This will help you determine which letters are not allowed to be used for replacement to avoid consecutive repeats."
    },
    {
      "content": "Remember that you have 26 lowercase letters to choose from. If you encounter a '?', you can pick any letter that is not the same as the character before or after it. This gives you flexibility in your choices."
    },
    {
      "content": "Think about edge cases, such as when the string starts or ends with '?'. In these cases, you only need to check one adjacent character to avoid consecutive repeats."
    },
    {
      "content": "As you replace each '?', make sure to update the string or a mutable version of it. This way, you can keep track of your changes and ensure that the replacements do not lead to any invalid configurations."
    },
    {
      "content": "You might want to create a set of characters that are disallowed for each '?'. This can help streamline your decision-making process when choosing a replacement character."
    },
    {
      "content": "Consider using a simple array or list to build the final string as you process each character. This can make it easier to manage the replacements and ensure you are not modifying the original string directly."
    },
    {
      "content": "When you reach a '?' character, check the previous and next characters. If both are different, you have a wider range of choices. If one is the same, your options are reduced."
    },
    {
      "content": "Finally, make sure to return the modified string after processing all characters. You can do this by joining your character array or list into a single string."
    }
  ],
  "questionNotes": [
    "1 <= s.length <= 100",
    "s consists of lowercase English letters and '?'",
    "No consecutive repeating characters except for '?'",
    "Return any valid string that meets the criteria."
  ]
}