{
  "hints": [
    {
      "content": "Start by identifying the first occurrence of the character `ch` in the string `word`. You can use a loop or a built-in function to find the index of `ch`."
    },
    {
      "content": "Remember that the string is 0-indexed. This means that the first character has an index of 0, and the last character has an index of `word.length - 1`."
    },
    {
      "content": "If the character `ch` is not found in `word`, you should return `word` as it is. Make sure to handle this case before attempting to reverse any part of the string."
    },
    {
      "content": "Once you have the index of the first occurrence of `ch`, you can slice the string into two parts: the segment you want to reverse and the rest of the string."
    },
    {
      "content": "To reverse the segment from index 0 to the found index, you can use slicing and the `[::-1]` syntax in Python, which reverses a string."
    },
    {
      "content": "After reversing the segment, concatenate it with the remaining part of the string (the part after the index of `ch`)."
    },
    {
      "content": "Consider edge cases, such as when `word` consists of only one character or when `ch` is the first character in `word`. How would your solution handle these scenarios?"
    },
    {
      "content": "Make sure to test your solution with different inputs, including cases where `ch` appears multiple times. You only need to reverse up to the first occurrence."
    },
    {
      "content": "Think about how you will implement the return statement. You should ensure that the final string is properly formatted and does not contain any unintended spaces or characters."
    },
    {
      "content": "Your final implementation should look something like this: find the index of `ch`, reverse the substring from 0 to that index, and then combine it with the rest of the string. Remember to return the new string."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= word.length <= 250",
    "The string consists of lowercase English letters.",
    "ch is a lowercase English letter.",
    "If ch does not exist in word, return word unchanged."
  ]
}