{
  "hints": [
    {
      "content": "Start by understanding the robot's initial position and direction. The robot begins at (0, 0) facing north. Make sure you visualize how the robot moves based on the instructions."
    },
    {
      "content": "Remember the three types of instructions: 'G' for moving forward, 'L' for turning left, and 'R' for turning right. Think about how each instruction affects the robot's position and orientation."
    },
    {
      "content": "Consider how the robot's direction changes with 'L' and 'R'. You can represent directions as vectors. For example, North can be (0, 1), East can be (1, 0), South can be (0, -1), and West can be (-1, 0)."
    },
    {
      "content": "As the robot moves, keep track of its current position and direction after each instruction. You might want to use a loop to process each instruction in the input string."
    },
    {
      "content": "After executing all the instructions once, check the robot's final position. If it returns to (0, 0), it is guaranteed to be bounded in a circle."
    },
    {
      "content": "If the robot does not return to (0, 0), consider its direction after executing the instructions. If the robot faces a direction other than North, it will eventually loop back."
    },
    {
      "content": "Think about edge cases, such as when the instructions consist of only 'G's. What happens if the robot only moves forward? How does this affect the bounded condition?"
    },
    {
      "content": "You can also analyze the robot's movement pattern. If the robot's final direction after one full cycle of instructions is North, it will keep moving away from the origin indefinitely."
    },
    {
      "content": "To summarize, check two conditions: the robot's final position and its final direction after executing the instructions. Both conditions will help determine if the robot is bounded in a circle."
    },
    {
      "content": "Finally, implement a function that takes the instructions as input and returns true if the robot is bounded in a circle and false otherwise. Make sure to handle all possible instruction combinations."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= instructions.length <= 100",
    "Instructions can only be 'G', 'L', or 'R'.",
    "The robot's movement is repeated indefinitely based on the input instructions."
  ]
}