{
  "hints": [
    {
      "content": "Start by understanding the structure of the input data. You have two main components: 'Product' and 'Sales'. Each has its own set of attributes, so make sure to identify what each attribute represents."
    },
    {
      "content": "Focus on the 'Sales' data. Each sale entry contains a 'product_id', which links to the 'Product' data. Think about how you can use this to join the two datasets."
    },
    {
      "content": "Consider how to aggregate sales data. You may want to calculate total sales for each product, which involves summing the 'quantity' and 'price' fields in the 'Sales' dataset."
    },
    {
      "content": "Remember to handle cases where a product may not have any sales. How will you ensure that your final output includes all products, even those with zero sales?"
    },
    {
      "content": "When calculating total sales, think about the correct data types. Ensure that you're performing arithmetic operations on numeric types and not strings."
    },
    {
      "content": "As you prepare to output your results, think about the required format. You might need to return a structured output that includes product details along with the calculated sales."
    },
    {
      "content": "Pay attention to the order of your output. If the problem specifies a certain order (like by 'product_id'), make sure to sort your results accordingly before returning them."
    },
    {
      "content": "Consider edge cases, such as products with the same total sales. How will you handle tie-breaking if the problem requires it?"
    },
    {
      "content": "As you finalize your output, ensure that you include all necessary fields. For each product, you might need to include 'product_id', 'product_name', 'unit_price', and total sales."
    },
    {
      "content": "You're almost there! Start drafting your output structure. It should be a list of products, each represented as an object with the required fields and their corresponding values."
    }
  ],
  "questionNotes": [
    "The input consists of two datasets: 'Product' and 'Sales'.",
    "Each product is uniquely identified by 'product_id'.",
    "Sales records reference products by 'product_id'.",
    "Ensure to include all products in the final output, even those with no sales.",
    "The output should include 'product_id', 'product_name', 'unit_price', and total sales.",
    "Consider sorting the final output by 'product_id'.",
    "Handle potential edge cases, such as products with no sales."
  ]
}