{
  "hints": [
    {
      "content": "Start by understanding the structure of the DataFrame. You have three columns: student_id, name, and age. You need to filter the DataFrame based on the student_id."
    },
    {
      "content": "Remember that you are looking for a specific student_id, which is 101 in this case. Make sure to check how to filter rows in a DataFrame based on a condition."
    },
    {
      "content": "After filtering, you'll need to select only the name and age columns from the resulting DataFrame. Think about how to access specific columns in a DataFrame."
    },
    {
      "content": "Consider using a method that allows you to filter and select columns in one step. Look into methods that can chain operations together."
    },
    {
      "content": "Be mindful of the return format. The output should only contain the name and age columns, so ensure you are not including the student_id in your final result."
    },
    {
      "content": "What happens if there is no student with student_id = 101? Think about how your solution should handle such cases. Should it return an empty DataFrame or a specific message?"
    },
    {
      "content": "Make sure your final output DataFrame has the correct column names. The output should have 'name' and 'age' as the headers, but not 'student_id'."
    },
    {
      "content": "You might want to check if the DataFrame is indexed properly. If you're using a method that relies on indexing, ensure that it behaves as expected."
    },
    {
      "content": "Consider using a query method or boolean indexing to filter the DataFrame. This could simplify your code and make it more readable."
    },
    {
      "content": "Finally, your last step should be to execute the filtering and selection in one line. Think about how you can combine your filtering condition with the selection of columns."
    }
  ],
  "questionNotes": [
    "You need to filter the DataFrame by student_id = 101.",
    "The output should only include the columns 'name' and 'age'.",
    "Consider how to handle cases where student_id = 101 does not exist.",
    "Ensure that the output DataFrame has the correct headers.",
    "The DataFrame should be accessed correctly using appropriate methods."
  ]
}