{
  "hints": [
    {
      "content": "Start by understanding the constraints of the problem. You can only select one cell from each row, and the selected values must be unique. This means you need to think about how to navigate through the rows and ensure no duplicates."
    },
    {
      "content": "Consider how you might approach selecting cells. A good starting point could be to iterate through each row and identify the maximum values available in each row."
    },
    {
      "content": "Think about how you can keep track of the values you've already selected to ensure they are unique. A set data structure could be useful for this purpose."
    },
    {
      "content": "As you iterate through the rows, you might want to sort the values in each row. This will help you quickly access the highest values and check for uniqueness."
    },
    {
      "content": "Remember that the grid can have varying column sizes. Ensure your solution can handle rows that may not have the same number of columns."
    },
    {
      "content": "When selecting values, consider using a greedy approach. Start by picking the highest available value from the first row, then move to the next row and pick the highest unique value."
    },
    {
      "content": "If you encounter a situation where the highest value in the next row is already chosen, you will need to look for the next highest unique value. Think about how you can efficiently find this."
    },
    {
      "content": "Keep track of the total score as you select values. This will help you determine if you are maximizing your score effectively."
    },
    {
      "content": "Consider edge cases, such as when there are duplicate maximum values in a row. You need to ensure that you are not selecting the same value from different rows."
    },
    {
      "content": "If you find that you cannot select a unique value in a row, consider backtracking to previous rows to see if you can replace a previously selected value to maximize your score."
    },
    {
      "content": "You might want to implement a priority queue or a max-heap to efficiently get the highest unique values from each row as you progress through the grid."
    },
    {
      "content": "Think about how you will return the maximum score. Your final score should be the sum of the selected unique values from the grid."
    },
    {
      "content": "Before finalizing your approach, ensure you have considered all possible selections. You might need to explore combinations of selections to find the optimal score."
    },
    {
      "content": "Remember that the constraints allow for a maximum of 10 rows and 10 columns. This gives you some leeway in terms of computational complexity, but you still want to be efficient."
    },
    {
      "content": "As a final step, make sure to test your solution with various test cases, including edge cases where rows have the same maximum value or where the grid is very small."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= grid.length, grid[i].length <= 10",
    "Values: 1 <= grid[i][j] <= 100",
    "Selected cells must be unique in value.",
    "No two selected cells can be in the same row.",
    "Return the maximum score as the sum of selected values."
  ]
}