{
  "hints": [
    {
      "content": "Start by understanding what a self-dividing number is. A number is self-dividing if it is divisible by each of its digits without leaving a remainder. For instance, 128 is self-dividing since 128 % 1 == 0, 128 % 2 == 0, and 128 % 8 == 0."
    },
    {
      "content": "Remember that a self-dividing number cannot contain the digit zero. This means you need to check each digit of the number to ensure it is non-zero before performing the divisibility check."
    },
    {
      "content": "Consider how you will iterate through the range of numbers from 'left' to 'right'. You can use a simple for loop to go through each number in this range."
    },
    {
      "content": "When checking if a number is self-dividing, you will need to extract each digit. Think about how you can do this using integer division and the modulo operator."
    },
    {
      "content": "For a given number, you can use a while loop to extract digits. For example, you can get the last digit using `digit = number % 10` and then remove it from the number using `number = number // 10`."
    },
    {
      "content": "As you check each digit, ensure that you handle the case where the digit is zero. If you encounter a zero, you can immediately conclude that the number is not self-dividing."
    },
    {
      "content": "After extracting a digit, check if the original number is divisible by that digit. If it is not, you can break out of the loop and move on to the next number."
    },
    {
      "content": "You will need to collect all the self-dividing numbers in a list. Consider initializing an empty list before your loop starts and appending each self-dividing number to this list."
    },
    {
      "content": "Make sure to return the list of self-dividing numbers after you finish checking all numbers in the specified range. The return format should be a list of integers."
    },
    {
      "content": "Finally, ensure that your solution efficiently handles the maximum constraints of the problem (up to 10,000). Check your logic and ensure there are no unnecessary computations."
    }
  ],
  "questionNotes": [
    "A self-dividing number cannot contain the digit zero.",
    "You need to return a list of self-dividing numbers in the range [left, right], inclusive.",
    "Constraints: 1 <= left <= right <= 10^4."
  ]
}