{
  "hints": [
    {
      "content": "First, consider how to handle the sign of the number. If the number is negative, the strategy for minimizing its value will differ from when the number is positive."
    },
    {
      "content": "For a positive number, think about how to rearrange the digits in ascending order. However, be careful about leading zeros, as they are not allowed in the final result."
    },
    {
      "content": "When rearranging digits of a positive number, the smallest digit should come first, but if that digit is zero, you need to find the next smallest digit to place at the front."
    },
    {
      "content": "For a negative number, the goal is to maximize the digits after the negative sign. This means you should sort the digits in descending order."
    },
    {
      "content": "Remember to handle edge cases where the number might be a single digit or consist of repeated digits. How would these cases affect your approach?"
    },
    {
      "content": "Consider how you will extract the digits from the number. You can convert the number to a string, split it into characters, and then manipulate those characters."
    },
    {
      "content": "After sorting the digits, you need to check if there are any leading zeros in the positive case. If so, swap the leading zero with the next smallest non-zero digit."
    },
    {
      "content": "For the negative case, after sorting the digits in descending order, simply concatenate them back together to form the final number."
    },
    {
      "content": "Think about the data types you will use. Since the number can be very large (up to 10^15), ensure that your solution can handle such large integers without overflow."
    },
    {
      "content": "Finally, once you have formed the rearranged number, make sure to convert it back to an integer before returning, to ensure the correct format."
    }
  ],
  "questionNotes": [
    "Constraints: -10^15 <= num <= 10^15",
    "Leading zeros are not allowed in the final result for positive numbers.",
    "For negative numbers, the digits should be arranged to maximize the value after the negative sign.",
    "Consider edge cases like single-digit numbers or numbers with all identical digits."
  ]
}