{
  "hints": [
    {
      "content": "Start by understanding the problem: you need to find the smallest multiple of a given number that consists only of two digits. What are the two-digit numbers you can work with?"
    },
    {
      "content": "Consider the range of two-digit numbers. They start from 10 and go up to 99. Make a list of all two-digit multiples of the given number."
    },
    {
      "content": "When generating the two-digit multiples, remember to check if they are greater than the input number. How can you efficiently filter those that are greater?"
    },
    {
      "content": "Think about how to iterate through the two-digit numbers. You might want to use a loop that starts from the smallest two-digit number and goes up to the largest."
    },
    {
      "content": "As you find multiples, keep track of the smallest one that meets the criteria. You might want to initialize a variable to store this smallest multiple."
    },
    {
      "content": "Don't forget about edge cases! What happens if the input number is 0 or a negative number? How should your function handle these cases?"
    },
    {
      "content": "If your input number is larger than 99, consider how you can handle this scenario. Should you return a specific value or throw an error?"
    },
    {
      "content": "When you find a valid multiple, ensure you check if it is indeed the smallest one. You may want to use a condition to compare it with your current smallest multiple."
    },
    {
      "content": "Think about the return format of your solution. Should you return just the number, or is there additional information you need to provide?"
    },
    {
      "content": "You are very close! To finalize your solution, consider how you will implement the logic to check each two-digit number and compare it against your criteria for being the smallest valid multiple."
    }
  ],
  "questionNotes": [
    "The input number can be 0 or negative, which requires special handling.",
    "Only two-digit numbers (10 to 99) are valid multiples.",
    "If no valid multiple exists, you may need to define what your function should return.",
    "Ensure to handle cases where the input number is greater than 99."
  ]
}