{
  "hints": [
    {
      "content": "Start by understanding the input format. You have two lists: one containing features and another containing sentences. Each sentence may contain multiple occurrences of the features."
    },
    {
      "content": "Think about how you can count the occurrences of each feature in the sentences. You might want to use a dictionary or a hash map to keep track of these counts."
    },
    {
      "content": "Consider how to iterate through the sentences. You can split each sentence into words and then check if each word is a feature. This will help you gather counts."
    },
    {
      "content": "When counting occurrences, remember to handle multiple occurrences of the same feature in a single sentence. Each occurrence should contribute to the total count."
    },
    {
      "content": "After counting the occurrences, you need to sort the features based on their popularity. Think about how you can use the counts you've gathered to determine the order."
    },
    {
      "content": "Remember that the output should be the features sorted by popularity. If two features have the same count, think about how you might handle tie-breaking (e.g., by their original order in the input list)."
    },
    {
      "content": "Consider edge cases, such as when a feature does not appear in any sentence at all. How will this affect your sorting and final output?"
    },
    {
      "content": "Make sure to maintain the original order of features in case of ties. You might want to use a stable sorting algorithm or keep track of the original indices."
    },
    {
      "content": "Once you have sorted the features, the final step is to format your output correctly. Ensure you return a list of features in the required order."
    },
    {
      "content": "As a final step, test your solution with various inputs, including cases with no features in sentences, all features present, and features with the same counts to ensure correctness."
    }
  ],
  "questionNotes": [
    "Input consists of two lists: features and sentences.",
    "Features can appear multiple times in sentences.",
    "Output should be a list of features sorted by popularity.",
    "In case of ties, maintain the original order of features.",
    "Consider edge cases like features not appearing in any sentence."
  ]
}