{
  "hints": [
    {
      "content": "Start by understanding the problem statement clearly. You need to sort an array based on the absolute values of its elements, not the values themselves. For example, the absolute value of -4 is 4, and the absolute value of 3 is 3."
    },
    {
      "content": "Consider how you would normally sort an array. What function or method do you use? Think about how you can modify the sorting criteria to use absolute values instead of the original values."
    },
    {
      "content": "You can use a sorting function that allows you to specify a custom key. In many programming languages, this can be done by passing a lambda or a function that returns the absolute value of each element."
    },
    {
      "content": "Remember that sorting is typically done in ascending order. Make sure that your sorting logic correctly handles both positive and negative numbers, as their absolute values will affect their order."
    },
    {
      "content": "Think about edge cases. What happens if the input array is empty? How should your function handle it? An empty array should simply return an empty array."
    },
    {
      "content": "Consider what happens if the input array contains multiple elements with the same absolute value. For example, in the array [-1, 1], both have an absolute value of 1. How should they be ordered relative to each other?"
    },
    {
      "content": "When implementing your sorting logic, you might want to ensure that the original order is preserved for elements with the same absolute value. This is known as a stable sort."
    },
    {
      "content": "If you're using a programming language with built-in sorting functions, check if they are stable. If not, you may need to implement additional logic to maintain the original order of equal elements."
    },
    {
      "content": "As you implement your solution, test it with various cases, including negative numbers, zeros, and large values. For example, try your function with inputs like [0, -2, 2, -3] to see if it behaves as expected."
    },
    {
      "content": "Finally, remember to return the sorted array. Make sure your function signature matches the expected format, and that you handle the output correctly after sorting."
    }
  ],
  "questionNotes": [
    "The input is an array of integers, which can include negative and positive values.",
    "The output should be a new array sorted by the absolute values of the elements.",
    "If two elements have the same absolute value, their original order should be preserved (stable sorting).",
    "Consider edge cases like empty arrays and arrays with duplicate absolute values."
  ]
}