{
  "hints": [
    {
      "content": "Start by identifying the indices of the array that you need to sort. Remember that even indices are 0, 2, 4, etc., while odd indices are 1, 3, 5, etc. This will help you separate the values you need to sort."
    },
    {
      "content": "Once you have identified the indices, create two separate lists: one for the values at even indices and another for those at odd indices. This separation will make it easier to sort them independently."
    },
    {
      "content": "For the even indices, sort the values in non-decreasing order. In Python, you can use the `sorted()` function, which sorts lists in ascending order by default."
    },
    {
      "content": "For the odd indices, sort the values in non-increasing order. You can achieve this by using the `sorted()` function with the parameter `reverse=True`."
    },
    {
      "content": "After sorting the even and odd indexed lists, you'll need to merge them back into the original array. Make sure to place the sorted even values back at their original even indices and the sorted odd values at their original odd indices."
    },
    {
      "content": "Consider edge cases where the length of the array is 1 or where all values are the same. In these cases, the sorted output should remain the same as the input."
    },
    {
      "content": "When merging the sorted lists back into the original array, be careful to maintain the correct order of indices. Use a loop to iterate through the original indices and place the sorted values accordingly."
    },
    {
      "content": "Remember to check the constraints of the problem. The length of the array can be between 1 and 100, and the values range from 1 to 100. This means you won't have to deal with negative numbers or very large values."
    },
    {
      "content": "If you're using a programming language that has built-in sorting functions, make sure to leverage them for simplicity. However, be aware of how they handle tie-breaking in case of duplicate values."
    },
    {
      "content": "Finally, after you have merged the sorted values back into the original array, return the modified array. Ensure that your function returns the result in the expected format."
    }
  ],
  "questionNotes": [
    "1 <= nums.length <= 100",
    "1 <= nums[i] <= 100",
    "Even indices: 0, 2, 4, ...; Odd indices: 1, 3, 5, ...",
    "Sort even indices in non-decreasing order; sort odd indices in non-increasing order."
  ]
}