{
  "hints": [
    {
      "content": "Start by understanding what 'parity' means. Parity refers to whether a number is odd or even. An even number has a parity of 0, while an odd number has a parity of 1."
    },
    {
      "content": "Consider the definition of a special array: adjacent elements must have different parity. This means if one element is even, the next must be odd, and vice versa."
    },
    {
      "content": "Think about how you can check the parity of an integer. You can use the modulus operator: `num % 2`. If the result is 0, the number is even; if it’s 1, it’s odd."
    },
    {
      "content": "To check pairs of adjacent elements, you will need to iterate through the array. Remember that you will need to compare each element with the one that follows it."
    },
    {
      "content": "When iterating, keep in mind the array's bounds. You should stop before the last element to avoid going out of bounds when checking the next element."
    },
    {
      "content": "Consider edge cases, such as when the array has only one element. Since there are no adjacent elements to compare, it should automatically return true."
    },
    {
      "content": "As you iterate through the array, you can maintain a boolean variable to track whether the array is special. If you find any pair of adjacent elements with the same parity, you should set this variable to false."
    },
    {
      "content": "Make sure to return the correct type. The function should return a boolean value: `true` for a special array and `false` otherwise."
    },
    {
      "content": "Think about the time complexity of your solution. Since you will be iterating through the array once, your solution should run in O(n) time, where n is the length of the array."
    },
    {
      "content": "Finally, put all these pieces together in your code. Loop through the array, check the parity of each adjacent pair, and return the result based on your findings."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= nums.length <= 100",
    "Constraints: 1 <= nums[i] <= 100",
    "The array is considered special if all adjacent pairs have different parity.",
    "If the array has only one element, it is automatically considered special."
  ]
}