{
  "hints": [
    {
      "content": "Start by understanding what a 'special position' is. A position (i, j) is special if mat[i][j] == 1 and all other elements in row i and column j are 0."
    },
    {
      "content": "Consider how to iterate through the matrix. You will need to check each position (i, j) to see if it is a special position. This means you will likely use nested loops."
    },
    {
      "content": "When checking if a position is special, remember that you need to verify both the row and the column. Think about how you can efficiently check if all other elements in row i and column j are 0."
    },
    {
      "content": "You might want to keep track of the number of 1s in each row and each column. This will help you quickly determine if a position (i, j) can be special."
    },
    {
      "content": "As you check each position, if you find that mat[i][j] == 1, you should check the counts of 1s in row i and column j. If both counts are 1, then (i, j) is a special position."
    },
    {
      "content": "Consider edge cases, such as a matrix filled entirely with 0s or a matrix that is 1x1. How should your solution handle these cases?"
    },
    {
      "content": "Make sure to account for the constraints given: 1 <= m, n <= 100. This means your solution should be efficient enough to handle the maximum size of the matrix."
    },
    {
      "content": "Think about the return value. You need to return the total count of special positions found in the matrix. Keep a counter that increments each time you find a special position."
    },
    {
      "content": "Before finalizing your solution, test it with different configurations of the binary matrix to ensure it handles various scenarios correctly, including edge cases."
    },
    {
      "content": "You are close to a solution! Start implementing your logic to count special positions based on the checks you've outlined. Remember to initialize your counters and iterate through the matrix properly."
    }
  ],
  "questionNotes": [
    "A position (i, j) is special if mat[i][j] == 1 and all other elements in row i and column j are 0.",
    "Constraints: 1 <= m, n <= 100; mat[i][j] is either 0 or 1.",
    "Be mindful of 0-indexing in the matrix.",
    "Return the total count of special positions."
  ]
}