{
  "hints": [
    {
      "content": "Start by understanding the rules of the game. Alice always removes 10 stones on her first turn. If the total number of stones (n) is less than 10, Alice cannot make her move and loses the game."
    },
    {
      "content": "Consider what happens after Alice's first move. If she successfully removes 10 stones, think about how many stones are left for Bob. This will determine Bob's possible moves."
    },
    {
      "content": "After Alice removes 10 stones, Bob will have to remove 9 stones on his turn. If there are not enough stones left for Bob to make his move, Alice wins."
    },
    {
      "content": "Analyze the scenarios where Bob can or cannot make a move. For instance, if there are 12 stones, after Alice's turn, 2 stones remain. Bob cannot remove 9 stones, so he loses."
    },
    {
      "content": "Think about the maximum number of stones that can be left after Alice's first turn. If n is 10 or more, how does the number of stones affect Bob's ability to play?"
    },
    {
      "content": "Identify the critical values of n. For example, if n = 11, Alice removes 10 stones, leaving Bob with 1 stone. Can Bob remove 9 stones? What does this imply for Alice's strategy?"
    },
    {
      "content": "Consider edge cases where n is just above or below 10. What happens when n = 10, 11, 12, or 9? Write down the outcomes for these specific values."
    },
    {
      "content": "You can create a simple decision structure based on the remaining stones after Alice's first turn. If the remaining stones are less than 9, Alice wins. If they are 9 or more, Bob can play."
    },
    {
      "content": "Think about the pattern of winning and losing positions. Can you derive a general rule from the outcomes of specific cases? How does the number of stones affect the game's outcome?"
    },
    {
      "content": "Finally, consider implementing a function that checks if Alice wins based on the initial number of stones. Use the insights from previous hints to determine the winning condition."
    }
  ],
  "questionNotes": [
    "Alice starts by removing exactly 10 stones.",
    "Each subsequent player removes 1 fewer stone than the previous player.",
    "The player who cannot make a move loses.",
    "1 <= n <= 50."
  ]
}