{
  "hints": [
    {
      "content": "Start by understanding what a strobogrammatic number is. A strobogrammatic number appears the same when rotated 180 degrees. For example, '69' and '88' are strobogrammatic."
    },
    {
      "content": "Identify the valid digit pairs that can form strobogrammatic numbers: (0, 0), (1, 1), (6, 9), (8, 8), and (9, 6). These pairs will be essential in constructing the numbers."
    },
    {
      "content": "Consider the length of the number you are generating. If you need to create strobogrammatic numbers of length 'n', think about how the first and last digits relate to the pairs you identified."
    },
    {
      "content": "When constructing numbers of even length, you can fill the middle with any valid pairs. For odd lengths, remember to place a valid single digit in the center."
    },
    {
      "content": "Use recursion or backtracking to build the numbers. Start with an empty string and progressively add pairs of digits while ensuring the number remains strobogrammatic."
    },
    {
      "content": "Keep track of the current length of the number being formed. When the length matches 'n', add the current number to your results list."
    },
    {
      "content": "Pay attention to leading zeros. If the first digit of the number is '0', it should only be allowed if the number is of length 1."
    },
    {
      "content": "Think about how to handle the base cases. For example, if n is 0, you should return an empty list, and if n is 1, the valid strobogrammatic numbers are just '0', '1', and '8'."
    },
    {
      "content": "Consider using a helper function that takes the current string and the remaining length to fill. This can simplify the logic of adding pairs and checking lengths."
    },
    {
      "content": "Finally, ensure that your result is unique. You may want to use a set to store results initially to avoid duplicates before converting it back to a list."
    }
  ],
  "questionNotes": [
    "Valid pairs: (0, 0), (1, 1), (6, 9), (8, 8), (9, 6)",
    "Leading zeros are only allowed for single-digit numbers.",
    "Return a list of unique strobogrammatic numbers.",
    "Handle edge cases for n = 0 and n = 1 specifically."
  ]
}