{
  "hints": [
    {
      "content": "Start by checking the length of the password. A strong password must be at least 8 characters long. You can use a simple conditional statement to verify this."
    },
    {
      "content": "Next, consider the character types required for a strong password. You need to check for at least one lowercase letter, one uppercase letter, one digit, and one special character from the set: '!@#$%^&*()-+'."
    },
    {
      "content": "You can use Python's built-in string methods like `isupper()`, `islower()`, `isdigit()`, and a membership check for special characters to validate the presence of each required character type."
    },
    {
      "content": "Remember to initialize flags for each character type you are checking. For example, you could have boolean variables like `has_lower`, `has_upper`, `has_digit`, and `has_special`."
    },
    {
      "content": "As you iterate through the password characters, update these flags accordingly. This way, you can easily check if all required types are present after the loop."
    },
    {
      "content": "Don't forget to check for adjacent duplicate characters. You can do this by comparing the current character with the previous one as you iterate through the password."
    },
    {
      "content": "You can maintain a variable, say `prev_char`, to keep track of the last character you processed. If the current character matches `prev_char`, you have found an adjacent duplicate."
    },
    {
      "content": "After checking for length and character types, and ensuring there are no adjacent duplicates, you can combine the results of these checks to determine if the password is strong."
    },
    {
      "content": "Make sure your final return statement reflects whether all conditions are satisfied. You can use logical operators to combine the results of your checks."
    },
    {
      "content": "Finally, consider edge cases such as passwords that are exactly 8 characters long but lack one of the required character types, or those that contain special characters but are too short."
    }
  ],
  "questionNotes": [
    "A strong password must have at least 8 characters.",
    "It must contain at least one lowercase letter, one uppercase letter, one digit, and one special character from the specified set.",
    "Adjacent duplicate characters are not allowed.",
    "The password length can be between 1 and 100 characters."
  ]
}