{
  "hints": [
    {
      "content": "Start by understanding what a substring is. A substring is a contiguous sequence of characters from a string. For example, in the string 'abc', the substrings of length 3 would be just 'abc'."
    },
    {
      "content": "Remember that you need to find substrings of exactly length 3. This means you'll be looking at groups of three consecutive characters in the string."
    },
    {
      "content": "Consider how you can iterate through the string to extract each substring of length 3. You can use a loop that goes from the start of the string to the third last character."
    },
    {
      "content": "As you extract each substring, check if it contains distinct characters. You can do this by converting the substring to a set and comparing its length to 3."
    },
    {
      "content": "Think about how to count the good substrings. You can maintain a counter that increments each time you find a substring with distinct characters."
    },
    {
      "content": "Consider edge cases where the string length is less than 3. In these cases, you should return 0 since no substrings of length 3 can exist."
    },
    {
      "content": "To check for distinct characters, you might want to use a set. A set automatically handles duplicates, so if the length of the set is 3, the substring has all distinct characters."
    },
    {
      "content": "When iterating through the string, remember to only check substrings starting from index 0 to index length(s) - 3. This ensures you don't go out of bounds."
    },
    {
      "content": "Make sure to handle multiple occurrences of the same good substring correctly. Each occurrence should be counted, so your loop should continue checking all possible substrings."
    },
    {
      "content": "Finally, after counting all good substrings, return the count. Ensure your return statement is correctly placed after the loop that checks the substrings."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= s.length <= 100",
    "s consists of lowercase English letters.",
    "Count every occurrence of good substrings, not just unique ones."
  ]
}