{
  "hints": [
    {
      "content": "Start by understanding how to extract the digits from the integer n. You can do this by converting the integer to a string and then iterating over each character."
    },
    {
      "content": "Once you have the digits, remember that you need to calculate both the product and the sum of these digits. Consider initializing two variables: one for the product (starting at 1) and one for the sum (starting at 0)."
    },
    {
      "content": "As you iterate through each digit, update the product by multiplying it with the current digit and update the sum by adding the current digit to it."
    },
    {
      "content": "Don't forget to convert each character back to an integer when performing calculations. You can use the `int()` function for this conversion."
    },
    {
      "content": "After you finish iterating through the digits, you will have both the total product and total sum. The next step is to compute the difference between these two values."
    },
    {
      "content": "Make sure to return the result of the difference, which is the product minus the sum. This is the final output of your function."
    },
    {
      "content": "Consider edge cases such as when n is a single-digit number. In this case, the product and sum will be the same, leading to a result of zero."
    },
    {
      "content": "You should also verify that your implementation works for the upper limit of the input constraints, specifically n = 100000. Ensure it runs efficiently without performance issues."
    },
    {
      "content": "As a final check, ensure that you are following the return format specified in the problem statement. The output should be a single integer representing the difference."
    },
    {
      "content": "Now, try to put all these pieces together in your code. Start with extracting the digits, then calculate the product and sum, and finally return the difference. Remember to keep your code clean and well-commented."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= n <= 10^5",
    "Return format: Single integer representing the difference between product and sum of digits.",
    "Consider edge cases like single-digit numbers."
  ]
}