{
  "hints": [
    {
      "content": "Start by breaking down the string into two halves. Since the length of the string is even, you can easily find the middle index to separate the first half from the second half."
    },
    {
      "content": "Calculate the current sums of both halves, ignoring the '?' characters for now. This will help you understand the initial state before any replacements are made."
    },
    {
      "content": "Consider how the '?' characters can be replaced. Each '?' can be turned into any digit from '0' to '9'. Think about how this flexibility can affect the sums of both halves."
    },
    {
      "content": "Analyze the impact of replacing '?' in both halves. If Alice replaces a '?' in the first half, how can Bob counter that in the second half? Keep in mind that both players are playing optimally."
    },
    {
      "content": "Count the number of '?' characters in each half. This will help you determine the maximum potential increase or decrease in the sums for both players."
    },
    {
      "content": "Consider edge cases where there are no '?' characters. What happens if the sums are already equal? What if they are not? This will help you understand the base cases."
    },
    {
      "content": "Think about the worst-case scenarios for both players. For example, if Alice has a strategy to ensure that Bob cannot equal the sums, what would that look like?"
    },
    {
      "content": "Explore the idea of 'balance' between the two halves. If one half has a higher sum, how can Alice ensure that it remains higher despite Bob's optimal moves?"
    },
    {
      "content": "Remember that Alice wants the sums to be unequal, while Bob wants them equal. This fundamental difference in objectives will guide your strategy for both players."
    },
    {
      "content": "Finally, consider how you can implement a decision-making process based on the counts of '?' and the current sums. Are there specific conditions that would guarantee Alice's victory?"
    }
  ],
  "questionNotes": [
    "The input string 'num' has an even length.",
    "The string consists of digits and '?' characters only.",
    "Alice starts first, followed by Bob, and they play optimally.",
    "The game ends when there are no '?' characters left.",
    "Return true if Alice wins (sums unequal), and false if Bob wins (sums equal)."
  ]
}