{
  "hints": [
    {
      "content": "Start by understanding the structure of a binary tree. Each node has a value, and it can have a left child and a right child. You'll need to traverse the tree to access nodes and their relationships."
    },
    {
      "content": "Remember that a grandparent is the parent of a node's parent. To find nodes with even-valued grandparents, you'll need to keep track of both the current node and its parent as you traverse."
    },
    {
      "content": "Consider using a depth-first search (DFS) approach to traverse the tree. This will allow you to explore each node and its children systematically."
    },
    {
      "content": "As you traverse, maintain a way to check if the grandparent node is even-valued. This means you should pass the values of the current node and its parent to the recursive function."
    },
    {
      "content": "Think about how to sum the values of nodes that meet the criteria. You can initialize a sum variable at the beginning of your function and update it whenever you find a valid node."
    },
    {
      "content": "Don't forget to handle the base cases. If the current node is null, you should return. Also, consider what happens when you reach leaf nodes."
    },
    {
      "content": "Make sure to check the constraints of the problem. The number of nodes is between 1 and 10,000, and node values range from 1 to 100. This suggests that your solution should be efficient."
    },
    {
      "content": "While traversing, you can use a helper function that takes three parameters: the current node, its parent, and its grandparent. This way, you can easily access the values you need."
    },
    {
      "content": "When you check if a grandparent is even, remember to only sum the values of the current node if the grandparent is indeed even. You can do this with a simple conditional check."
    },
    {
      "content": "Finally, ensure your function returns the accumulated sum after the entire tree has been traversed. This will be your final answer for nodes with even-valued grandparents."
    }
  ],
  "questionNotes": [
    "Constraints: The number of nodes in the tree is in the range [1, 10^4].",
    "Node values are between 1 and 100.",
    "Return 0 if there are no nodes with an even-valued grandparent.",
    "A grandparent of a node is defined as the parent of its parent."
  ]
}