{
  "hints": [
    {
      "content": "Start by calculating the total number of dresses across all washing machines. This will help you determine if it's possible to evenly distribute the dresses among them."
    },
    {
      "content": "Consider the condition for equal distribution: the total number of dresses must be divisible by the number of machines. If not, return -1 immediately."
    },
    {
      "content": "Once you confirm that distribution is possible, calculate the target number of dresses each machine should have. This is simply the total dresses divided by the number of machines."
    },
    {
      "content": "Think about how dresses can be moved between machines. You can only move dresses to adjacent machines, which means you need to consider the flow of dresses along the line."
    },
    {
      "content": "Identify machines that have more dresses than the target. These machines will need to give away dresses, while those with fewer dresses will need to receive them."
    },
    {
      "content": "For each machine, calculate the excess or deficit of dresses compared to the target. This will help you understand how many moves are needed."
    },
    {
      "content": "Consider the scenario where a machine has a deficit. It can only receive dresses from its left or right neighbor. Think about how to balance the flow between machines."
    },
    {
      "content": "As you think about moving dresses, remember that each move can only transfer one dress to an adjacent machine. This means you might need multiple moves for larger discrepancies."
    },
    {
      "content": "Track the maximum number of moves required for any single machine to reach the target. This will be a key factor in determining the total number of moves needed."
    },
    {
      "content": "Also, consider the cumulative effect of moves. If one machine gives away dresses, it might help multiple machines reach the target in fewer moves."
    },
    {
      "content": "When calculating the moves, keep in mind that you can only move dresses to adjacent machines. This creates a constraint on how quickly you can balance the machines."
    },
    {
      "content": "Think about edge cases, such as when all machines start with zero dresses. What would be the output in this case?"
    },
    {
      "content": "You may want to simulate the process of moving dresses between machines. This could help you visualize how the dresses are balanced over time."
    },
    {
      "content": "As you finalize your approach, ensure that you account for all machines. The solution should not just focus on one or two machines but consider the entire array."
    },
    {
      "content": "Your final step will involve determining the minimum number of moves based on the maximum excess or deficit calculated. This will lead you to the answer."
    }
  ],
  "questionNotes": [
    "Constraints: n == machines.length, 1 <= n <= 10^4, 0 <= machines[i] <= 10^5",
    "The total number of dresses must be divisible by n for equal distribution.",
    "You can only move dresses to adjacent machines.",
    "If it's impossible to balance the dresses, return -1."
  ]
}