{
  "hints": [
    {
      "content": "Start by understanding what symmetric coordinates mean. In this context, two points are symmetric if they are mirror images across a line, usually the X or Y axis. Think about how you can determine if two points are symmetric."
    },
    {
      "content": "Consider how to represent the coordinates. You have pairs of coordinates (X, Y). A point (X, Y) is symmetric to (X', Y') if X' = X and Y' = -Y or vice versa. Can you think of a way to check this?"
    },
    {
      "content": "Look at the data structure provided in the sample test case. You have a list of coordinates. You might want to iterate through this list and compare each pair of coordinates to check for symmetry."
    },
    {
      "content": "When comparing points, consider using a set to store the coordinates. This will help you quickly check if a symmetric counterpart exists for each point you examine."
    },
    {
      "content": "Think about edge cases. What happens if all points are the same? Or if there are no symmetric points at all? Ensure your solution accounts for these scenarios."
    },
    {
      "content": "Remember that the problem might require you to return unique symmetric pairs. How will you handle duplicates in the input list? You might need to filter them out before processing."
    },
    {
      "content": "You should also consider the order of output. If the problem specifies a certain format for the output, make sure your solution adheres to that. For instance, should pairs be returned in a specific order?"
    },
    {
      "content": "As you develop your solution, think about the time complexity. If you are comparing each point with every other point, that could lead to a quadratic time complexity. Can you optimize this?"
    },
    {
      "content": "To implement the symmetry check, you might want to create a helper function that takes two points and returns whether they are symmetric. This will make your main logic cleaner and easier to read."
    },
    {
      "content": "Finally, after implementing the checks, ensure you test your solution with the provided test case and additional edge cases. For example, try inputs with negative coordinates or very large values to see how your solution handles them."
    }
  ],
  "questionNotes": [
    "Input consists of a list of coordinates in the format [[X, Y], ...].",
    "Symmetric points are defined with respect to the axes.",
    "Consider uniqueness of points; duplicates should be handled appropriately.",
    "Output format may need to be specified; ensure to check requirements.",
    "Be mindful of edge cases like all points being the same or no symmetric pairs."
  ]
}