{
  "hints": [
    {
      "content": "Start by understanding the structure of the input data. You have two main components: 'Product' and 'Sales'. Each product has an ID and a name, while each sales record contains a product ID, a start date, an end date, and average daily sales."
    },
    {
      "content": "Consider how you will extract the relevant information from the input. You will need to iterate through the sales records to compute the total sales for each product over the specified periods."
    },
    {
      "content": "Remember that the sales data spans across different years. You will need to account for the start and end dates to determine which years the sales fall into."
    },
    {
      "content": "When calculating total sales for a given year, think about how to determine the number of days in each year that are covered by the sales period. This will involve checking the overlap of the sales period with each year."
    },
    {
      "content": "To find the overlap between the sales period and a specific year, you can define the start and end dates of that year. For example, for the year 2019, the start date is '2019-01-01' and the end date is '2019-12-31'."
    },
    {
      "content": "Consider how to calculate the total sales for a year. You can use the formula: total sales = average_daily_sales * number_of_days_in_year_overlap."
    },
    {
      "content": "Make sure to handle edge cases where the sales period starts or ends in the middle of a year. You will need to adjust the calculation of the number of days accordingly."
    },
    {
      "content": "As you iterate through each sales record, maintain a structure (like a dictionary) to accumulate total sales for each year. This will help you organize your results efficiently."
    },
    {
      "content": "Don't forget to initialize your total sales for each year before you start accumulating values. You might want to initialize a dictionary with years as keys and sales amounts as values."
    },
    {
      "content": "When you finish processing all sales records, you will need to format your output. Think about how you want to present the total sales by year, possibly as a list of tuples or a dictionary."
    },
    {
      "content": "Consider the case where there may be no sales in a particular year. Your output should reflect this, possibly by including years with a total of zero sales."
    },
    {
      "content": "Ensure that your solution accounts for multiple products. You will need to aggregate sales for each product separately before combining them into the final output."
    },
    {
      "content": "Pay attention to the data types of your dates. You may need to convert strings to date objects to perform date comparisons and calculations."
    },
    {
      "content": "When implementing your solution, think about the efficiency of your approach. You may want to minimize the number of times you iterate through the sales records."
    },
    {
      "content": "Finally, remember to test your solution with edge cases, such as overlapping sales periods, sales that span multiple years, and products with no sales."
    }
  ],
  "questionNotes": [
    "Ensure to handle date formats correctly; they are provided as strings.",
    "The sales records can overlap multiple years, so careful calculations of days are necessary.",
    "The output should include total sales for each year, even if the total is zero.",
    "The input data structure may contain multiple products and sales records, so maintain proper indexing."
  ]
}