{
  "hints": [
    {
      "content": "Start by calculating the distance that can be traveled using only the main tank. Remember, the truck travels 10 km for every liter of fuel."
    },
    {
      "content": "Consider how the fuel from the additional tank is utilized. It only transfers fuel to the main tank after every 5 liters consumed from the main tank."
    },
    {
      "content": "Think about how to keep track of the fuel consumption. You can use a loop to simulate the consumption of fuel from the main tank."
    },
    {
      "content": "Inside your loop, check if the main tank has consumed 5 liters. If it has, and there is fuel in the additional tank, transfer 1 liter back to the main tank."
    },
    {
      "content": "Make sure to account for the case where the main tank might run out of fuel before the additional tank can provide more. This will affect your total distance calculation."
    },
    {
      "content": "When calculating the distance, remember to update the distance after each fuel consumption event. This will help you keep track of the total distance traveled."
    },
    {
      "content": "Consider edge cases where the main tank is very small compared to the additional tank. How would this affect the distance calculation?"
    },
    {
      "content": "You might want to create a variable to keep track of the total distance traveled, updating it each time fuel is consumed from the main tank."
    },
    {
      "content": "Ensure your loop continues until the main tank is empty. You can use a condition to check if the main tank has any fuel left."
    },
    {
      "content": "Finally, after the loop, return the total distance traveled. Make sure to format your return value correctly as specified in the problem statement."
    }
  ],
  "questionNotes": [
    "The truck travels 10 km per liter of fuel.",
    "Fuel transfer from the additional tank happens only after every 5 liters consumed from the main tank.",
    "You need to handle cases where the main tank runs out of fuel before the additional tank can provide more.",
    "Constraints: 1 <= mainTank, additionalTank <= 100."
  ]
}