{
  "hints": [
    {
      "content": "Start by understanding what the transpose of a matrix means. For a given matrix, the element at position (i, j) becomes (j, i) in the transposed matrix."
    },
    {
      "content": "Consider the dimensions of the input matrix. If the input matrix has dimensions m x n, what will be the dimensions of the transposed matrix?"
    },
    {
      "content": "Remember that the input matrix is a 2D array. You will need to iterate through its rows and columns to access each element."
    },
    {
      "content": "Think about how to create a new matrix for the transposed result. You can initialize a new 2D array with dimensions n x m."
    },
    {
      "content": "As you iterate through the original matrix, you will need to assign values to the new matrix. For example, if you are at position (i, j) in the original, where should you place that value in the new matrix?"
    },
    {
      "content": "Consider edge cases, such as when the matrix is a single row or a single column. How would your approach handle these scenarios?"
    },
    {
      "content": "Make sure to handle the constraints provided. The maximum size of the matrix is 1000 x 1000, which means your solution should be efficient enough to handle this size."
    },
    {
      "content": "Think about how you will return the transposed matrix. What format should it be in? Ensure that your output matches the expected format exactly."
    },
    {
      "content": "You can use nested loops to iterate through the original matrix. The outer loop can go through each row, while the inner loop goes through each column."
    },
    {
      "content": "Here's a hint for your implementation: You can create a new matrix and fill it using a nested loop like this: \n\n```\nfor i in range(m):\n    for j in range(n):\n        transposed[j][i] = matrix[i][j]\n```\n\nThis will help you set the right indices."
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= m, n <= 1000 and 1 <= m * n <= 10^5.",
    "The values in the matrix can range from -10^9 to 10^9.",
    "Ensure the output is a 2D array in the correct transposed format."
  ]
}