{
  "hints": [
    {
      "content": "Start by understanding the structure of the data provided. You have a list of orders, each containing an order ID, order date, customer ID, and invoice amount. Focus on how you can extract the month and year from the order date."
    },
    {
      "content": "Consider using a data structure to store unique customers and orders. A dictionary (or hash map) can be useful to group orders by month and year. Think about how you can iterate through the list of orders and populate this structure."
    },
    {
      "content": "When processing each order, remember to convert the order date into a month-year format. You can use string manipulation or date parsing functions depending on the language you're using."
    },
    {
      "content": "As you group orders by month, ensure that you are counting unique customers correctly. You might want to use a set to keep track of customer IDs for each month to avoid duplicates."
    },
    {
      "content": "Think about how you will store the results. You could create a list of dictionaries or tuples that hold the month-year, the count of unique orders, and the count of unique customers."
    },
    {
      "content": "Be mindful of edge cases, such as months with no orders. Your final output should still reflect these months, potentially with zero counts for orders and customers."
    },
    {
      "content": "When you finalize your results, consider sorting the output by month-year. This will help maintain a clear chronological order in your results."
    },
    {
      "content": "Make sure to handle the date format correctly when outputting your results. You might need to format the month and year into a specific string format, such as 'YYYY-MM'."
    },
    {
      "content": "Before you return your results, double-check that you are returning the correct structure. The output should be a list of objects or dictionaries, each containing the month, unique order count, and unique customer count."
    },
    {
      "content": "Finally, ensure your code handles any potential errors gracefully, such as invalid dates or unexpected input formats. Test your solution with various datasets to verify its accuracy."
    }
  ],
  "questionNotes": [
    "Focus on extracting month and year from the order date.",
    "Use a dictionary or hash map to group orders by month and year.",
    "Count unique customers using a set to avoid duplicates.",
    "Handle months with no orders by including them in the final output.",
    "Ensure the output is sorted by month-year and formatted correctly."
  ]
}