{
  "hints": [
    {
      "content": "Start by understanding the initial state of the problem. You have `numBottles` full water bottles. Think about how many bottles you can drink right away."
    },
    {
      "content": "When you drink a full bottle, it becomes empty. Keep track of both full and empty bottles as you progress through the problem."
    },
    {
      "content": "Consider how the exchange works. For every `numExchange` empty bottles, you can get 1 full bottle back. This means you can keep cycling through drinking and exchanging."
    },
    {
      "content": "You should create a loop or a process where you continuously drink full bottles and exchange empty ones until you can no longer exchange. How will you check if you have enough empty bottles to exchange?"
    },
    {
      "content": "Think about how you can calculate the total number of bottles drunk in each cycle. After drinking, you need to update your counts of full and empty bottles."
    },
    {
      "content": "Remember to consider the case where you might not have enough empty bottles to exchange for a new full bottle. How will you handle this situation in your loop?"
    },
    {
      "content": "You can use a variable to keep track of the total bottles drunk. Each time you drink a bottle, increment this variable accordingly."
    },
    {
      "content": "After drinking all the full bottles, calculate how many new full bottles you can get from the empty ones. This is done by integer division of empty bottles by `numExchange`."
    },
    {
      "content": "Make sure to update the count of empty bottles after each exchange. When you get new full bottles, you should also account for the empty bottles generated from those."
    },
    {
      "content": "Finally, think about how you will exit your loop. You should stop when you can no longer exchange empty bottles for full ones. What condition will you use to break out of the loop?"
    }
  ],
  "questionNotes": [
    "Constraints: 1 <= numBottles <= 100",
    "Constraints: 2 <= numExchange <= 100",
    "Keep track of both full and empty bottles throughout the process.",
    "You need to return the total number of bottles drunk, not just the number of exchanges."
  ]
}